{"title":"Coast To Coast Am - 08-27-10 - Human Mutilations &amp; Abduction Phe","uid":5799121,"size":57427411,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:00aeb0b7ef3e1b283396dd9fc8694b082ff35aee&amp;dn=Coast+To+Coast+Am+-+08-27-10+-+Human+Mutilations+%26+Abduction+Phe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1283186173,"description":"Coast To Coast Am - 08-27-10 - Human Mutilations &amp; Abduction Phenomena\n\nDate:\n 08-27-10\n \nHost:\n Art Bell\n \nGuests:\n Butch Witkowski \n \n\n\nFilling in for George, Art Bell was joined for the entire duration of the program by Butch Witkowski, Director of the UFO Research Center of Pennsylvania, for a discussion on human mutilation cases that share astonishing similarities to cattle mutilations. Such cases of human mutilations have been reported around the world. In 2005, three families were found in the Beni Mazar region of Egypt mutilated just like cattle, Witkowski disclosed. A combat photographer in Vietnam claimed to have found a downed B-52 aircraft with the crew still strapped into their seats and mutilated in a similar fashion, he added. &quot;I think our little grey brethren from outer space are a little bit more malevolent than they are benevolent,&quot; Witkowski opined. \n\nOne of the best documented cases of human mutilation occurred in 1988 at the Guarapiranga Dam in Brazil. Photos of the crime scene as well as the autopsy report are readily available online, Witkowski said. As in cattle mutilations, the victim's body was drained of blood and marked by unusual holes, his sensory organs (eyes, ears, tongue) were taken, the anus had been cored out, and the digestive and reproductive systems removed. Even more gruesome, the man had been alive during his dismemberment, Witkowski noted. Although the victim had been killed 48 to 72 hours prior to discovery, there were no signs of decomposition or rigor mortis, the body had no odor, and, stranger still, no wounds from predators, he continued. It is typical for predators to avoid feeding on mutilated carcasses, Witkowski added, speculating that radiation may have something to do with keeping the animals away. \n\nWitkowski also addressed abduction phenomena, pointing out that about 30,000 people go missing each year and are never seen or heard from again. He believes the government may be complicit in some of these disappearances, and suspects a deal with extraterrestrials was brokered sometime in the 1950s. Witkowski commented on an abduction case sent in by a woman named Barbara. According to her report, a man was taken and murdered by aliens at Montour Ridge, near the town of Northumberland, Pennsylvania. Rescue workers and volunteers found him on the evening of the second day of their search. He was emaciated (not bloated), wearing only his underwear, and had an expression of horror on his face. Farmers in the area reported seeing a &quot;large round bright object&quot; pull something up into a beam of light. The autopsy uncovered no cause for death, though the toxicology report indicated the cause was from a cocaine overdose. Witkowski said the puzzling case remains open. \n\n\nWebsite(s):\n-paufosearch.com","torrent":{"xt":"urn:btih:00aeb0b7ef3e1b283396dd9fc8694b082ff35aee","amp;dn":"Coast+To+Coast+Am+-+08-27-10+-+Human+Mutilations+%26+Abduction+Phe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00aeb0b7ef3e1b283396dd9fc8694b082ff35aee","infoHashBuffer":{"type":"Buffer","data":[0,174,176,183,239,62,27,40,51,150,221,159,200,105,75,8,47,243,90,238]},"announce":[],"urlList":[]}}