{"title":"Micr0 XP Pr0 0 91 en SP3 x86 CD VL x14-73974-DarkReverser","uid":6462135,"size":228436479,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:00e96883a51319dd3a09ca86913f571f25b46238&amp;dn=Micr0+XP+Pr0+0+91+en+SP3+x86+CD+VL+x14-73974-DarkReverser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":2,"time":1307809013,"description":"  Micro XP Pro 0.91 New Edition\n\nBy DarkReverser\n\n\n\nInstallation time: ........11min\n\nSpeed:.......................As fast as it gets\n\nFunctionality:..............No errors, Fully functional\n\nIso Size:.....................217 MB\n\nHD Space: ................ 482 MB (after swap deletion)\n\nRequired Ram: .......... 64MB\n\nSecurity: ...................Improved (Tweaks + Updates)\n\nAutomatic: ................Setup &amp; speed enhancements\n\nPurpose.....................To minimize iso size while keeping most features and increasing security and speed.\n\n\n\n\n\nNew in 0.91 release:\n\n-WGA checking apps like Security Essentials now work\n\n-Includes KB2492386 for maximum app compatibility\n\n-Automatic Update now works  \n\n-Size of Iso greatly reduced with next to no feature loss\n\n-Tweaks scripts updated\n\n-Added web installers and shortcuts to desktop to save you time in getting certain apps on your system\n\n-XPlite addon is removed\n\n-ReAdded Ethernet Drivers since its used by VirtualBox\n\n\n\nSummary:\n\n\n\nThere are a lot of crap MicroXP out there, and this isn't one of them.\n\nThis is a quality release.\n\nNo need to activate.\n\nAll significant speed enhancement are built-in except for swap file.\n\nFeature-wise, this copy has almost all the features of original XP Pro.\n\nAutomatic Windows Update works.\n\nApp Compatibility now exceeds retail copy.\n\nWhy install this copy instead of retail? No need to activate, malware-free, much faster, more secure and requires less ram than retail copy.  \n\nCan I use this copy to fix my friend's computer?  Yes, this is a high quality release.\n\n\n\nInstructions:\n\n\n\nMake sure you &quot;Force Recheck&quot; the torrent once it is stopped and burn on a slow speed, select verify option.\n\nBurn on any media you want with imgburn, nero, poweriso etc...\n\nInstall is automatic, just configure your bios, choose where to install and everything else will be done for you.\n\n\n\nSupported Languages:\n\n\n\nArabic, Armenian, Chinese (Simplified only), Czech, Dutch, English, French, German, Hebrew, Hindi,\n\nHungarian, Italian, Polish, Portuguese, Romanian, Russian, Spanish, Swedish, Turkish, Vietnamese\n\n\n\nOnly the main regions for the languages are supported.  \n\nAll options in &quot;regional and language options&quot; work, and in accordance to the included languages above.\n\n\n\nI don't want to install XP on C Drive?\n\n\n\nYou have three options.\n\nMake sure only one storage unit is connected to computer prior to loading XP Setup; optical drive doesn't count.\n\n1. If you see another partition, select that partition.\n\n2. If there are no partitions, then you must create two partitions.\n\n  By default when you go to make a partition, XP gives the maximum size.\n\n  You need to reduce this size so that you can make a second partition.\n\n  Now create you second partition, and select it to install XP onto it.\n\n3. If there is exactly one partition, it is probably taking the whole hard drive, and you need to delete then create two partitions as discussed.\n\n\n\nEver heard about MicroXP 0.82?  \n\n\n\nI am not the author of the product and happily so.  Anyways it installs in half the time because it only has about 20% of the original feature set.\n\nWhat does that mean for you?\n\n\n\n-Many applications including drivers will not install correctly or at all.\n\n-Many errors\n\n-No Security Policies furthermore security policies impossible to implement\n\n-Administration not possible e.g., password protected account cannot be enforced\n\n-Sharing of Hard Drive is automatically on by default\n\n-Windows Firewall isn't included etc\n\n\n\nIn summary, that you can only use it on a offline computer and only for gaming.\n\nCan't be a good author if sharing of entire hard drive is on by default.\n\n\n\nWhat is MicroXP Pro 0.90 good for?  Everything, and improves security, speed and ram over retail.  It has about 90% of the feature set, yet is three times as small as original iso. That other 10% are features that can be forgotten, or for which a new version of the software exist.  Further below I list the removed components.\n\n\n\n\n\nUsing Windows Update, and word about Application Compatibility\n\n\n\nI previously stated that Windows Update and WGA checking apps like Security Essentials require XP to be activated in order to function.\n\nI am happy to report that I was mistaken and have tricked XP into thinking it is activated even though the activation component is absent from the release; lol.\n\nWindow Genuine Advantage is a backdoor.  It's a two-face program.  On the one hand, it will give its assessment of whether windows is genuine (properly licensed) or not, but\n\non the other hand (as it regularly contacts Microsoft) Microsoft can give its own assessment, deem it ungenuine and instruct the app to de-activate windows or certain features.\n\nOn MS update, it is currently known as KB905474, but future versions will come out; perhaps with a different Knowledge Base number.  The point is, we don't want a backdoor on pirated\n\ncopy of XP.  Here pirated means (created from retail version, but unproperly licensed).  The genuine advantage is suppose to be access to exclusive MS apps and certain XP updates.\n\nBut the program itself falsely identifies Micro XP Pro as genuine.  To add to insult, it comes to this conclusion with licensing component fully removed from XP\n\nBut remember even if it marks XP as genuine, it is still a backdoor for Microsoft.  Yap, I've tricked XP into thinking it's properly licensed even though licensing component is removed\n\nConclusion:  If your going to use install MS updates, don't install KB905474 or anything &quot;Windows Genuine Advantage&quot;.  Not installing this may prevent you from installing updates from Internet Explorer.\n\n                  However, you'll still be able to update XP with Automatic updates.  In short, I garentee Automatic Updates.  Also avoid update KB955759 (as the component is removed from XP).\n\n      Alternatively to Automatic Updates, you may install and use Microsoft Baseline Security Analyser 2.2\n\n\n\n\n\nFinally, with regard to App Compatibility, one could argue that it is impossible to have better app compatibility in the wake of removed components/services.\n\nMy counter argument is simply that next to no apps utilise the components/services I remove therefore unaffecting app compatibility\n\nAND\n\nI include a MS compatibility update; for software that failed to work out of the box for XP SP3 retail.\n\nTherefore, Micro XP Pro 0.91 has superior app compatibility than retail.\n\n\n\n\n\nRecommondations\n\n\n\nGeneral\n\n          Read the &quot;Using Windows Update&quot; section.\n\n       Remember that windows is best protected by Virtualization or Anti-Virus products and Firewalls, not by security updates.\n\nIf you wish to use themes, you must first enable it.  On the Desktop, click on theme.bat\n\nDo not turn off &quot;file and printer sharing&quot; firewall exception if you intend to do such an activity or your software uses the &quot;computer browser&quot; service.\n\n\n\nCore Dependencies\n\nMany apps, require a specific .net framework, flash player, java or visual c++ runtimes.  \n\n          Downloading and installing .net frameworks AIO x86 via desktop shortcut is a MUST.  \n\n          For games, you need to update directx via desktop web installer.\n\n\n\nMalware Protection\n\nVirtualization is best; Returnil Virtual System Pro and Deep Freeze are great products.\n\nBasically when you restart your computer, all changes to your system are undone; infect me trojan for upon restart you are gone.\n\nAnti-virus products are garbage in comparison, but still offer some protection.  I can easily make viruses to evade AVs.\n\nThe best free product is Avira Personal for Antivirus; highest pro-activate and manual scan detection rate of any free AV product.\n\n\n\nFirewall Protection\n\n          Firewalls have one purpose; to control the flow of information.\n\n          An computer intrusion itself is merely used to acquire intel; how is your computer vulnerable?  Can I remotely install information stealing software?  Can I wardrive off your network?\n\n                                                                                                who are you? How can I profit off the intrusion.  No profit or gain potential, next computer.\n\n          A program seeking to relay a message over the internet is either a legitimate piece of software, or a trojan that recorded your keystrokes, took screenshots and wants to relay that\n\n          information to its master.\n\n          Windows Firewall only provides limited inbound or intrusion protection.  It provides no outbound protection, but it barely has any effect on the speed (latency) of the internet.\n\n          Comodo Firewall provides the greatest inbound and outbound protection, but it can reduce browsing speed.  \n\n          Zone Alarm Pro fails many outbound aptitude tests, and tends to be buggy.\n\n\n\nRecommended Utilities\n\nInstall glary utilities and use all of their utitilies including 1-click maintenance and registry defrag.\n\nInstall beachbit.  Cleans windows best.  Make sure to Uncheck free disk space AND memory dump; bsod logs.\n\nIf using magnetic storage, defrag hard drive.\n\nFor backups, use EASEUS Todo Backup Home.  Note: All partitions must be NTFS or of FAT type.  So if you're duel booting linux look elsewhere.\n\nDon't use internet explorer, use google chrome for browsing AND opening pdfs.\n\nFor video, use VLC.\n\nProblem deleting files in use?  Install Unlocker.\n\nFor archiving use 7zip, Peazip, Universal Extractor.\n\n\n\n\n\nBelow you find in depth information about this release.  \n\nI remove components and services either because they present no benefit, little benefit or a security benefit.\n\nIt's extremely rare to find an app that uses something I removed; so put your mind at ease.  Don't panic.\n\n\n\nRemoved Components (as of 0.91)\n\n\n\n-XPlite (no longer beneficial; use add/remove windows component)\n\n-Images and Backgrounds (no benefit, either you use a plain or downloaded background)\n\n-Netmeeting (Old Software, use Team Viewer)\n\n-Outlook Express (Old Software, install Windows Live Mail)\n\n-Service Pack Messages (useless)\n\n-Indexing Service (useless, was already disabled in previous release...now removed)\n\n\n\n\n\nRemoved Components (as of 0.90):\n\n\n\n               Support for Multi-port Serial Adapters (nobody uses this nowdays)  \n\n               Many UnnecessaryDrivers (space and slows XP install)\n\n   File and Settings Wizard (useless, transfers too little settings 2B worthwhile)\n\n               Korean/Japanese Languages   (huge thus removed)\n\n               XP Help Files (useless, web is better)\n\n               Out of Box Experience; (useless, past feature loss circumvented)\n\n               Upgrade Functionality (clean install is best anyway)\n\n               Program Compatibility Wizard (not needed)\n\n               MSN Explorer (not important)\n\n               .art image format (old)\n\n   Intel Indeo Codecs (old)\n\n   Luna Desktop theme (useless)\n\n   Movie Maker (old)\n\n   Music Samples (useless)\n\n   FrontPage Extentions (useless)\n\n               Old .net Framework Files (unused)\n\n               Old Blaster removal tool          \n\n   MS XML 2.0 (old)\n\n   Search Assistant (useless)\n\n               Tour (useless)\n\n   Removed CD Directories: DOCS,SUPPORT,VALUEADD                              \n\n                         \n\nI know what your thinking; already this copy of XP feels too modded too different from retail, but no other microXP of this size emulates the retail copy better than this one.\n\n\n\nSome services are removed via &quot;startup.bat&quot; in &quot;$OEM$&quot; either because they are relatively useless or for security reasons.\n\nShould you be aware of an app that depends on a few you need to delete lines from script and replace it on iso with MagicISO, save, burn, install xp.\n\n\n\nRemoved Services and likelyhood some apps depend on it are:\n\n\n\n Network DDE Rare  \n\n Network DDE DSDM               Rare\n\n IPSEC Services                      Rare, removed because very few people use this\n\n Net Logon                              Rare, won't affect your internet; this isn't the dialup service\n\n Routing and Remote Access   Rare, removed for security reasons\n\n Shell Hardware Detection        Rare, won't affect hardware compatibility\n\n WMI Performance Adapter      Rare, monitoring service that eats up ressources\n\n\n\nNetwork DDE is used to initiate and maintain the network connections needed for DDE conversations between applications running on different computers in a network. But even then DDE is rarely utilized. Network DDE is abondoned as of Vista.  Wireless file transfer doesn't depend on DDE.\n\nRouting and Remote Access is disabled on XP Pro SP2 and up by default, therefore removed; BlackViper source.\n\nVery very few apps should be affected by the removal of the above services, so few that it is safe to excluded them.\n\n\n\n\n\nBuilt-in tweaks: Some were builtin using nlite, the rest are found in startxp.bat.  There are over a hundred tweaks between them.\n\n\n\nRegarding IIS (install with Add/Remove Windows Component):\n\n\n\nIIS which is Microsoft's version of Apache webserver is included, but I choose not to integrate the following updates for it:\n\nKB953155\n\nKB970483\n\nKB2124261\n\n\n\nComplaints, installation errors, bsod etc\n\n\n\nIf you experience installation errors or bsod, your copy of micro XP 0.91 is broken; follow the instructions and you should be set.\n\nIt does not come with post install.  I cannot design a post install that will suit everyone, furthermore even if that were possible the iso size would be massive.\n\nThat's completely against the goal of this project; yap you have to install software 1 by 1 unless you make or have your own AIO.\n\nNote: I did provide a link to .net frameworks AIO which comes with a bunch of other software.  \n\nOf course, Micro XP Pro comes with Internet Explorer and Windows Firewall.\n\nAutomatic Updates works.  MUI works.  Themes work once enabled.\n\nQuick buttons on taskbar do not work; investigating.\n\nInstallation errors are extremely rare if you have a good copy.\n\nThe exception is malfunctioning hardware OR really old hardware manufactured before XP was released.\n\nBSOD can be caused by malfunctioning hardware OR really old incompatible hardware, but most of the time it is caused by cheaply designed drivers.\n\nIf you get BSOD, ask yourself which hardware or software company gave me a crappy driver; you will be correct 99.9% if your copy of the driver and of windows are good, and your hardware is undamaged.\n\nIn other words, if you get BSOD it has nothing to do with this copy of XP; nothing.","torrent":{"xt":"urn:btih:00e96883a51319dd3a09ca86913f571f25b46238","amp;dn":"Micr0+XP+Pr0+0+91+en+SP3+x86+CD+VL+x14-73974-DarkReverser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e96883a51319dd3a09ca86913f571f25b46238","infoHashBuffer":{"type":"Buffer","data":[0,233,104,131,165,19,25,221,58,9,202,134,145,63,87,31,37,180,98,56]},"announce":[],"urlList":[]}}