{"title":"Section 8 Prejudice [PCgame-Eng]","uid":6385448,"size":4925012061,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:02ef7c946039a0e571bfeba5b415af85fdcb3443&amp;dn=Section+8+Prejudice+%5BPCgame-Eng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webcsyn","files":3,"time":1305192876,"description":"RELEASE NOTES \nOn the battlefield, prejudice takes many forms, knows no boundaries, and drives all conflict. In the distant future, humanity will call on its most fearless defenders to confront an emerging threat determined to eradicate all human life as we know it. Section 8: Prejudice is a sci-fi first-person shooter with dynamic combat, where every decision - from customizing equipment to activating team based objectives - drastically impacts the battlefield. \n\nFeatures \nPlay as Alex Corde and discover the sinister series of betrayals that now threaten humanity's survival in the single player campaign. Compete in various multiplayer modes with up to 40 players - from the extreme, strategic play of &quot;Conquest&quot; to the hordes of robust AI opponents in &quot;Swarm&quot;. Strategically spawn anywhere on the battlefield to assist allies or ambush enemies. Customize loadout weapons, ammo, and equipment to suit your playstyle. Call in deployables and vehicles when and where you need them to gain tactical advantages. Master true mobility with dropping, overdrive, and jetpacks to outmaneuver opponents. Complete a variety of Dynamic Combat Missions - from launching aerial strikes against fortified positions to securing crucial intel. Advance in rank and skill to access a devastating arsenal of over 60 weapons, equipment, and upgrade variants. \n\nINSTALL NOTES \n1. Mount or burn image \n2. Install using serial: 11111-11111-11111-11111-11111 \n3. Copy all files from the SKIDROW folder to the game installation \n4. Play the game \n5. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:02ef7c946039a0e571bfeba5b415af85fdcb3443","amp;dn":"Section+8+Prejudice+%5BPCgame-Eng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02ef7c946039a0e571bfeba5b415af85fdcb3443","infoHashBuffer":{"type":"Buffer","data":[2,239,124,148,96,57,160,229,113,191,235,165,180,21,175,133,253,203,52,67]},"announce":[],"urlList":[]}}