{"title":"HISTORY OF POP AND ROCK MUSIC - part 294","uid":6322727,"size":1324654124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:06a743ec3f8d9c1478230db97322a709d3a714a0&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+294&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1302990281,"description":"                  PART  294\n\n\n       01. BOB MARLEY - Concrete Jungle  (1973)\n       02. UB 40 - One In Ten  (1981)\n       03. PETER TOSH  - Johnny.B.Goode  (1983)\n       04. ASWAD  -  Dont Turn Around  (1988)\n       05. ASWAD  -  Best of My Love  (1990)\n       06. ASWAD  -  Smile  (1990)\n       07. ASWAD  -  Shine (1994)\n       08. ASWAD  -  What Is Love  (2009)\n       09. DAMIAN Jr. Gong MARLEY feat. CAPLETON  - It was written  (2001)  \n\n\n\n   &quot;Catch a Fire&quot; is debut album for Jamaican reggae band The Wailers, released on Island Records in 1973. The album established the band as international superstars. Leader Bob Marley in particular became world-famous.&quot;Catch a Fire&quot; peaked at #171 and #51 on Billboard's Pop Albums and Black Albums charts respectively. It is number 123 on Rolling Stone's list of the 500 greatest albums of all time, the second highest placement of the five Bob Marley albums on the list, after the posthumous compilation album &quot;Legend&quot;. It is also regarded as one of the top reggae albums of all time.&quot;Concrete Jungle&quot; is the opening track on their album and was one of the lead single from the album. \n  &quot;One in Ten&quot; is a single by UB40 released in 1981 on their second album &quot;Present Arms&quot;. It reached No. 7 on the UK singles charts. &quot;One in Ten&quot; is mistakenly cited as referring to the number of unemployed in the UK at that time. It is in fact a song about government statistics in general, and how politicians use them to de-humanise problems. \n  &quot;Best of My Love&quot; is a song written by Don Henley, Glenn Frey and J.D. Souther. It was originally recorded by the Eagles and included on their 1974 album &quot;On the Border&quot;. Prior to the release of the Eagles version as a single, John Lees released his version of &quot;Best of My Love&quot; as a single in 1974. Another early cover was by Tanya Tucker recorded in 1974 in her final sessions for Columbia Records; her version was first issued on the You Are So Beautiful album in June 1977. &quot;Best of My Love&quot; has also been recorded by Yvonne Elliman on her 1975 album Rising Sun; by La Costa on her 1976 album Lovin' Somebody; by reggae group Aswad on their 1990 album, Too Wicked; and by Rod Stewart on his 2006 album Still the Same... \n  &quot;Don't Turn Around&quot; is a popular song written by Diane Warren and Albert Hammond. It was originally recorded by Tina Turner as the B-side to the single &quot;Typical Male&quot; in 1986.It has been covered by a number of artists. Kim Goody released a single version in 1987.  Bonnie Tyler released her version on her 1988 album &quot;Notes from America&quot;, while soul singer Luther Ingram had a U.S. #55 R&amp;B hit with his interpretation. Aswad heard Ingram's version and made a cover of it, taking the song to #1 on the UK singles chart in March 1988. This version also reached #45 on the Hot R&amp;B/Hip-Hop Songs chart that same year.\n  &quot;Shine&quot; became reggae group Aswad's second big hit, after 1988's &quot;Don't Turn Around&quot;. Released in early 1994,  it was the first single from the group's album &quot;Rise And Shine&quot;. It eventually reached the Top 5 of the UK Singles Chart, peaking at #5, giving the group their second Top 5 hit. This was followed by chart success in the rest of Europe as well as in Japan and the Caribbean. &quot;Shine&quot; and &quot;Don't Turn Around&quot; remain the group's most popular hits.Aswad released their most recent material in 2009 with the album &quot;City Lock&quot;. They released singles &quot;What Is Love?&quot; and &quot;Do That Thing&quot; in the same year\n   Damian Marley, the jamaican roots-reggae artist, was born on July 21, 1978 in Kingston, Jamaica, and is the youngest male child of reggae legend Bob Marley, and the only child born to Marley and Cindy Breakspeare, the Miss World 1976. Damian's nickname is Junior Gong which is derived from his father's nickname of Tuff Gong.His father died when he was two years old, yet his message still lives through the music of his children. \n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:06a743ec3f8d9c1478230db97322a709d3a714a0","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+294","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06a743ec3f8d9c1478230db97322a709d3a714a0","infoHashBuffer":{"type":"Buffer","data":[6,167,67,236,63,141,156,20,120,35,13,185,115,34,167,9,211,167,20,160]},"announce":[],"urlList":[]}}