{"title":"The Walking Dead All Issues 1-76","uid":5811436,"size":956529838,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:07c3196913f0954ca4b5dd5a7b69c055cf07c4f5&amp;dn=The+Walking+Dead+All+Issues+1-76&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"w_","files":77,"time":1283646926,"description":"Great comic series, but all 76 issues never seem to be in one place. Problem solved.\n\nThe Walking Dead is centered on Rick Grimes, a small-town police officer from Cynthiana, Kentucky, his family, and a number of other survivors who have banded together in order to survive after the world is overrun with zombies. As the series progresses, the characters become more developed, and their personalities shift under the stress of a zombie apocalypse, most notably Rick's.\n\nIn the beginning of the series, Rick and partner Shane are in a firefight and Rick is shot and enters a coma. Upon waking in a hospital, he discovers the undead are in the building and town. Rick returns home and shortly decides to go to Atlanta, where the survivors were told to await help, to find his wife Lori and son Carl. He discovers the city is crowded with zombies and bumps into Glenn, a scavenger for a band of survivors. Following Glenn, Rick discovers Lori and Carl are okay along with Shane, who is less than happy that his former partner has returned. He also meets new survivors.\n\nThe group search for a place to call home, settling in several temporary camps, including a prison, which comes to the attention of an insane man calling himself the Governor. The Governor runs his local city, Woodbury, Georgia, like a dictator and tortures Rick and other members of his group, culminating in an assault. After the prison is made unsecure by an attack, Rick and the surviving members, after leaving with others to Washington D.C for a chance to cure the infection, encounter cannibals and a township that is enclosed and safe, but holds a secret.\n\nEnjoy","torrent":{"xt":"urn:btih:07c3196913f0954ca4b5dd5a7b69c055cf07c4f5","amp;dn":"The+Walking+Dead+All+Issues+1-76","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07c3196913f0954ca4b5dd5a7b69c055cf07c4f5","infoHashBuffer":{"type":"Buffer","data":[7,195,25,105,19,240,149,76,164,181,221,90,123,105,192,85,207,7,196,245]},"announce":[],"urlList":[]}}