{"title":"The Imaginarium of Dr.Parnassus 2010 DVD NLT-Release","uid":5788278,"size":4570000553,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:080a27ba30350b0cbc09fc98520783a2a5ebddf2&amp;dn=The+Imaginarium+of+Dr.Parnassus+2010+DVD+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1282735181,"description":"The Imaginarium of Dr.Parnassus 2010 DVD NLT-Release\n\n\n[url=http://www.moviemeter.nl/film/59498]Moviemeter[/url]\nVerenigd Koninkrijk / Canada / Frankrijk\nFantasy / Mystery\n123 minuten\ngeregisseerd door Terry Gilliam\nmet Heath Ledger, Christopher Plummer en Lily Cole\n\nDe film vertelt het verhaal van Dr. Parnassus (Christopher Plummer), die met zijn theatergezelschap stad en land afreist om het \n\npubliek nog nooit vertoond vertier voor te schotelen. Zijn gave maakt het zijn publiek mogelijk om via een magische spiegel aan de \n\nrealiteit van alledag te ontsnappen. Maar er rust ook een vloek op hem. Al eeuwen lang sluit hij namelijk weddenschappen af met de \n\nduivel, Mr. Nick (Tom Waits), waaraan hij o.m. zijn exclusieve onsterfelijkheid te danken heeft. Diezelfde Mr. Nick keert nu terug om \n\neen prijs voor hemzelf op te eisen, namelijk de innemende en kostbare dochter van Dr. Parnassus, Valentina (Lily Cole), op de dag dat \n\nze zestien jaar wordt. Dr. Parnassus heeft nog een laatste weddenschap met Mr. Nick nodig om zich uit deze benarde situatie te redden.\nDe onsterfelijke Doctor Parnassus reist met zijn theater rond de wereld. Het hoogtepunt van de voorstelling is de 'Imaginarium', een \n\nspiegel die toegang geeft tot een wereld die de wildste dromen uit laat komen van iedereen die erdoor stapt. Parnassus' \n\nonsterfelijkheid heeft echter een prijs. Hij moet zijn dochter Valentina afstaan aan de duivel, tenzij hij nog vijf zielen kan \n\noverhalen zichzelf te verliezen in de Imaginarium.\nIn The Imaginarium of Doctor Parnassus van regisseur Terry Gilliam schittert Heath Ledger in zijn laatste rol, naast sterren als \n\nJohnny Depp, Jude Law en Colin Farrell. \n\n[url=http://www.imdb.com/title/tt1139328/]IMDB[/url]\nUK / Canada / France \nFantasy / Mystery \n123 minutes \ndirected by Terry Gilliam \nHeath Ledger, Christopher Plummer and Lily Cole \n\nThe film tells the story of Dr. Parnassus (Christopher Plummer), who with his traveling theater town and country to the public \n\nunprecedented fun to dish. His talent makes it possible to his audience through a magical mirror to the realities of everyday life to \n\nescape. But there also lies a curse on him. For centuries he closes namely bets with the devil, Mr. Nick (Tom Waits), for its \n\nexclusive immortality which he owes. The same Mr. Nick will return to a price for him to claim, namely the charming daughter of Dr. \n\nand costly. Parnassus, Valentina (Lily Cole), on the day she is sixteen years. Dr. Parnassus has one last bet with Mr. Nick need to \n\nconsider the plight to save. \nThe immortal Doctor Parnassus with his travels around the world theater. The highlight of the show is the 'Imaginarium', a mirror \n\nwhich gives access to a world that the wildest dreams of those who come late get through it. Parnassus' Immortality has a price. He \n\nmust surrender his daughter Valentina to the devil, unless he can convince himself five souls to lose in the Imaginarium. \nIn The Imaginarium of Doctor Parnassus directed by Terry Gilliam shines Heath Ledger in his last role, alongside stars like Johnny \n\nDepp, Jude Law and Colin Farrell.\n\nTaal: Engels!\nOndertiteling: Nederlands aan/uit!\nDe Cover en Label zijn er apart bij!\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Fantasiefilm Mysterie\n \nWeblink : http://www.moviemeter.nl/film/49753 \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1054606/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1054606/&lt;/a&gt;\n\n\nEnjoy the movie\n\nXX-Men","torrent":{"xt":"urn:btih:080a27ba30350b0cbc09fc98520783a2a5ebddf2","amp;dn":"The+Imaginarium+of+Dr.Parnassus+2010+DVD+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"080a27ba30350b0cbc09fc98520783a2a5ebddf2","infoHashBuffer":{"type":"Buffer","data":[8,10,39,186,48,53,11,12,188,9,252,152,82,7,131,162,165,235,221,242]},"announce":[],"urlList":[]}}