{"title":"HQavi - improve video quality on the fly!","uid":6313204,"size":4284416,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:09d2efade4d027beeb888023336e7a5c73142269&amp;dn=HQavi+-+improve+video+quality+on+the+fly%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"isohahunt","files":-1,"time":1302566608,"description":"Now you can download small video file in worse quality, but watch it in high quality using HQavi!\nHQavi is designed to improve video quality. Moreover, the processing occurs on-the-fly, automatically activated when playing videos on the supported media players. Thus, the user does not need to perform additional actions to improve video quality.\n\n- Software works automatically. No user actions are required\n\n- No prior video processing needed. Quality improvement occurs on-the-fly!\n\nUsing HQavi is simple. In order to install HQavi you need to start HQavi_setup.exe and follow the instructions. After installation software is ready to be used. You can see software icon in system tree. HQavi is added to the startup programs and will be started automatically after each computer start/reboot. \n\nHQavi is working in background without user interaction. When user plays video file HQavi automatically starts video enhancements and video player shows video with improved quality. At the moment of connection HQavi to the video player Windows will show hint message stating that HQavi is connected to the video player. All video processing is happing on-the-fly in real time of video playback. CPU utilization is calculated dynamically which allows video processing by HQavi do not affect overall computer performance. \n\n","torrent":{"xt":"urn:btih:09d2efade4d027beeb888023336e7a5c73142269","amp;dn":"HQavi+-+improve+video+quality+on+the+fly%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09d2efade4d027beeb888023336e7a5c73142269","infoHashBuffer":{"type":"Buffer","data":[9,210,239,173,228,208,39,190,235,136,128,35,51,110,122,92,115,20,34,105]},"announce":[],"urlList":[]}}