{"title":"Tom McRae...Tom McRae(2000)[FLAC]","uid":5793568,"size":258266384,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:09f30f3d033b8e17fa36e45a0f9890a154374700&amp;dn=Tom+McRae...Tom+McRae%282000%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":18,"time":1282947868,"description":"2000 Tom McRae   CD   db001ed1px \n\nIn the year 2000, we were all over run with singer songwriters, aching with belly's full of Babylon on top of White Ladders. Among all albums that came out that year Mercury Nominated Tom Mcrae's self titled stood out but sadly went unheard.\n\nThis guy is the real thing, setting his stall out on the first song with a menacing acoustic playing in tune with claustraphobic strings singing about how 'You cut her hair' a song inspired by his trip to the nazi hotels of death.\n\nCome song two he's watching us from up above looking as we wake up to our alarms, driving our fabulous cars, searching for a sign with our names, Tom is up above telling us is not the one wasting his time while pleading to anyone to 'Dose Me Up'\n\n'2nd law' A simple piano ballad telling us 'Im better off alone' all too clearly from the grave\n\nWe slide dreamily into track four,' staying awake with his caffeine headache' only satsfied with 'a knife in your spine' 'your bloodless'  'what am I feeling if you know me so well'\n\n'Draw down the stars'  A man lost in a city,a city he just cant stop coming back to anywhere 21st century, He's 'Coughing into his sleeve'  'Picturing her by the ocean'\n\n\n'One More Mile'  A homage to darkness, lost hours and lost sleep. He sings quitely 'Pour another drink, take a good look around' 'One more mile, but do I have the will?'\n\nSide2\n\n'Boy with the bubblegun'\n\nA gentle strum and that choir boy voice 'Welcome to the second reel'  a boy with a bubblegun whos taking aim, 'But the endings not the same, they changed it from the book' 'Time to kill the king, it's written in the scriptures' Mcrae sounds in a deep trance like state surronded by the gentle cello, but leaves someone with a warning 'If words could kill, Id spell out your name'\n\n\nIn 'Hidden camera show'  we are all invited to carry a gun, taught thrills of deception, chills of rejection' singing to us to swallow our tounges, its his fight not ours, while singing of the drunks singing 'My Way' in a rare flash of humor.\n\n\nA&amp;B \nA song of two different men, or one mans duel life, A knows he's gonna be somebody, B has a dreamy 'Benylin' brain A has a cocaine fuelled brain.  The bongos seam together with the strings to bring you into a hypnotic Beneylin trance where 'All our time slips away' They roll the dice ready to fight or walk away\n\n'Language of fools'  A gorgeaus ballad of the oldest emotion of all, love.  Strings and piano accompany Tom as he pleads to 'Hold me, hold my life' 'Let me have this time'\n\n'Untitled'  Simple piano chords, we are straight into a mans crisis, 'Get me out, get me out' his voice is soaked in a sense of loss, almost shouting for the first time on the album.\n\n'Sao paulo rain' A term used to much but this is Dylanesque, sounds like it was recorded on Desolation Row. Parties on funereal row, gasoline dreams, girls in blue dreams, blood red earth, take a hit and dance in the sao paulo rain.\n\n'I aint scared of lightning'  A short acoustic strummed ditty, a man so fed up it's like he's daring any god,man or army to have a go, He aint scared, he's standing proud, come on do your worst' the album fades out on a almost positive note, 'Im still here'\n\n\nTom Mcrae was nominated for the mercury music award for this story of feeling alone in the 21st century streets full of noise, crowds, sadness, cursing us all for our greed,lust,envy,hatred while realising he himself is full out those feelings.\n\nTom Mcrae is now on his fourth album, a hidden gem known to a small loyal fanbase and a darling of the critics. \n\nStart with this perfect debut, Hear it and weep.\n\n1 You Cut Her Hair  2:46 \n2 End of the World News (Dose Me Up)  3:48 \n3 2nd Law  2:51 \n4 Bloodless  3:38 \n5 Draw Down the Stars  2:14 \n6 One More Mile  4:16 \n7 The Boy with the Bubblegum  3:01 \n8 Hidden Camera Show  4:17 \n9 A &amp; B Song  4:15 \n10 Language of Fools  3:57 \n11 Untitled  3:51 \n12 Sao Paulo Rain  4:51 \n13 I Ain't Scared of Lightning  1:25 \n\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:09f30f3d033b8e17fa36e45a0f9890a154374700","amp;dn":"Tom+McRae...Tom+McRae%282000%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09f30f3d033b8e17fa36e45a0f9890a154374700","infoHashBuffer":{"type":"Buffer","data":[9,243,15,61,3,59,142,23,250,54,228,90,15,152,144,161,84,55,71,0]},"announce":[],"urlList":[]}}