{"title":"Jacob's Ladder [1990] dir Adrian Lyne","uid":6499430,"size":1960307877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a0e4e2c1b2e43dba149675fa1b20ab1633f0d7a&amp;dn=Jacob%5C%27s+Ladder+%5B1990%5D+dir+Adrian+Lyne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1309194997,"description":" &lt;a href=&quot;http://bayimg.com/maIJcAAdN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/maIJcAAdN&lt;/a&gt;\n\nJacob's Ladder (1990) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0099871/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0099871/&lt;/a&gt;\n\nJacob's Ladder is a 1990 psychological thriller / horror film directed by Adrian Lyne, based on a screenplay by Bruce Joel Rubin. It stars Tim Robbins, Elizabeth PeÃƒÂ±a, Danny Aiello, and Jason Alexander. Actor Macaulay Culkin appears briefly in an uncredited performance.\n\n\n Tim Robbins ...  Jacob Singer \n Elizabeth PeÃƒÂ±a ...  Jezzie \n Danny Aiello ...  Louis \n Matt Craven ...  Michael \n Pruitt Taylor Vince ...  Paul \n Jason Alexander ...  Geary \n Patricia Kalember ...  Sarah \n Eriq La Salle ...  Frank \n Ving Rhames ...  George \n Brian Tarantina ...  Doug \n Anthony Alessandro ...  Rod \n Brent Hinkley ...  Jerry \n S. Epatha Merkerson ...  Elsa \n Suzanne Shepherd ...  Hospital Receptionist \n Doug Barron ...  Group Leader \n\nThe title of the film refers to the biblical story of Jacob's ladder, or the dream of a meeting place between Heaven and Earth (Genesis 28:12). The earliest literary antecedent appears in Don Juan Manuel's Libro de los ejemplos del conde Lucanor y de Patronio (&quot;Book of the examples of Count Lucanor and of Patronio&quot;), chapter XI, in which a life happens in an instant (1337). This story was rewritten by Jorge Luis Borges in the short story &quot;The Wizard Postponed&quot; in his book A Universal History of Infamy (1935). A similar dying hallucination occurs in Borges' short story The Secret Miracle (1944).\n\nThe movie's events can be interpreted as the wanderings of an unknowing soul through purgatory, or as a lengthy delirious hallucination prior to death. Director Robert Enrico used a similar conceit for his 1962 film short An Occurrence at Owl Creek Bridge, based on Ambrose Bierce's 1886 short story, and which appeared on American television as a 1964 episode of the fantasy-anthology series The Twilight Zone.\n\nThe film is also viewed by many, including the screenwriter, as a modern interpretation of Bardo Thodol, the Tibetan Book of the Dead.\n\nVariety magazine wrote that producer Alison Rosenzweig is at work with New Line Cinema on developing a remake of Jacob's Ladder, with a possible release in 2010.\n\nThe idea of a whole plotline that is revealed to be a dying character's agonizing vision has been used extensively in recent time cinema. Examples include &quot;The I Inside&quot;, &quot;Stay&quot; and &quot;November&quot;.\n\nIn the film, when Jacob Singer unfolds an old Army discharge certificate, the service number &quot;US 21 719 365&quot; can briefly be seen. This would correspond to a National Guard service number with a prefix indicating conscription into the Army of the United States (a situation which would never occur as all National Guard numbers from the Vietnam War began with the prefix &quot;NG&quot;).\n\nI first saw this film in a 'restored' screening, so to me its theatrical edit seems incomplete and uncessesarily brief.  What are extraordinary to me are first the special effects which are done with editing, lighting, and prosthetics rather than with superimposition or cgi; second the fact that there are four simultaneous storylines occuring which only became evident to me after several screenings.\n\n","torrent":{"xt":"urn:btih:0a0e4e2c1b2e43dba149675fa1b20ab1633f0d7a","amp;dn":"Jacob%5C%27s+Ladder+%5B1990%5D+dir+Adrian+Lyne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a0e4e2c1b2e43dba149675fa1b20ab1633f0d7a","infoHashBuffer":{"type":"Buffer","data":[10,14,78,44,27,46,67,219,161,73,103,95,161,178,10,177,99,63,13,122]},"announce":[],"urlList":[]}}