{"title":"The Attempted Sinking of the USS Liberty","uid":6382459,"size":454276746,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e4bb5415a11861e57858fe4e5b5bf6a1ae741d6&amp;dn=The+Attempted+Sinking+of+the+USS+Liberty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Borzoi","files":1,"time":1305076992,"description":"\nThe USS Liberty was a United States Navy technical research and Intelligence ship, that was attacked by numerous Israeli Air Force jet fighter aircraft AND Israeli Navy torpedo boats on June 8, 1967, which was during the Israeli &quot;Six-Day War&quot;.\n\nThe combined air and sea attack killed 34 crew members (officers, seamen, Marines, and one civilian), wounded 170 crew members, and did all their best.., to sink the ship !!  At the time, the ship was in &quot;protected&quot; international-waters north of the Sinai Peninsula, which was about 26 miles northwest of the Egyptian city, Arish.\n\nBoth the Israeli AND U.S. governments conducted inquiries and issued reports that concluded the attack was a mistake due to Israeli confusion about the identity of the USS Liberty.\n\nU.S. diplomats and intelligence officials continue to dispute the official findings, saying the Israeli attack on the USS Liberty was not a mistake.., and remains the only maritime incident in U.S. history where U.S. military forces were killed.., and was NEVER investigated by the U.S. Congress !!!\n\nOver the years, there's been numerous documentaries produced on this &quot;incident&quot;, but this particular film (originally titled:  &quot;Loss of Liberty&quot;) was one of the very first to be made, AND has interviews with more of the actual survivors of the Israeli attack than any other one to date...\n\nIt's about 52 minutes long with a quality of  A9 / V8\n\nAs always.., after watching.., do your best to &quot;pass it on&quot;.....\n\n&quot;Truth Does Not Fear Investigation&quot;\n\nAND...\n\n&quot;He who Wins the War.., also Writes the History&quot;\n\n","torrent":{"xt":"urn:btih:0e4bb5415a11861e57858fe4e5b5bf6a1ae741d6","amp;dn":"The+Attempted+Sinking+of+the+USS+Liberty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e4bb5415a11861e57858fe4e5b5bf6a1ae741d6","infoHashBuffer":{"type":"Buffer","data":[14,75,181,65,90,17,134,30,87,133,143,228,229,181,191,106,26,231,65,214]},"announce":[],"urlList":[]}}