{"title":"Alex Jones Show - 2010 Aug 20 FR [sebaygo1]","uid":5778746,"size":65571086,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0e632c81b3dec2be71a14f10e506970ac61aa773&amp;dn=Alex+Jones+Show+-+2010+Aug+20+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":13,"time":1282340974,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 20 August 2010\n\n\n[sebaygo1]\n\n\n\nScheduled Guests\n................\n\n\n\nAlex talks with regular Friday guest Bob Chapman about the economy and other issues. Chapman became a stockbroker in 1960 and retired in 1988. For 18 of those years he owned his own brokerage firm. Starting in 1967 Mr. Chapman began writing articles on business, finance, economics and politics having been printed and reprinted over the years in over 200 publications. He owned and wrote the Gary Allen Report, which had 30,000 subscribers. He currently is owner and editor of The International Forecaster, a compendium of information on business, finance, economics and social and political issues worldwide, which reaches 10,000 investors and brokers monthly directly, and parts of his publication are picked up by 60 different websites weekly exposing his ideas to over 10 million investors a week. \n[from about 7:00 in hour 3, through the end of the broadcast]\n &lt;a href=&quot;\nhttp://www.theinternationalforecaster.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theinternationalforecaster.com&lt;/a&gt;\n\n\n+[NOTE :: Thanks to sebaygo1 blog supporter, RW, I am able once again to include in this torrent the most recent issue of The International Forecaster newsletter.]+\n\n\n\nTed Anderson is on at the end of hours 2 and 3 plugging his gold business, Midas Resources.\n\n\n\nToday's Google Trends search terms exercise is based on this article [promoting 2 of Alex's films -- Endgame and The Obama Deception]\n\n&quot;Two Films That Blew Bilderberg Wide Open&quot;\n\n[mirror] http://www.prisonplanet.com/two-films-that-blew-bilderberg-wide-open.html\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........","torrent":{"xt":"urn:btih:0e632c81b3dec2be71a14f10e506970ac61aa773","amp;dn":"Alex+Jones+Show+-+2010+Aug+20+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e632c81b3dec2be71a14f10e506970ac61aa773","infoHashBuffer":{"type":"Buffer","data":[14,99,44,129,179,222,194,190,113,161,79,16,229,6,151,10,198,26,167,115]},"announce":[],"urlList":[]}}