{"title":"Shane MacGowan &amp; The Popes - Live At Montreux","uid":5770746,"size":738775178,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0f390768d765e768a7af38076f0cca59caaa2941&amp;dn=Shane+MacGowan+%26+The+Popes+-+Live+At+Montreux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thehealer","files":4,"time":1282094489,"description":"When Shane MacGowan split from The Pogues in 1991, the fact that they turnes to ex-Clash frontman Joe Strummer to replace him speaks volumes for the gap this unique character left behind him. Thankfully for his many fans, Shane eventually jumped back into the saddle, the intentions being to form an outfit to play &quot;vey loud, fast, rock'n'roll and very loud, fast irish music.&quot;\n\nThat band was The Popes, and the contents of this DVD disc, which captures their performance at the Montreux Jazz Festival in 1995, more than lives up to his promise. MacGowan, in the words of Mojo Magazine, &quot;ripped up the irish music rulebook&quot; when he &quot;roared out of the clubs and squats of north London&quot; in 1982.\n\nHe'd earlier been a well known figure around the capital, and famously had his earlobe bitten off (or so legend has it) by a female fellow punk at a Clash gig. Going under the pseudonym of Shane O'Hooligan, he was soon fronting his own new-wawe combo, the Nipple Erectors (later known as the Nips). The 'rude-name' policy continued with Pogue Mahone, Gaelic for 'kiss my arse', and this too was contracted to marginally less offensive Pogues when their music started getting airplayed.","torrent":{"xt":"urn:btih:0f390768d765e768a7af38076f0cca59caaa2941","amp;dn":"Shane+MacGowan+%26+The+Popes+-+Live+At+Montreux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f390768d765e768a7af38076f0cca59caaa2941","infoHashBuffer":{"type":"Buffer","data":[15,57,7,104,215,101,231,104,167,175,56,7,111,12,202,89,202,170,41,65]},"announce":[],"urlList":[]}}