{"title":"Coast To Coast Am - 08-20-10 - Robert The Haunted Doll","uid":5783095,"size":55619720,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0f7d2a0b5133b58f2becaf2b0f475ba150238e98&amp;dn=Coast+To+Coast+Am+-+08-20-10+-+Robert+The+Haunted+Doll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1282489953,"description":"Date:\n 08-20-10\n \nHost:\n George Noory\n \nGuests:\n Joshua P. Warren \n \n\n\nIn the first half of the show, paranormal investigator Joshua P. Warren presented his report on an allegedly haunted doll on display in a Florida museum. Robert the Doll, as he is known, originally belonged to Key West resident Robert 'Eugene' Otto. According to legend, a disgruntled servant of the Otto family, also a Voodoo priestess, made the doll and gave it to Eugene in 1904. Shortly afterward many strange things began to occur in the Otto household. \n\nWarren said he was initially warned about Robert by a former Otto house caretaker, who claimed the doll could move on its own and terrorized him to the point that he began sleeping with a weapon. Others cautioned Warren not to photograph the 3-ft tall doll with coal black eyes without first obtaining his permission. The walls around the doll's museum display are plastered with letters from people detailing the bad luck that had befallen them after snapping shots of Robert without his consent, he explained. \n\nWarren, who did ask for (and believes he received) Robert's permission, described a chain of weird events that happened to him during and after his investigation. Only five out of the 72 3-D photos that he took of Robert developed. In addition, infrared alarm sensors, light bulbs, and internet service at his home malfunctioned, and his wife reported hearing mysterious voices from their living room. Warren thinks there is an energy surrounding Robert, as his tests at the museum detected bursts of electromagnetism around the doll. He also found odd stains under UV light, and suggested the Voodoo priestess who made Robert may have used blood in his construction. \n\nWarren said he considers Robert &quot;the world's most haunted doll,&quot; and felt as though he was actually in the presence of a real person during the investigation. He surprised George by sending him his very own Robert the Doll replica. A caller phoned in to warn them that some of the real doll's energy may have transferred to the replica. Warren's trip to the museum, as well as his unexpectedly thrilling visit to the attic where Robert once resided, have been chronicled in a video blog at his website. \n\nGeorge hosted Open Lines in the third hour. A special audio tribute to the late Laurence Gardner followed in the final hour of the program, featuring part of his interview from 2/18/08. \n\n\nWebsite(s):\n-joshuapwarren.com\nBook(s):\n-Pet Ghosts: Animal Encounters from Beyond the Grave\n-Haunted Asheville","torrent":{"xt":"urn:btih:0f7d2a0b5133b58f2becaf2b0f475ba150238e98","amp;dn":"Coast+To+Coast+Am+-+08-20-10+-+Robert+The+Haunted+Doll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f7d2a0b5133b58f2becaf2b0f475ba150238e98","infoHashBuffer":{"type":"Buffer","data":[15,125,42,11,81,51,181,143,43,236,175,43,15,71,91,161,80,35,142,152]},"announce":[],"urlList":[]}}