{"title":"Bones S06E18 HDTV.XviD DutchReleaseTeam (dutch subs nl)","uid":6326980,"size":367220073,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1044a21a81ec6fe581126ba1d991b09a4b61920a&amp;dn=Bones+S06E18+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Koedje","files":-1,"time":1303145683,"description":"\nPlot:\n\nTemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\nSeizoen 6 Aflevering 18: The Truth in the Myth\n\n\nThe remains of a mythbuster television show host are found in the wilderness appearing to have been killed by the mythic Chupacabra, a reptile-mammal hybrid creature whose existence has not been confirmed. The team soon learns that the victim traveled to the remote West Virginian area to debunk the Chupacabra myth, and they interrogate possible suspects, including a rival wilderness-channel host/cryptozoologist/pet psychic. But when a tape is recovered at the crime scene and peculiar tooth marks are found in the victim's remains, the team learns details about the victim's demise that challenge the original theories surrounding his death. Meanwhile, recovering alcoholic squint Vincent Nigel-Murray makes amends with each member of the team and makes some surprising confessions.\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.nl\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:1044a21a81ec6fe581126ba1d991b09a4b61920a","amp;dn":"Bones+S06E18+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1044a21a81ec6fe581126ba1d991b09a4b61920a","infoHashBuffer":{"type":"Buffer","data":[16,68,162,26,129,236,111,229,129,18,107,161,217,145,176,154,75,97,146,10]},"announce":[],"urlList":[]}}