{"title":"Danny Elfman - 1990 - Edward Scissorhands OST [TQMP]","uid":6484571,"size":256160245,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11b973629d896adc0b5ec6e9c99b7a65bce2d808&amp;dn=Danny+Elfman+-+1990+-+Edward+Scissorhands+OST+%5BTQMP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"quose","files":-1,"time":1308661782,"description":" ____________________________________________________________________________\n|                                                                            |\n|                Danny Elfman - 1990 - Edward Scissorhands OST               |::\n|                                                                            |::\n|       Ripped w/EAC v1.0b2 @ Secure : Encoded w/FLAC v1.2.1 @ Comp. 8       |::\n|____________________________________________________________________________|::\n  ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n       +--------------+\n+------+ Pack / Files +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   No. of Files / Size _____ 32 files / 244.29MB (256,160,245 bytes)          |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------------+\n+------+ Audio Source +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   Type / Quantity _________ CD (Compact Disc) (* 1)                          |\n|   Date Released ___________ 11th of December, 1990                           |\n|   User Rating _____________ 09/10                                            |\n|   Genre(s) ________________ Soundtrack / Classical                           |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------+\n+------+ Review +--------------------------------------------------------------+\n|      +--------+                                                              |\n|   The times for Tim Burton would never be better, with the immense success   |\n|   of Batman proving his financial viability and a sequel on the way to       |\n|   continue building upon that reputation. It would be the satirical          |\n|   tragedies of Edward Scissorhands and The Nightmare Before Christmas that   |\n|   would earn the director his most ardent fans, however. The social          |\n|   commentary of Edward Scissorhands speaks to the heart of any outcast,      |\n|   offering a stark glimpse of Vincent Price's final, suffering creation of   |\n|   horror thrust upon a &quot;perfect&quot; vision of 1950's suburbia. The fairy tale   |\n|   genre would serve both Burton and collaborating composer Danny Elfman      |\n|   well, with the storytelling structure of both Edward Scissorhands and      |\n|   The Nightmare Before Christmas allowing for extremely tight parameters     |\n|   that help the scores for both films tell the stories by themselves. For    |\n|   Elfman specifically, Edward Scissorhands further heightened expectations   |\n|   for the young, classically untrained composer. The score remains a         |\n|   powerful juggernaut in album sales charts two decades later, though its    |\n|   success remains slightly bittersweet in that time would unfortunately      |\n|   reveal that the successive triumphs of Batman and Edward Scissorhands      |\n|   would not be equaled by the composer in any of those following years.      |\n|   Incidentally, both would feature the orchestration work of Steve Bartek    |\n|   and the conducting of Shirley Walker, though the latter score would be     |\n|   recorded in Los Angeles rather than London. While Batman appeals           |\n|   appropriately to the classically oriented mainstream action collectors,    |\n|   Edward Scissorhands reaches towards fans of Elfman's very specific early   |\n|   styles of unconventional rhythms and unashamed harmony. The score is       |\n|   somewhat of an enigma, combining those two key elements of Elfman's        |\n|   early styles and packaging them into one very serviceable score and        |\n|   album. Edward Scissorhands is one of Elfman's few scores (if not the       |\n|   only completely effective one) that balances the best of both the zany     |\n|   quirkiness of his early scores and the thematic enchantment of those       |\n|   that would follow.                                                         |\n|                                                                              |\n|   The most remarkable aspect of the Edward Scissorhands score is its         |\n|   ability to tell Burton's story without the visuals. The album takes you    |\n|   on the journey of this fable with masterful precision, embodying the       |\n|   heart-wrenching emotions of Edward's discovery and downfall with           |\n|   thematic and choral elements never restrained. In terms of the             |\n|   orchestral ensemble, not much is different from Elfman's previous          |\n|   scores, though a significant role is given to the celesta and other        |\n|   high-ranging struck percussion. The celesta specifically offers dual       |\n|   representation of both the innocence of the main character and the         |\n|   wintry setting, lending a music-box style to the score that accentuates    |\n|   the bedtime storytelling ambience. The piano, while an integral role of    |\n|   other Elfman scores at the time, is largely displaced by the celesta,      |\n|   though a few notable piano solos are registered. The harp returns from     |\n|   Batman, leaving behind its grand flourishes for deliberate plucking        |\n|   that, along with the strings, helps the celesta set the score's delicate   |\n|   rhythms. Rowdy rhythms for brass and bass woodwinds explode in &quot;The        |\n|   Cookie Factory,&quot; serving as the score's only true direct reminder of the   |\n|   sharp wackiness of Pee Wee and Beetlejuice. Few brass solos have an        |\n|   impact on the score, though the longing trumpet performance at the end     |\n|   of the title theme performance in &quot;The End&quot; (among other instrumental      |\n|   techniques heard in that cue) would largely foreshadow the upcoming        |\n|   spirit of The Nightmare Before Christmas. The true heart of Edward         |\n|   Scissorhands, though, is provided by the boy's chorus that brilliantly     |\n|   carries the imaginative elements of story and is rarely absent for         |\n|   longer than a minute or two in the score. It was not unusual for Elfman    |\n|   to employ a boy's chorus in his scores of the time, but the performances   |\n|   by the Paulist Choristers of California for Edward Scissorhands are        |\n|   incorporated with skill not heard elsewhere in any score of the 1990's     |\n|   (by Elfman or otherwise). Elfman layers the group, allowing portions to    |\n|   serve as counterpoint to itself in an effort to maximize the harmonic      |\n|   resonance of the combined voices. An adult choir is also worked into the   |\n|   score at times, though the boys' performances clearly define the work.     |\n|                                                                              |\n|   Elfman uses the combination of the chorus, celesta, and strings to         |\n|   explore two primary themes in Edward Scissorhands. The first is the        |\n|   obvious title theme provided in the credits. An overarching idea for       |\n|   Edward's journey, this light waltz swings with elegance over celesta and   |\n|   plucked strings as the chorus provides the primary wordless statements     |\n|   of fantasy (bracketing a woodwind interlude that would serve as a sub-     |\n|   theme later in the score). This cue would be fully reprised with the       |\n|   same instrumentation in &quot;Etiquette Lesson&quot; and &quot;The End,&quot; with             |\n|   continuing, fragmented references in between. Despite the appeal of this   |\n|   theme, however, it takes a back seat to the score's unofficial love        |\n|   theme, which creates the undeniable tragedy in the score. It is this       |\n|   theme that graces the score's two famous tracks, &quot;Ice Dance&quot; and &quot;The      |\n|   Grand Finale,&quot; and presents the chorus in its most beautiful, yearning     |\n|   performances. Elfman teases you with this theme in &quot;Storytime&quot; and &quot;Home   |\n|   Sweet Home,&quot; and he never allows the theme to come to a natural            |\n|   conclusion outside of the slowly fading departure in &quot;The Grand Finale.&quot;   |\n|   In the aforementioned early cues, as well as &quot;Ice Dance&quot; and &quot;The End,&quot;    |\n|   Elfman always ends the theme (and cue) on a longing note, never            |\n|   returning to its grounding key and thus drawing out the score's tragic     |\n|   intent even further. The climactic choral majesty of &quot;The Grand Finale&quot;    |\n|   is a dazzling, magical experience, and stands among the most powerful      |\n|   single cues of the digital era of film music. The score's darker side,     |\n|   dominating its second half, strikes the culture clash at the heart of      |\n|   the film's dark edge. Elfman utilizes medium drums and lighter &quot;la-la&quot;     |\n|   vocals to underline the pleasantly sickening nature of the somewhat        |\n|   timeless 1950's suburbia setting. The world of the &quot;Castle on the Hill,&quot;   |\n|   in opposition to the silliness of suburbia, is the menacing and            |\n|   ultimately tragically frustrating core of Edward's upbringing and          |\n|   seclusion. Several of the more horrifying moments of the tale, heard in    |\n|   &quot;Death!&quot; and &quot;The Tide Turns,&quot; recall troublesome ideas established by     |\n|   Elfman in the just previous Nightbreed. These cues are hardly weak, but    |\n|   in contrast to the surrounding beauty, they merit far less attention.      |\n|                                                                              |\n|   Like many of Elfman's earlier works, Edward Scissorhands has a few         |\n|   stand-out tracks of sheer wizardry or bizarre deviation that deserve       |\n|   specific mention. You can always tell when Elfman gets in a mood for       |\n|   ambitious fun when he pulls out the tubas for a wild rhythm; that          |\n|   rhythm, along with the harshly muted brass of &quot;The Cookie Factory,&quot;        |\n|   would yield to a few playful performances by woodwinds in that cue that    |\n|   would also foreshadow The Nightmare Before Christmas. The piano-led        |\n|   rhythm in &quot;Ballet de Suburbia&quot; allows the sax to lead a motif that, once   |\n|   the percussion lets rip later in the cue, would mirror much of the         |\n|   spirit of Elfman's famous theme for The Simpsons. A solo accordion in      |\n|   &quot;Esmeralda&quot; is a bizarre but short deviation. The most colorful cue is     |\n|   &quot;Edwardo the Barber,&quot; and for those who grow tired of the score's          |\n|   overbearing choral performances of the two primary themes, this cue is a   |\n|   constant pleasure. A mock-tango rhythm with castenets underscores          |\n|   Edward's hairstyling talents, mutating the suburbia motif for perhaps      |\n|   the score's most relaxed moment. In the middle of this cue, however, is    |\n|   a hoedown style explosion for about a minute that actively underscores     |\n|   Edward's most frenetic styling sequence. During this minute, plucked       |\n|   strings and accordion establish an increasingly frantic pacing over        |\n|   which a solo violin works wonders with its precise western-style           |\n|   slurring. If the comically melodramatic conclusion to this sudden burst    |\n|   of energy can't invigorate you, then you're not a true Elfman fan. The     |\n|   Tom Jones song is an unfortunately downside to the album; his voice and    |\n|   the style of the song may have been an attempt to mimic the 50's           |\n|   atmosphere of the film, but its tinny recording sound is quite             |\n|   irritating. Burton and Elfman would have been better served by having a    |\n|   sensitive vocalist provide a song version of Elfman's love theme. The      |\n|   balance of the mix between chorus and orchestra in Edward Scissorhands     |\n|   emphasizes the chorus far more than Batman did, without losing any of      |\n|   the orchestral elements in the process. This masterful mixing would be     |\n|   lost by the time Batman Returns would yield a flat result. Overall, many   |\n|   collectors believe that Danny Elfman, despite a productive career          |\n|   hereafter, has never really captured Edward Scissorhands's essence of      |\n|   magic ever again. Whether he does or not, this score will forever be       |\n|   noted as a grand highlight of both his career and film music of the        |\n|   1990's.                                                                    |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +------------+\n+------+ Track List +----------------------------------------------------------+\n|      +------------+                                                          |\n|   No. | Title                                                  | Duration    |\n|   ----+--------------------------------------------------------+----------   |\n|   001 | Introduction (Titles) ................................ | 00h03m37s   |\n|   002 | Storytime ............................................ | 00h03m35s   |\n|   003 | Castle on the Hill ................................... | 00h06m24s   |\n|   004 | Beautiful New World , Home Sweet Home ................ | 00h02m05s   |\n|   005 | The Cookie Factory ................................... | 00h02m15s   |\n|   006 | Ballet De Suburbia (Suite) ........................... | 00h01m17s   |\n|   007 | Ice Dance ............................................ | 00h02m45s   |\n|   008 | Etiquette Lesson ..................................... | 00h02m37s   |\n|   009 | Edwardo the Barber ................................... | 00h03m19s   |\n|   010 | Esmeralda ............................................ | 00h00m26s   |\n|   011 | Death ................................................ | 00h04m30s   |\n|   012 | The Tide Turns (Suite) ............................... | 00h06m31s   |\n|   013 | The Final Confrontation .............................. | 00h02m17s   |\n|   014 | Farewell ............................................. | 00h03m45s   |\n|   015 | The Grand Finale ..................................... | 00h03m26s   |\n|   016 | The End .............................................. | 00h05m47s   |\n|   017 | Tom Jones - With These Hands ......................... | 00h03m42s   |\n|   ----+--------------------------------------------------------+----------   |\n|                                                                              |\n|   Total Length ____________ 00h49m18s                                        |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +-----------+\n+------+ Audio Rip +-----------------------------------------------------------+\n|      +-----------+                                                           |\n|   Ripped with _____________ EAC v1.0b2 [http://www.exactaudiocopy.de]        |\n|   Encoded with ____________ FLAC v1.2.1 [http://flac.sourceforge.net]        |\n|   Encoding Stats __________ 1411kbps / 44.1kHz / CBR / 16-bit / Stereo       |\n|   Tag(s) __________________ Vorbis                                           |\n|   Includes Artwork? _______ Yes                                              |\n|   Includes Rip .LOG? ______ Yes                                              |\n|   Includes Rip .CUE? ______ Yes                                              |\n|   Includes Playlist? ______ Yes                                              |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\nrainfo v0.2 [2011/06/21 @ 19:07:21]","torrent":{"xt":"urn:btih:11b973629d896adc0b5ec6e9c99b7a65bce2d808","amp;dn":"Danny+Elfman+-+1990+-+Edward+Scissorhands+OST+%5BTQMP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11b973629d896adc0b5ec6e9c99b7a65bce2d808","infoHashBuffer":{"type":"Buffer","data":[17,185,115,98,157,137,106,220,11,94,198,233,201,155,122,101,188,226,216,8]},"announce":[],"urlList":[]}}