{"title":"The Burning Plain (2008) NTSC DD 5.1 Retail  --TBS","uid":6325848,"size":4675641942,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:13c4976cfaf064f3b97985b40ba9c3352a64a081&amp;dn=The+Burning+Plain+%282008%29+NTSC+DD+5.1+Retail++--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1303115407,"description":"The Burning Plain (2008) NTSC DD 5.1 Retail  \n\n\nNederlands:       \n\nVerenigde Staten / ArgentiniÃƒÂ«\nDrama\n111 minuten\n\nmet Charlize Theron, Kim Basinger, Jennifer Lawrence, en Joaquim de Almeida\n\nSamenvatting\nMariana, een 16-jarig meisje, probeert in een Mexicaans grensstadje het gebroken leven van haar ouders weer bij elkaar te krijgen. Sylvia, een vrouw uit Portland, moet een emotionele reis ondernemen om zich te verlossen van de zonden uit haar verleden. Gina en Nick, hebben een buitenechtelijke verhouding met elkaar, en Maria, een jong meisje, gaat op zoek naar haar moeder als haar vader een ernstig ongeluk krijgt. Deze vijf mensen ontdekken dat hun acties het verschil kunnen betekenen tussen leven en dood, alsook een tocht naar verlossing.\n\nEen ander erg sterk punt van The Burning Plain zijn de acteerprestaties, waarbij vooral Charlize Theron in haar rol van Sylvia noemenswaardig is. Maar ook de vertolkingen van de wat jongere en onbekendere acteurs als Jennifer Lawrence en Diego J. Torres zijn erg sterk en beloven veel voor de toekomst. Alle personages in The Burning Plain lijden op ÃƒÂ©ÃƒÂ©n of andere manier pijn, en alle acteurs weten dat op een overtuigende manier over te brengen naar het scherm, zonder dat het wordt overdreven. En daarmee levert Arriaga een waardig regiedebuut af.\n\nVerhaal\nSylvia is een hardwerkende vrouw die verdoofd door het leven lijkt te gaan. In Mexico trekt de moederloze Maria rond met haar vader. In Las Cruces, New Mexico worden de twee tieners Mariana en Santiago verliefd na de plotse dood van een ouder. Gina en Nick hebben een hartstochtelijke affaire die zij tegen beter weten in niet willen beÃƒÂ«indigen.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/31059&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/31059&lt;/a&gt;\n\nEnglish\nSummary\nMariana, a 16-year-old girl tries a Mexican border city of the broken lives of her parents getting back together. Sylvia, a woman in Portland who must undertake an emotional odyssey to burnish a sin from her past. Gina and Nick, have an extramarital affair with each other, and Maria, a young girl goes looking for her mother as her father, a serious accident. These five people are discovering that their actions may mean the difference between life and death as well as a journey to redemption.\n\nAnother very strong point of The Burning Plain, the performances, especially with Charlize Theron in her role as Sylvia is notable. But the performances of the younger and lesser known actors Jennifer Lawrence and J. Diego Torres is very strong and much promise for the future. All the characters in The Burning Plain suffering one way or another pain, and all actors know that in a convincing way to convey to the screen, without being exaggerated. Arriaga and thus provides a decent directorial debut off.\n\nStory\nSylvia is a hardworking woman who stunned by life seems to go. In Mexico, the motherless Mary attracts around with her ??father. In Las Cruces, New Mexico, the two teenagers and Mariana Santiago in love with the sudden death of a parent. Gina and Nick have a passionate affair that they have knowledge not want to stop.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0398286&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0398286&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nBeeldverhouding: 4:3\nFramerate      : 29,970 fps\nStandaard      : NTSC \nAudio          : English DD 5.1\nBron           : Retail \nOndertitels    : NL\nExtra's        : No\nMenu           : Yes\nGenre          : Drama\nCover          : Ja","torrent":{"xt":"urn:btih:13c4976cfaf064f3b97985b40ba9c3352a64a081","amp;dn":"The+Burning+Plain+%282008%29+NTSC+DD+5.1+Retail++--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c4976cfaf064f3b97985b40ba9c3352a64a081","infoHashBuffer":{"type":"Buffer","data":[19,196,151,108,250,240,100,243,185,121,133,180,11,169,195,53,42,100,160,129]},"announce":[],"urlList":[]}}