{"title":"Michael Jackson - Fake tracks on &quot;MICHAEL&quot; album: UNDENIABLE","uid":6366666,"size":74939876,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:13fc533c8e13e34603ec38352313ebc575478622&amp;dn=Michael+Jackson+-+Fake+tracks+on+%5C%22MICHAEL%5C%22+album%3A+UNDENIABLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dragonite_9","files":6,"time":1304532972,"description":"The videos in this torrent contain UNDENIABLE PROOF that the songs Breaking News, Monster and Keep Your Head Up on the new Michael Jackson album MICHAEL are fake. They are sung by an impersonator who calls himself Jason Malachi. The songs were promoted as recorded by Michael with Eddie Cascio, a friend of his, but they are not Michael. Also included are two songs that didn't make the album called Stay and All I Need. There are 7 other songs that Eddie Cascio sold to Sony, but they have not leaked yet. All are fake, however.\n\nIf you keep an open mind, you will see in these videos that the real singer is Jason Malachi. These were made by a fan called TPImaster and are really well made. It is outrageous that these fakes are on the new Michael Jackson album, so the situation needs to be resolved. These videos were put up on video sites and download sites, but always quickly removed by Eddie Cascio.\n\nThere is also a funny bonus video called The Making of Breaking News that is a funny parody of what happened, made by Birchey and Mack.\n\nKeep on seeding, spreading and sharing the truth for Michael.","torrent":{"xt":"urn:btih:13fc533c8e13e34603ec38352313ebc575478622","amp;dn":"Michael+Jackson+-+Fake+tracks+on+%5C%22MICHAEL%5C%22+album%3A+UNDENIABLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13fc533c8e13e34603ec38352313ebc575478622","infoHashBuffer":{"type":"Buffer","data":[19,252,83,60,142,19,227,70,3,236,56,53,35,19,235,197,117,71,134,34]},"announce":[],"urlList":[]}}