{"title":"Poison - Fallen Angel (VH1 Classic Fan Show)(2nafish)","uid":5766721,"size":151642116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:14460136010acf016f56641c450f5a1864580c98&amp;dn=Poison+-+Fallen+Angel+%28VH1+Classic+Fan+Show%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1281939956,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Fallen Angel&quot; is the second single from Open Up and Say...Ahh!, American hair metal band Poison's second album. The b-side of the seven inch was &quot;Bad to Be Good&quot;.\n\nReleased as a single in 1988 on Capitol Records. it made #12 on the Billboard Hot 100 and #32 on the Mainstream rock charts, making it the only single from the album not to reach the Top Ten. It also charted at number 21 on the Australian charts and number 59 on the UK Singles chart\n\nThe song is about a young girl who grew up in a small town and goes to Los Angeles to try to make it as an actress. While there she abandons her old life...\n\nOpen Up and Say... Ahh! is the second studio album by American glam metal band Poison, released in 1988 through the Enigma label of Capitol Records. The album, which ultimately sold eight million copies worldwide, proved to be the band's most successful release. It spawned four hit singles, which are &quot;Nothin' but a Good Time&quot;, &quot;Your Mama Don't Dance&quot;, &quot;Fallen Angel&quot;, and their only number one single to date, &quot;Every Rose Has Its Thorn&quot;. The album is widely considered a classic in the glam metal genre. It peaked at #2 on the Billboard 200 , being denied the top spot by Bon Jovi's massively popular New Jersey album, and Guns N' Roses debut record, Appetite for Destruction.\n\nOpen Up And Say Ahh was certified platinum in 1988 and 5x-platinum in 1991 by the RIAA.\n\nOpen Up and Say... Ahh! reflects a style commonly characterised as glam metal, a form of heavy metal which had its genesis on the East Coast of the United States (and, in particular, the sound of New York City band Kiss), but which was transplanted to the Sunset Strip in Los Angeles, California  in the 1980s. Despite being one of the most successful glam metal albums, it contains less of a heavy metal influence than a typical glam metal album, rather being more traditional hard rock-based. The west-coast influence is reflected more prominently on the album than on its predecessor, Look What the Cat Dragged In, with aspects of Van Halen styled Californian stadium rock becoming increasingly apparent.\n\nThe album was recorded and mixed at Conway Recording Studios in Los Angeles. Paul Stanley from KISS (whose song &quot;Rock and Roll All Nite&quot; had been covered by Poison the year before) was originally selected to produce the record, but was unable to fulfill the role due to scheduling conflicts. Instead, the band worked with Tom Werman. Werman was an experienced rock producer, having worked with artists such as Ted Nugent, Cheap Trick, Twisted Sister, and MÃƒÂ¶tley CrÃƒÂ¼e.\n\nFollowing the album was the release of the band's first video compilation titled, Sight for Sore Ears which featured all the music videos from Open Up And Say...Ahh! and Look What the Cat Dragged In.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:14460136010acf016f56641c450f5a1864580c98","amp;dn":"Poison+-+Fallen+Angel+%28VH1+Classic+Fan+Show%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14460136010acf016f56641c450f5a1864580c98","infoHashBuffer":{"type":"Buffer","data":[20,70,1,54,1,10,207,1,111,86,100,28,69,15,90,24,100,88,12,152]},"announce":[],"urlList":[]}}