{"title":"Indie 69 June 2011 Tasty Leftovers (various artists)","uid":6469448,"size":776975258,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14c310ae1afcf888942f699c3f29d5a084ced8a6&amp;dn=Indie+69+June+2011+Tasty+Leftovers+%28various+artists%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"indie69","files":-1,"time":1308070033,"description":"Okay, so what the hell is this??\n\nWell, these days I'm getting about 400 tracks a month or more. And to be honest, there's only\nroom for just SO many tracks on the main playlist. And I've noticed that there's SO MUCH good\nmusic left over every month, it just gets tossed into a folder and forgotten, for the most\npart.\n\nThat's not fair if the whole point of this is to get new music HEARD. So I decided to put together\na second playlist now, every month (I presume), featuring these leftover tracks. \n\nThese TASTY leftover tracks. So eat up!!\n\nYummy.\n\nYou may notice a lot more remixes, instrumentals and more obscure experimental or weird stuff\nhere on this playlist. So if that's your thing, you may like this one even more.\n\nBut that's not everything here... there's plenty of sweet pop goodness and rock\ndelectables and edibles to chew on.\n\nEnough eating metaphors to fill you up yet??\n\ngroan.\n\nAnyway. Enjoy. And remember, if you found YOUR music here, it doesn't mean I thought any less\nof it.. quite the contrary. These are NOT REJECTED TRACKS!! Those go in the trash.\n\nThat comes to about half of what I get going into the recycle bin.\n\nHope you all like it. It was fun to put together. As much as the other playlist. I imagine\nI will even do this one with quite a bit more care and attention from now on, even throwing\nin some older stuff and personal favorites from time to time. A kind of playground for my\nevil whims. Bwahahahaha!\n\nSee you in June, prune. ( I realized after I wrote this in the NFO that actually I'd be seeing you in July, Guy. Too late to edit... such is life)\n\n\nImage and this document:\nCreative Commons Attribution-NonCommercial-ShareAlike 2.0 Generic (CC BY-NC-SA 2.0)\n\n\nP.S. - The consensus is in. The consensus being that I decided. I'll put these out when I\nhave enough tracks to justify it about halfway through the month.","torrent":{"xt":"urn:btih:14c310ae1afcf888942f699c3f29d5a084ced8a6","amp;dn":"Indie+69+June+2011+Tasty+Leftovers+%28various+artists%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c310ae1afcf888942f699c3f29d5a084ced8a6","infoHashBuffer":{"type":"Buffer","data":[20,195,16,174,26,252,248,136,148,47,105,156,63,41,213,160,132,206,216,166]},"announce":[],"urlList":[]}}