{"title":"DivineBitches-----9822- Isis_Chris_Alexander","uid":5761656,"size":352609499,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:155cf334da19b45f6c4d4b93cf98f64820f6d211&amp;dn=DivineBitches-----9822-+Isis_Chris_Alexander&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":157,"time":1281751220,"description":"From Kink.com   ( DivineBitches )  + Pics\n\n\n\nIsis Love is tired of her boyfriend having an inadequate, small penis. Isis brings him to the small cock clinic in hopes that something can be done with his worthless cock. Dr. Freitas is an exotic, buff, handsome, bull from Brasil who easily charms the ladies with his sexy accent, looks and big cock. The doctor suggests an unconventional dick growing kit which includes a chastity belt, cock zapper, floggers, strap-on prostate stimulator and other torturous dick growing tools. The sexual tension between Isis and Dr. Freitas grows. After all, what's a women to do when her boyfriend has such a sad little pin dick? Suck and fuck the doctor of course! Isis sucks off Dr. Freitas and spits her cock laced saliva in the cuckold's face hoping his dick will grow. NOTHING. She fucks him deep in the ass while the doctor and her laugh hoping this will stimulate his prostate. STILL NOTHING. She fucks the doctor hovering right above her boyfriends face. Sweat and sex juices drip on the cucks lips while they fuck. In the end the cuck gets a cock growing cocktail he'll never forget! This update includes CFNM, bondage, small penis humiliation, cuckolding, chastity, anal strap-on, spanking, flogging and more.\n\n\n\nScreens http://www.divinebitches.com/site/shoot.jsp?shootId=9822\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:155cf334da19b45f6c4d4b93cf98f64820f6d211","amp;dn":"DivineBitches-----9822-+Isis_Chris_Alexander","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"155cf334da19b45f6c4d4b93cf98f64820f6d211","infoHashBuffer":{"type":"Buffer","data":[21,92,243,52,218,25,180,95,108,77,75,147,207,152,246,72,32,246,210,17]},"announce":[],"urlList":[]}}