{"title":"Savatage - Dead Winter Dead","uid":6488822,"size":75729546,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15abb2978357eecba3eedbf97b3ffe4930da6f4b&amp;dn=Savatage+-+Dead+Winter+Dead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ngocbao","files":13,"time":1308810987,"description":"Dead Winter Dead is a concept album by Savatage, released in 1995 dealing with a Serb boy and a Muslim girl who fall in love. The story of the album also focused on the Bosnian War, which was ongoing at the time.[1]\n\nThis album featured the return of Chris Caffery, who featured on Savatage's 1989 release Gutter Ballet. Alex Skolnick, who had played guitars on Savatage's previous album Handful of Rain, opted not to stay around for the next album in order to concentrate on his solo band. Singer Jon Oliva took drummer Jeff Plate from the Handful of Rain tour, and brought in his old friend, former member and Doctor Butcher member to join the band. Atlantic Records also felt that the band needed a second, more well-known guitarist to complete the line-up. Al Pitrelli, formerly a member of Alice Cooper's touring band, became the lead guitarist for the band.[1]\n\nThis record gave the band an unexpected radio hit in &quot;Christmas Eve (Sarajevo 12/24)&quot;, and the band decided they wanted to explore this kind of music in a different way. Around this time, Paul O'Neill, along with Robert Kinkel, was interested in starting up what became the Trans-Siberian Orchestra. It was later re-released by TSO as &quot;Christmas Eve/Sarajevo 12/24&quot; on their first release, Christmas Eve and Other Stories.\n\nThe track &quot;Mozart and Madness&quot; quotes directly from the opening theme of Mozart's Symphony No. 25.","torrent":{"xt":"urn:btih:15abb2978357eecba3eedbf97b3ffe4930da6f4b","amp;dn":"Savatage+-+Dead+Winter+Dead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15abb2978357eecba3eedbf97b3ffe4930da6f4b","infoHashBuffer":{"type":"Buffer","data":[21,171,178,151,131,87,238,203,163,238,219,249,123,63,254,73,48,218,111,75]},"announce":[],"urlList":[]}}