{"title":"Popol Vuh - Seligpreisung (1973/2004) [FLAC]","uid":6494150,"size":185532193,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1755e2b857f4e3b014d21ac71b46f494a8823368&amp;dn=Popol+Vuh+-+Seligpreisung+%281973%2F2004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zibbik","files":15,"time":1309001375,"description":"Artist: Popol Vuh\nTitle: Seligpreisung\nGenre: Krautrock\nCountry: Germany\n\nPopol Vuh's Seligpreisung is another essential work from the band, ushering in the classic middle period for which they are best known. The album represents the reconvening of the band after Fricke had contributed to Gila's Bury My Heart at Wounded Knee, after which he brought former Amon Duul II drummer turned guitarist Daniel Fischelscher into the fold of his main band. Fischelscher would become Fricke's main collaborator for what is essentially Popol Vuh's most intensely brilliant period, reaching a possible culmination in the subsequent classics Letzte Tage, Letzte NÃƒÂ¤chte and Einsjager &amp; Siebenjager. In light of those later achievements, Seligpreisung still stands as a solid addition, if slightly more tentative. Certainly, the album lacks the raw power, intensity and sheer sonic grandeur of those albums, relying on a more meditative, subtle approach. In contrast to the dominant role he would take later on, Fischelscher here opts more often for a clean, melodious guitar tone, perhaps not wishing to step on anyone's feet with the kind of flailing, distorted outpourings he would later incorporate. Indeed, his guitar playing here sits in perfect balance with Fricke's moving piano melodies, creating absolutely gorgeous sound tapestries that cut right to the soul. Unfortunately, neither Djong Yung or Renate Knaup feature here on vocals, leaving Fricke to admirably contribute the occasional pleasant chant here and there himself.\n\nTranslating as &quot;Songs of Praise&quot;, Seligpreisung is an extremely spiritual album, and it shows. Thankfully, it's also one of the few albums I know of that pulls this off without being exceedingly lame. Indeed, perhaps me not understanding the lyrics leaves me blissfully unaware of any &quot;preachiness&quot; that might be occurring, but the relative sparseness of the vocals leads me to doubt any such intent. The music here just sounds honest, impeccably composed, and most important of all, inspired. The only problem I have with the album is its brevity. Finding out that it clocks in at under 30 minutes after having shelled out 18 bucks didn't exactly have me singing songs of praise. In retrospect however, it's a half hour of music I'd gladly pay twice as much for. Though not reaching the same brilliant highs as some of the immediately subsequent Popol Vuh albums, Seligpreisung is a quiet, beautiful work that will be an immediate delight to any fan of the group.\n\nTracklisting:\n\n1. &quot;Selig sind, die da hungren Selig sind, die da dÃƒÂ¼rsten nach Gerechtigkeit Ja, sie sollen satt werden.&quot; (6:03)\n2. &quot;Tanz der Chassidim&quot; (3:17)\n3. &quot;Selig sind, die da hier weinen Ja, sie sollen spÃƒÂ¤ter lachen&quot; (5:10)\n4. &quot;Selig sind, die da willig arm sind Ja, ihrer ist das Himmelreich&quot; (3:14)\n5. &quot;Selig sind, die da Lied klagen Ja, sie sollen gertrÃƒÂ¶stet werden&quot; (3:40)\n6. &quot;Selig sind, die SanftmÃƒÂ¼tigen Ja, sie werden einst die Erde erben&quot; (2:34)\n7. &quot;Selig sind, die da reinen Herzens sind Ja, sie sollen Gott schauen&quot; (2:33)\n8. Ja, sie sollen Gottes Kinder heiÃƒÅ¸en Agnus Dei, Agnus Dei&quot; (2:45)\n9. Be In Love [Bonus Track] (5:00)\n\nTotal Time: 34:15\n\nLine-Up:\n- Robert Eliscu / oboe\n- Daniel Fichelscher / electric guitar (2-3-4-6), drums, congas\n- Florian Fricke / piano, cembalo, vocals\n- Conny Veit / electric &amp; 12-string guitars\n- Klaus Wiese / tamboura \n\n\n","torrent":{"xt":"urn:btih:1755e2b857f4e3b014d21ac71b46f494a8823368","amp;dn":"Popol+Vuh+-+Seligpreisung+%281973%2F2004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1755e2b857f4e3b014d21ac71b46f494a8823368","infoHashBuffer":{"type":"Buffer","data":[23,85,226,184,87,244,227,176,20,210,26,199,27,70,244,148,168,130,51,104]},"announce":[],"urlList":[]}}