{"title":"ReR Quarterly, volume 2: 1-2 (Avant Garde Project 181) FLAC24","uid":6493152,"size":846211799,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:18149ae12d371fcb35bc59c1848adafee62e7bd8&amp;dn=ReR+Quarterly%2C+volume+2%3A+1-2+%28Avant+Garde+Project+181%29+FLAC24+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"human2011","files":14,"time":1308960581,"description":"The Avant Garde Project is a series of 20th-century classical, experimental, and electroacoustic torrents digitized from LPs whose music has in most cases never been released on CD, and so is effectively inaccessible to the vast majority of music listeners today. This is wild stuff, so check it out if you've never heard this sort of music before. The analog rig used to extract the sound from the grooves is near state-of-the-art, producing almost none of the tracking distortion or surface noise normally associated with LPs.\n\nAGP1-157 are available for direct download at two mirror sites:\n &lt;a href=&quot;\nhttp://dream.cs.bath.ac.uk/AvantGardeProject/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dream.cs.bath.ac.uk/AvantGardeProject/index.html&lt;/a&gt;\n\nAGP148-173 are now available at http://ubu.com/sound/agp/index.html\n\nAGP169-180 are also available at http://thepiratebay.se/user/human2011\n\nNOTE: All of the AGP installments since 163 are 24-bit, 44.1 kHz FLAC files. The extra bits of quantization reveal more realistic detail using a 24-bit DAC and good audio equipment. To burn these tracks to CD, you will first have to convert them to 16-bit files. This is easily done using the converter tool in Foobar2000 or other software.\n\n=======================================\n\nThe AGP at long last continues a series of transcriptions that began with AGP141-144. AGP181 and AGP182 are from volume 2 of the long out-of-print ReR Quarterly, produced by Recommended Records. Released at irregular intervals of no less than three months, the series continued through three volumes of LP releases, before switching to the CD medium for a fourth volume starting in 1994, and then ending in 1997. Each volume except the third consisted of four issues containing a magazine and either an LP or CD of music. A pair of CDs with selected tracks from the first two volumes were released in 1991 and are available from ReR Megacorp.\n\nThe tracks in these installments run the gamut from electroacoustic music to avant-pop. Many of the artists participated in the protest movements of that time and were devoted partisans of a revolutionary ethos. Most of the tracks were recorded and produced on a shoestring budget, but even so the sound quality is often excellent. And even in the more primitive recordings, the range of timbres explored can be quite striking.\n\nAGP181 includes all out-of-print tracks from volume 2, issues 1-2, released in May and Autumn 1987. The LPs transcribed are excellent pressings in excellent condition, with negligible surface noise or tracking distortion. The installment includes a PDF file with scans of the pages describing the music on the LPs from all four issues of volume 2 of the magazine. \n\nThese out-of-print tracks from volume 2 are available here with the kind permission of ReR Megacorp, so if you like what you hear in AGP141-144 and AGP181-182, be sure to check out the sampler CDs as well:\n\n\nor search &quot;quarterly&quot; on the ReR Megacorp website.\n\n01 - Blitzoids: Puptent [3:46]\n02 - ?r: Imperialism of the Future [4:26]\n03 - Henry Kaiser/Michael Maxymenko/Bill Frisell: The Same Thing [5:56]\n04 - Anthony Moore: Plains of Hungary [9:43]\n05 - John Oswald: Parade [11:14]\n06 - This Heat: Nivelles '81 [5:47]\n07 - David Thomas &amp; The Accordion Club: It Happened to Me [2:36]\n08 - John French: Yeah Mom [3:50]\n09 - Arturo Meza: From Suite Koradi [11:44]\n10 - Intellectual Cabaret: Resume 84-86 [11:49]\n11 - Hunk Ai!: Dance [5:26]\n\nNOTE: To the best of my knowledge, these recordings are not currently available commercially. If you know otherwise, please let me know ASAP, as I do not wish any artists to be deprived of the royalties that they so richly deserve.\t","torrent":{"xt":"urn:btih:18149ae12d371fcb35bc59c1848adafee62e7bd8","amp;dn":"ReR+Quarterly%2C+volume+2%3A+1-2+%28Avant+Garde+Project+181%29+FLAC24+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18149ae12d371fcb35bc59c1848adafee62e7bd8","infoHashBuffer":{"type":"Buffer","data":[24,20,154,225,45,55,31,203,53,188,89,193,132,138,218,254,230,46,123,216]},"announce":[],"urlList":[]}}