{"title":"Death Note 01 Rebirth","uid":6326217,"size":117881832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:185423c6a754fd8d9f132423f1c4a268e76d0851&amp;dn=Death+Note+01+Rebirth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"siaton","files":1,"time":1303126153,"description":"The Japanese animation television series Death Note, is based on the manga series written by Tsugumi Ohba and illustrated by Takeshi Obata. Death Note aired in Japan on the Nippon Television network every Tuesday at 24:56  The first episode aired on October 3, 2006, and the last episode aired on June 26, 2007[not in citation given] A special two-hour &quot;Director's Cut&quot; compilation episode, entitled &quot;Death Note:R (Rewrite)&quot;, was aired on August 31, 2007.[3] The series primarily revolves around high school student Light Yagami, who decides to rid the world of evil with the help of a supernatural notebook titled Death Note that causes the death of anyone whose name is written in it. The book was property of the God of Death, or Shinigami, named Ryuk, who became bored within the Shinigami world\n\n\nthis is first episode only\n\nHigh school student, Light Yagami finds a notebook dropped from the sky named the &quot;Death Note&quot;. He tests the mysterious powers of the notebook and finds to his astonishment that the book has the power to kill people whose names are written in it. 5 days later, Ryuk, a shinigami confronts him at his home, telling him the book belongs to the human owner who found it first and cannot be returned unless the owner dies or relinquishes ownership. He makes it clear Light found it by chance and was not 'chosen'. Though initially terrified and distraught by how he killed people, Light decides that he will use the Death Note to rid the world of evil and become the new god. \n\n\n\nthe other episodes will be here as soon as possible \nin this way your downloading also will be very fast\ni will try to up seed at least 3 per day","torrent":{"xt":"urn:btih:185423c6a754fd8d9f132423f1c4a268e76d0851","amp;dn":"Death+Note+01+Rebirth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"185423c6a754fd8d9f132423f1c4a268e76d0851","infoHashBuffer":{"type":"Buffer","data":[24,84,35,198,167,84,253,141,159,19,36,35,241,196,162,104,231,109,8,81]},"announce":[],"urlList":[]}}