{"title":"DtSearch.Desktop.v7.67.7961","uid":6325673,"size":46142703,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18afa01cc79567bd62d59bf10172f35b145ff126&amp;dn=DtSearch.Desktop.v7.67.7961&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":-1,"time":1303107897,"description":"dtSearch Desktop is a powerful and robust information retrieval tool, having been in continous development since 1991. It enables you to search through terabytes of text in under a second because it builds an index that stores the location of the words in your files. \n\ndtSearch Desktop automatically recognises and supports all popular file formats and never alters your original files. You can choose to index drives (including removable media), folders, files, Outlook folders or use the built-in Spider to index Web sites. \n\nUniquely dtSearch Desktop can perform un-indexed as well as &quot;combination&quot; searches to search files that have not been indexed.\n\ndtSearch Desktop has dozens of advanced indexing options to give you complete control over the content of each index. It will automatically collect Meta data from HTML, Word and PDF documents as well as from media files such as MP3, ASF and WMV to allow field searching. Indexes can be automatically updated by using the Windows Task Scheduler to reflect additions, deletions \n\n\n\n\n\n\n\n\n\n\nThe dtSearch product line can instantly search terabytes of      \ntext across a desktop, network, Internet or Intranet site.       \ndtSearch products also serve as tools for publishing, with       \ninstant text searching, large document collections to Web        \nsites or portable media.                                         \nDevelopers can embed dtSearch?s instant searching and file       \nformat support into their own applications.                      \n                                             ","torrent":{"xt":"urn:btih:18afa01cc79567bd62d59bf10172f35b145ff126","amp;dn":"DtSearch.Desktop.v7.67.7961","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18afa01cc79567bd62d59bf10172f35b145ff126","infoHashBuffer":{"type":"Buffer","data":[24,175,160,28,199,149,103,189,98,213,155,241,1,114,243,91,20,95,241,38]},"announce":[],"urlList":[]}}