{"title":"Grand Master Jong Soo Park - Mastering Taekwondo-Sparring","uid":6502120,"size":5655091200,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:19cf3e798a50e2a157abe722133ecbe49714901f&amp;dn=Grand+Master+Jong+Soo+Park+-+Mastering+Taekwondo-Sparring&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":10,"uploader":"eds2502","files":16,"time":1309285580,"description":"In these two DVDs Gran Master Park teaches Under Balck Belt as well as Black Belt sparring\n\nGran Master Park was born in 1941 in Chung-Nam, Korea. He holds a 9th Dan black belt in Tae Kwon-Do ITF. At the age of 14, and since then, he has been the instructor of the Police Training Centre of Chun Bok in Korea and of the famed Tiger Division of the Korean Army.\n\nIn 1964, he became Korean National Champion, and in 1965 he made a trip on request of the Korean Government, as a member of the Goodwill Mission for Tae Kwon-Do, demonstrating this art before the highest civil and military authorities of the countries they visited. In that same year, he was invited to Germany as the coach of the German Tae Kwon-Do Association.\n\nIn 1966, he left Germany to go to Holland where he founded the Netherlands Tae Kwon-Do Association. In the beginning of 1968, he left for Canada and now has his own schools in the Greater Toronto Area.\n\nIn November 1973, Master Park made another world trip to promote Tae Kwon-Do in Europe, the Middle East and North Africa. Master Park is known as one of the world's greatest Tae Kwon-Do experts. ","torrent":{"xt":"urn:btih:19cf3e798a50e2a157abe722133ecbe49714901f","amp;dn":"Grand+Master+Jong+Soo+Park+-+Mastering+Taekwondo-Sparring","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19cf3e798a50e2a157abe722133ecbe49714901f","infoHashBuffer":{"type":"Buffer","data":[25,207,62,121,138,80,226,161,87,171,231,34,19,62,203,228,151,20,144,31]},"announce":[],"urlList":[]}}