{"title":"Ed McBain - Romans - 1997","uid":6326364,"size":210518372,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1a27ccd2dcfe1d85e12057a52e1d8b7cdd2a9ab2&amp;dn=Ed+McBain+-+Romans+-+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mojo6915","files":-1,"time":1303085993,"description":"(Hittar tyvÃƒÂ¤rr ingen svensk beskrivning av boken.\nMen har en kÃƒÂ¤nsla av att ni nog klarar lite engelsk text.\nDock ÃƒÂ¤r ljudboken pÃƒÂ¥ Svenska)\n\n\nIt's not a mystery, it's a story of survival and triumph. That's what some people say about Romance, a would-be hit play about an actress pursued by a knife-wielding stalker. But isn't it romantic! Before the show can open, the leading lady is really attacked, outside the theater. And before the detectives of the 87th can solve that crime, the same actress is stabbed again. This time for keeps. A.D.A. Nellie Brand moves in for a murder conviction, but Detective Steve Carella is sure she's got the wrong guy, and wrestles for the case with Fat Ollie Weeks, Isola's foulest cop. While Bert Kling interviews witnesses and suspects ranging from the show's producers to the author - who has written novels about cops and knows how it's done - to the lead's lovely understudy, he can't keep his mind off what's happening to him. He's falling in love. With a doctor. Who happens to be a deputy chief surgeon. Who happens to be a black woman. In the city of Isola, nothing is black and white. In the play Romance, no one is guilty or innocent. And in the gritty reality of the 87th Precinct, everyone is in love with something - even if it's only murder.\n","torrent":{"xt":"urn:btih:1a27ccd2dcfe1d85e12057a52e1d8b7cdd2a9ab2","amp;dn":"Ed+McBain+-+Romans+-+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a27ccd2dcfe1d85e12057a52e1d8b7cdd2a9ab2","infoHashBuffer":{"type":"Buffer","data":[26,39,204,210,220,254,29,133,225,32,87,165,46,29,139,124,221,42,154,178]},"announce":[],"urlList":[]}}