{"title":"Jimmy Rosenberg: The Father, the Son &amp; the Talent","uid":5811662,"size":1544342539,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b851515d69105b46e7ea0c39eb53428632ce8fe&amp;dn=Jimmy+Rosenberg%3A+The+Father%2C+the+Son+%26+the+Talent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"nbvghj","files":5,"time":1283661170,"description":"This documentary presents a fascinating portrait of an outstanding contemporary manouche guitarist, Jimmy Rosenberg and his family. Jimmy starts out as a child prodigy, touring national and international stages at age 8 or 9 with his brothers, playing his guitar with amazing finger technique and a wild passion. He is not only a great player but one of the few who can improvise in this style.\n\nHowever, life takes a bad turn as he gets addicted to drugs, are in and out of rehab, eventually prison. He is successful, famous, has lots of money then blows it in a few months. Perhaps it is due to his father's imprisonment (who killed his son-in-law in self-defence during a confrontation over the son-in-law who abused his wife and children) and missing his firm guiding hand. Perhaps it is the artistic temperament... Still, Jimmy is not judged by the film makers, but presented as a very talented person who got lost in the heady world of stage success. I am glad that the usual attitudes regarding &quot;gypsy fate&quot; and down-troddenness are not brought into the discussion at all, even though the family, despite all their wealth, continues to live in a small, gypsy-only community in Holland where the houses look like mobile homes...\n\nAs a reviewer wrote about his CD entitled &quot;The One and Only&quot;: &quot;Jimmy takes the standard repertoire and presents it at an incredible pace with clever twists and an impressive technique.&quot; The music is certainly amazing throughout the documentary and has been obviously an anchor and a calming influence for Jimmy. The documentary is fairly recent (2006), I hope that he is back on stage and in the recording studios. ","torrent":{"xt":"urn:btih:1b851515d69105b46e7ea0c39eb53428632ce8fe","amp;dn":"Jimmy+Rosenberg%3A+The+Father%2C+the+Son+%26+the+Talent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b851515d69105b46e7ea0c39eb53428632ce8fe","infoHashBuffer":{"type":"Buffer","data":[27,133,21,21,214,145,5,180,110,126,160,195,158,181,52,40,99,44,232,254]},"announce":[],"urlList":[]}}