{"title":"Finjarn-Jensen - Finjarn-Jensen (1970) [mp3@320]","uid":6386892,"size":111166267,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1c96932dfd73bb1d9e1b4c02cc37862763568ca6&amp;dn=Finjarn-Jensen+-+Finjarn-Jensen+%281970%29+%5Bmp3%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zibbik","files":18,"time":1305231816,"description":"Artist: Finjarn-Jensen\nTitle: Finjarn-Jensen\nGenre: Heavy Psych\nOrigin: Norway\n\nTracklist:\n\n1. One More Day 4:31\n2. Blue and Peaceful 4:12\n3. What Else Can We Do? 3:44\n4. Lady Windsor 4:27\n5. New Day 3:12\n6. Grey Skies 5:57\n7. Sorry Girl, But Now I Know Things Will Be Much Better Now You've Gone 7:44\n\nBand:\nSvein Finjarn - Gitar, Sang, Kor\nLeif Jensen - Trommer\nFreddy Lindquist - Bass\nArild Krosby - Bassgitar\nArne Kvikstad - Akustisk Gitar\nGrete Christoffersen - Flygelhorn\n\n&quot;Svein Finjarn was the guitarist with one of Norway's first successful beat combos, the Beatniks, but by the time he teamed with drummer Leif Jensen to record this album in 1970, he'd left his Shadows and Beatles influences far behind him. Finjarn &amp; Jensen's first and only album (which was recorded after the untidy breakup of their band Jumbo) lies somewhere between late-period psychedelia and early prog rock, with a dash of hard rock muscle thrown in; the influences are clearly Anglophile (John Mills was brought in to produce the sessions) and there's even an interlude in which two veddy British gentlemen chat over tea in the middle section of 'Lady Windsor,' while Finjarn and Jensen sing in English (with feigned British accents) throughout. Since a percussionist gets co-star billing on this album, it should come as no surprise that Jensen takes several lengthy drum solos on the album, and in a field where tedium often sets in quickly, Jensen lacks either the chops or the imagination to compete with the likes of John Bonham or Ginger Baker in the epic solo department. Guitarist Finjarn fares considerably better, showing himself to be a strong player who isn't afraid to step forward and bring the crunch on 'One More Day' and 'What Else Can We Do,' while displaying a more graceful side on the acoustic 'Blue and Peaceful,' but as a songwriter he and his partner aren't quite as impressive, with these tunes falling squarely into the category of professional but uninspired. Given its rarity, Finjarn &amp; Jensen is the sort of album that seems like manna from heaven to rabid collectors of rare prog and psych, particularly given its Norwegian heritage but clear U.K. bent, but from a strictly musical standpoint this is one band that didn't last for the obvious \n\n\n","torrent":{"xt":"urn:btih:1c96932dfd73bb1d9e1b4c02cc37862763568ca6","amp;dn":"Finjarn-Jensen+-+Finjarn-Jensen+%281970%29+%5Bmp3%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c96932dfd73bb1d9e1b4c02cc37862763568ca6","infoHashBuffer":{"type":"Buffer","data":[28,150,147,45,253,115,187,29,158,27,76,2,204,55,134,39,99,86,140,166]},"announce":[],"urlList":[]}}