{"title":"AllWebMenus Pro 5.3 Build 868 ","uid":6493350,"size":10405937,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d13cf5dba3d3a483ed1b2707d3556508adbb411&amp;dn=AllWebMenus+Pro+5.3+Build+868+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1308971051,"description":"AllWebMenus Pro 5.3 Build 868 \n\nAllWebMenus is a dhtml/javascript menu builder for web site navigation that requires absolutely no DHTML or javascript experience from you. It creates cross-browser, popup or drop down menus that work alike in all browsers supporting DHTML (like Firefox, Internet Explorer, Google Chrome, Opera, Mozilla, Konqueror, Safari and more). A javascript menu can be designed with a simple, tree-like approach. You can then fully customize it by using the Properties Pane or by choosing a predefined appearance from the Style Gallery. It can be either vertical or horizontal (popup or drop down menu), it can be movable, stay visible while scrolling, contain static or animated images, borders, colors and much more! Once everything is set, you can compile and link your menu to your web pages in a fast and easy manner, without any code involved!\n\nFeatures:\nÃ‚Â» Import FrontPage Navigation Structures into AllWebMenus\nÃ‚Â» Create Site Maps straight from the Menu Structure of menus\nÃ‚Â» Create menus fast by using pre-designed menu styles from the Theme Gallery\nÃ‚Â» Use multiple menus in the same page\nÃ‚Â» Use many flexible ways to position your menus\nÃ‚Â» Create menus for use inside framed web sites\nÃ‚Â» Specify an alternative web page to open when a user has an older browser that does not support DHTML and javascript\nÃ‚Â» Design both horizontal and vertical menus and use static or animated images for both the background and content\nÃ‚Â» Create effects by assigning different values to the item properties for three different item states\nÃ‚Â» Position the menu anywhere on the screen and keep the menu visible in the same position while scrolling\nÃ‚Â» Specify javascript Commands to be executed when clicking on menu items\nÃ‚Â» Use both vertical and horizontal submenus at any possible combination\nÃ‚Â» Use Titles on submenus and allow the user to drag the menu from its Title\nÃ‚Â» Choose &quot;How&quot;, &quot;When&quot; and &quot;Where&quot;, any submenu appears\nÃ‚Â» Use &quot;Distance Between Items&quot; and assign a &quot;Status Bar Text&quot; for each item\n\nHome page - http://www.likno.com/allwebmenusinfo.html\n","torrent":{"xt":"urn:btih:1d13cf5dba3d3a483ed1b2707d3556508adbb411","amp;dn":"AllWebMenus+Pro+5.3+Build+868+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d13cf5dba3d3a483ed1b2707d3556508adbb411","infoHashBuffer":{"type":"Buffer","data":[29,19,207,93,186,61,58,72,62,209,178,112,125,53,86,80,138,219,180,17]},"announce":[],"urlList":[]}}