{"title":"Grace Bawden - Gifts of Grace (2009)","uid":6383173,"size":117048756,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d4c29f1c8ba0b93acd3a77dd449f2c2db4dd3af&amp;dn=Grace+Bawden+-+Gifts+of+Grace+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piratetorrent1989","files":-1,"time":1305106229,"description":"Grace Bawden (born 7 October 1992) is an Australian classical crossover singer, who has been dubbed &quot;Australia's greatest operatic discovery&quot;, after becoming the Judge's Choice Grand Finalist on the TV talent show Australia's Got Talent in 2008. Despite an offer of contract by a major label, she remains an independent artist.\n\nBawden grew up in Adelaide, Australia with her mother, Matilda Bawden and brother, Luke Bawden. Bawden's voice was first noticed by her mother, who said that at age 2 she would mimic sounds and at age 3, she could sing nursery rhymes better than any other child she had heard. Matilda attempted to get her singing lessons when Bawden was three years old, but teachers considered her too young. Three years later, Bawden's mother found her mimicking an Italian opera playing on radio after mistaking her for someone singing on the television. Matilda attempted to find her daughter lessons again and Bawden began her training at a local music store at six years old. She went to Thomas More College.\n\nCareer\nBawden started to enter and win various singing competitions between the ages of 10 and 14, throughout South Australia and started to attract attention.\n\nIn 2006, Grace performed in front of an audience of 30,000 at the Advertiser-Adelaide City Council, Carols by Candlelight.\n\nIn mid 2007, at age 14, Grace came to the attention of Entertainment Editor, Richard Wilkins, and was invited to sing live on the national Channel 9, Today Show.\n\nIn February 2007, Bawden co-wrote two tracks and recorded material with multi-award winning producer and songwriter Audius Mtawirira, who has also worked with artists such as Delta Goodrem, Guy Sebastian and Paulini.\n\nAround this time, Bawden decided to audition for 2008's Australia's Got Talent (AGT) and began to busk around Adelaide to gain confidence.\n\nIn December, 2007, Grace was invited by former Australian Idol Judge, Mark Holden, to do an interview on live 5AA radio. After singing a Christmas Carol, one of South Australia's most prominent businessmen phoned in to offer to become her first major investor. Soon after, Grace Bawden Promotions Pty Ltd was formed, with the support of many other investors.\n\nShe entered AGT in February, 2008 and the judges unanimously put her through to the next round after receiving a standing ovation for her rendition of O Mio Babbino Caro. In the semi-finals of the competition she was named the Judge's Choice after performing &quot;Ebben? Ne andrÃƒÂ² lontana&quot; from La Wally to go through to the Grand Final. In the Grand Final, Bawden performed The Flower Duet to which she made up her own English lyrics, by request from one judge that she sing something in English. Bawden was in the second pair of contestants that were voted off, making Top 6.\n\nAfter the show, Bawden recorded her debut album and was signed to celebrity Manager, Max Markson [5] and began negotiations with a major label. Despite an offer of a contract, Grace Bawden Promotions eventually released a six track EP independently after a loss of confidence in the company.\n\nIn 2008, Bawden appeared at the South Australian National Football League Grand Final, in front of a crowd of over 40,000.\n\nHer debut album Gifts of Grace was released in September, 2009.\n\nIn September 2010, Bawden travelled to London and Italy where she auditioned for opera schools, including one run by Mirella Freni, the Centro Universale del Bel Canto (CUBEC) and La Scuola Dell' Opera Italiana (SOI) in Bologna. Bawden was ranked &quot;fit for entry&quot; to CUBEC, but due to her young age missed out on a scholarship. Despite her age, she was subsequently accepted for private tuition with SOI\n\nMusic and Voice\nBawden has been classified as a lyric-coloratura soprano and has a vocal range of over 3Ã‚Â½ octaves. Although she became known as an opera singer on Australia's Got Talent, Bawden also sings pop, contemporary, jazz, traditional, musical theatre and arias. Her debut album features cover versions of Midge Ure's 'Dear God', Bruce Springsteen's 'Streets of Philadelphia', Barbra Streisand's 'People', Kansas's 'Dust in the Wind and Paul McCartney's and John Lennon's 'Long and Winding Road'.\n\nIn early 2009, Grace was introduced to Los Angeles, Animation and Film Score Composer, Gregory Hinde by Krystine McLeod to co-write &quot;Angel Will Watch&quot;, which was included on &quot;Gifts of Grace&quot;.\n\nGrace's debut single, Iva Davies's &quot;Man of Colours&quot;, and film clip received his blessing and was aired on national television program, Rage on 4 September, 2009\n","torrent":{"xt":"urn:btih:1d4c29f1c8ba0b93acd3a77dd449f2c2db4dd3af","amp;dn":"Grace+Bawden+-+Gifts+of+Grace+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d4c29f1c8ba0b93acd3a77dd449f2c2db4dd3af","infoHashBuffer":{"type":"Buffer","data":[29,76,41,241,200,186,11,147,172,211,167,125,212,73,242,194,219,77,211,175]},"announce":[],"urlList":[]}}