{"title":"Coast To Coast Am - 09-08-10 - World Famine","uid":5823076,"size":55777243,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1dfcc3a764a3dcef271eee97551f0dfcdfb28f20&amp;dn=Coast+To+Coast+Am+-+09-08-10+-+World+Famine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1284148571,"description":"Date: 09-08-10 \n\nHost: George Noory \n\nGuests: Julian Cribb, Erika Frost  \n\nJournalist and science writer Julian Cribb discussed the limitations to the world food supply which could result in worldwide famine by mid-century, when the population hits 10 billion. If we don't reinvent agricultural science, we could see severe famines even within 20-30 years, he reported. Increased flooding and droughts will cause crop failures and this will drive up the price of grain and food. &quot;As the resources for agriculture get scarcer and scarcer, each one of these successive famines is going to be bigger than the one before,&quot; he cautioned. \n\nWith such famines, we'll also see &quot;tidal movements of refugees&quot; looking for food, he said, and this could destabilize various countries. There's a Spanish saying that &quot;there's only seven meals between civilization and anarchy,&quot; and during famines governments could be torn down, he added. Water shortages are also going to be a huge problem, if we don't start working on alternatives now, such as desalination plants. \n\nAdditional agriculture problems include the shrinking of viable farm lands (replaced by cities), and the impending scarcity of important fertilizer ingredients such as phosphorous, he detailed. The food crisis can be solved with new efforts in science and technology, but right now the world spends 50 times more money on weapons and defense. &quot;Food is vital to peace, if you don't have enough of it, you have war,&quot; said Cribb. He also spoke about how we could create a more sustainable existence by making dietary changes-- such as eating less meat, and grow vegetables in the cities using recycled water to combat shortages. \n\nHaunted Queen Mary\nFirst hour guest, psychic Erika Frost talked about the Haunted Queen Mary, and the ship's history as an ocean liner and vessel that transported troops during wartime. Among the ghosts known to haunt the ship are &quot;Jackie,&quot; a little girl who giggles near the pool area, and &quot;Henry&quot; a presence in the boiler room. Frost will be one of the hosts at the upcoming GhostFest Expo4 aboard the ship, during which George will do a live remote broadcast of C2C. \n\nWebsite(s): \n-erikafrost.com\nBook(s): \n-The Coming Famine\n-Dry Times: Blueprint for a Red Land\n-Open Science\n","torrent":{"xt":"urn:btih:1dfcc3a764a3dcef271eee97551f0dfcdfb28f20","amp;dn":"Coast+To+Coast+Am+-+09-08-10+-+World+Famine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dfcc3a764a3dcef271eee97551f0dfcdfb28f20","infoHashBuffer":{"type":"Buffer","data":[29,252,195,167,100,163,220,239,39,30,238,151,85,31,13,252,223,178,143,32]},"announce":[],"urlList":[]}}