{"title":"The Relief of Bergen Belsen (2007) (nl subs) TBS","uid":6460320,"size":4513493512,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1f40f7bdddb40af6947c79dc9a4da571a98a9735&amp;dn=The+Relief+of+Bergen+Belsen+%282007%29+%28nl+subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1307734275,"description":"The Relief of Bergen Belsen (2007) \t\n\nVerenigd Koninkrijk\nDrama / Oorlog\n101 minuten\n\nmet Katrine Bach, Simon Day en Oliver Ford Davies\n\nGemiddelde:\nMoviemeter: 3,20\nIMDB: 7.3/10\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de grote \\&quot;Hollywoodreleases\\&quot; nog tig van \\&quot;andere\\&quot; (kwaliteits) films zijn, die te goed zijn om in de anonimiteit te verzwelgen.\n\n\nDEen film, afgewisseld met archiefbeelden geregisseerd door Justin Hardy, over de pogingen van een Brits militair medisch team in april 1945 om zoveel mogelijk gevangenen van het concentratiekamp Bergen-Belsen van de dood te redden.\n\nSamenvatting:\nDe Tweede Wereldoorlog is nog in volle gang als in het concentratiekamp Bergen Belsen, de dodelijke ziekte tyfus uitbreekt.\n\nRecensie:\nDe film vertelt het waargebeurde verhaal van ÃƒÂ©ÃƒÂ©n van de meest krankzinnige gebeurtenissen uit de Tweede Wereldoorlog. Een confronterende, onthutsende speelfilm die je nooit meer zal vergeten!\n\nVerhaal:\nDe Tweede Wereldoorlog is nog in volle gang als in het concentratiekamp Bergen Belsen, gelegen achter de frontlinie in Duits gebied, de dodelijke ziekte tyfus uitbreekt. Er wordt een plaatselijk staakt het vuren afgesproken met de Duitse vijand om een Britse ambulancedienst hulp te laten bieden. De Britten hebben geen idee wat ze te wachten staat. Maar liefst 40.000 gevangenen, zwaar ondervoed, amper in bezit van kleren, strijden niet alleen tegen tyfus, maar ook tegen de hongerdood. De ellende is niet te overzien, de Britse missie in Nazi -Duitsland lijkt totaal kansloos! Met de Duitse troepen nog steeds aanwezig in Belsen gaan de Britten aan de slag. Hulpzame burgers, zuster en enkele verzwakte gevangenen staan hun bij. Het wordt voor allen de zwaarste fysieke en mentale beproeving uit hun leven.\n\n\nEnglish\n\nIn early April 1945 a small British ambulance unit was diverted from frontline battle in northern Germany, to handle an unfolding medical crisis behind enemy lines. A local prison camp had suffered an outbreak of typhus. That prison camp was Bergen-Belsen. The British had no idea of the true scale of this humanitarian catastrophe nor of what it would come to represent.\n\nForty thousand prisoners from across Europe had been herded into a concentration camp of unspeakable squalor; deprived of food, clothing and medical supplies for nearly a month; deprived of humanity for the duration of the war. Over the course of the next four weeks, as the war raged, an international medical team battled against the odds to save their lives.\n\nStarring Iain Glen, Corin Redgrave, Jemma Redgrave, Nigel Lindsay and Tobias Menzies, this factual drama reveals the extraordinary true story behind one of the most heroic medical relief operations in history. \n\nInfo:\nBron: Retail\nTaal: Engels\nAudio: DD 5.1\nOndertitels: Nederlands\n\nMet dank en alle eer voor de originele poster\n\n\nFormat\t :DVD5\nSource\t :Retail\nSubtitle : English subs burned\nGenre\t : Drama War\nLanguage : English audio\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0950502/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0950502/&lt;/a&gt;\n\nTBS\n \t","torrent":{"xt":"urn:btih:1f40f7bdddb40af6947c79dc9a4da571a98a9735","amp;dn":"The+Relief+of+Bergen+Belsen+%282007%29+%28nl+subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f40f7bdddb40af6947c79dc9a4da571a98a9735","infoHashBuffer":{"type":"Buffer","data":[31,64,247,189,221,180,10,246,148,124,121,220,154,77,165,113,169,138,151,53]},"announce":[],"urlList":[]}}