{"title":"Sevendust - Ugly (2nafish)","uid":5814341,"size":169168900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1f42de0d7c92771f784fb3f5316737edf8942c9a&amp;dn=Sevendust+-+Ugly+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283770676,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo.\n\n\nUgly is the lead single from album Next by Heavy metal band Sevendust  and was released in October 2005. The song which had a fair amount of radio play and a video for the song, which depicted the band in a dark alley and civilians being lured into a laboratory where they get their eyes taken out. It was the first music video that guitarist Sonny Mayo appeared on it.\n\nThe song was described by drummer Morgan Rose in an MTV.com interview as being a mixed bag with a &quot;huge chorus, broken-down verses and really heavy bridges.&quot;\n\nThe song reached #12 in the Mainstream Rock Chart.\n\nNext is the fifth studio album by alternative metal band Sevendust, released a little over two years after their previous album, Seasons.\n\nThis is the first album by Sevendust with guitarist Sonny Mayo, who replaced Clint Lowery in December 2004. This is also the first and only album release through Winedark Records. The band was able to make its own imprint, 7Bros. Records, which, along with the band, gained freedom from Winedark Records in April 2006.\n\nThe album was self-produced and made while the band had no record label, so they had to use their own money to fund it.\n\nDespite mostly positive reviews and a completely sold out headlining tour, the album failed to sell as well as its predecessors, which all were certified gold. This was mainly due to the lack of good promotion for the album by the record label, as there were many fans who did not even know Sevendust had new music out at the time.\n\nThe first official single, &quot;Ugly&quot;, had a fair amount of radio play and was accompanied by a music video. &quot;Failure&quot; was released as the second single, followed by &quot;Pieces,&quot; which was released as the third official single.\n\nMorgan Rose said that he rushed the writing of Next because of rumours of Sevendust ending. He felt that since Clint Lowery was important he needed to pick up the slack for Sevendust.\n\nSevendust is an American heavy metal band from Atlanta, Georgia. The band was formed in 1994 by bassist Vincent Hornsby, drummer Morgan Rose and guitarist John Connolly. After their first demo, lead vocalist Lajon Witherspoon and guitarist Clint Lowery  joined the group. Following a few name changes, the members settled on the name Sevendust and released their self-titled debut on April 15, 1997.\n\nThe self-titled debut sold 311 copies its first week. However, through touring, and TVT support, the album gained charting success through Billboard and earned gold certification. Since formation, Sevendust has released eight studio albums, earned additional charting success and gold sales certifications. Their eighth studio album, titled Cold Day Memory, was released on April 20, 2010. They have also re-released their self-titled debut album as Sevendust: Definitive Edition which contains five new tracks and a DVD.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1f42de0d7c92771f784fb3f5316737edf8942c9a","amp;dn":"Sevendust+-+Ugly+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f42de0d7c92771f784fb3f5316737edf8942c9a","infoHashBuffer":{"type":"Buffer","data":[31,66,222,13,124,146,119,31,120,79,179,245,49,103,55,237,248,148,44,154]},"announce":[],"urlList":[]}}