{"title":"My Young Auntie [Dragon Dynasty]","uid":5820867,"size":4680841216,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1f5340140200db9dbb1ffa04f5dc9c64b491323f&amp;dn=My+Young+Auntie+%5BDragon+Dynasty%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"heavydiamond","files":-1,"time":1284040657,"description":"Plot\n\nA young female martial-arts champion, Cheng Tai-nun (Kara Hui) marries an elderly landowner so the old man can keep his estate from falling into the greedy and unscrupulous hands of his brother Yu Yung-Sheng (Wang Lung Wei). Tai-nun inherits his estate when he dies, and is soon in Canton, staying with her older nephew by marriage, Yu Cheng-chuan (Lau Kar Leung), and his son Yu Tao (Hsiao Ho). When the traditional and conservative Tai-nun, a woman from the provinces, runs into the modern and Westernized Yu Tao for the first time, the sparks fly and a clash of egos begins. Meanwhile, the evil brother steals the deed to the dead husband's estate. Tai-nun and Yu Tao go to get the deed back and are beaten and held hostage by Yung-Sheng and his experts. Its then up to Yu Cheng-chuan and his brothers to rescue them.\nMight not be 4 everyone this but i loved this movie great fighting great fun not to be taken to serious 10 out of 10 for  Lau Kar Leung's versatile comedy romp.\n\n\n\nThis is the remastered [Dragon Dynasty] print a treat to behold duel language,english subs full menu great great film if not a bit whacky ,not unlike most Shaw Bros movies. I was gonna bless u with (shaolin intruders) but someone has stole it has anyone got the celestial print out there \n\nTo Share is to Care! So it seems. Do not break the share chain! Once you have completed download, seed for the next person in the chain as long as you possibly can, as i wont be be seeding 4 ever more like a week due to other releases i want to share \nI've got a lot of retail movies new wave and old school let me know any requests 90% retail\n\nJust giving back 2 a generous community\n \n\nBurn with img burn or the like enjoy\t","torrent":{"xt":"urn:btih:1f5340140200db9dbb1ffa04f5dc9c64b491323f","amp;dn":"My+Young+Auntie+%5BDragon+Dynasty%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f5340140200db9dbb1ffa04f5dc9c64b491323f","infoHashBuffer":{"type":"Buffer","data":[31,83,64,20,2,0,219,157,187,31,250,4,245,220,156,100,180,145,50,63]},"announce":[],"urlList":[]}}