{"title":"Alex Jones Show - 2010 Aug 18 WE [sebaygo1]","uid":5773363,"size":72340997,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:20677f08f71cb1dfd57e0f3d489d52c330eac9ee&amp;dn=Alex+Jones+Show+-+2010+Aug+18+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":13,"time":1282183685,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 18 August 2010\n\n\n[sebaygo1]\n\n\n\nScheduled Guests\n................\n\n\nAlex welcomes back Congressman Ron Paul to the show to discuss the latest on Iran, legislation in the house, and more. Dr. Paul is a member of the U.S. House of Representatives. During the 1960s, he served as a flight surgeon in the U.S. Air Force. \n[2nd half hour 1]\n\n\n\n[Ted Anderson -- owner of GCN radio network -- comes on at the end of the 1st half of hour 2 to do a &quot;live commercial&quot; for his gold business, Midas Resources.]\n\n\n\nPastor Steven Anderson also joins the show to discuss an incident on U.S. soil with border patrol agents that left him requiring stitches. The officers broke out his car windows and the pastor was Tasered and beaten before being arrested. \n[from about 6 minutes into 2nd half of hour 2, until the end of the hour]\n\n\nNOTE ::\nAlex mentions the video of a conversation he had with Jesse Ventura during the former governor's recent visit in Austin, that has been titled: &quot;Jesse Ventura Talks About Homeland Security &quot;Gestapo,&quot; Hollywood Secrets &amp; More.&quot;\nThe video is about 15 minutes long.  As of right now, the .flv and .mp4 links are not working for me on PrisonPlanet.tv so I downloaded it in .wmv format.  I extracted the audio from that file and it is included with this torrent as a .mp3 file.\nIf you want to get the video, go to my blog.  I will have a direct download link there shortly.\n\n\n \n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........","torrent":{"xt":"urn:btih:20677f08f71cb1dfd57e0f3d489d52c330eac9ee","amp;dn":"Alex+Jones+Show+-+2010+Aug+18+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20677f08f71cb1dfd57e0f3d489d52c330eac9ee","infoHashBuffer":{"type":"Buffer","data":[32,103,127,8,247,28,177,223,213,126,15,61,72,157,82,195,48,234,201,238]},"announce":[],"urlList":[]}}