{"title":"Duke Nukem.ITS.BEEN.12.FUCKING.YEARS.Pack-MAFIAA","uid":6462705,"size":843468466,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:217914e6fe8bdb99feb6473c1f7182dce7d385b2&amp;dn=Duke+Nukem.ITS.BEEN.12.FUCKING.YEARS.Pack-MAFIAA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":-1,"time":1307834702,"description":"it's been 12 FUCKING YEARS EDITION!\n\n\n\n\n1:Duke Nukem: Manhattan Project  (C)  ARUSH ENTERTAINMENT\n\n\nGame information :\n\n\n\nGaming's king of action returns in an all new adventure, this time in New York\n\nCity. Duke battles his way across towering skyscraper rooftops and through\n\ngritty subway stations on the hunt for power-hungry villain, Mech Morphix.\n\nMutants of every kind are thrown at Duke as he chases down Morphix through eight\n\nhuge environments and avoids the green slime called G.L.O.P.P. that is causing\n\nall the chaos.\n\n\n\nFEATURES:\n\n\n\nRadioactive slime isn't Duke's only problem - there over 25 uniquely dangerous\n\nmutated enemies hell-bent on making a meal of him. Whether it's Uzi-sporting\n\nalligators or ten-foot tall roach beasts - Duke's in town to blast bad guys and\n\nsave babes. Sure, pipe bombs, a machine gun, a rocket launcher and a pulse\n\ncannon are gonna make a goo-filled mess in the Big Apple, but what's a hero to\n\n\n\nFast-action 3rd person platform gaming in a rich 3D environment.\n\n\n\nDynamic, zoomable camera gets you close to the action and shows Duke battling it\n\nout from many different angles.\n\n\n\n8 huge, immersive NY-themed missions: Rooftop Rebellion, Chinatown Chiller,\n\nMetro Madness, Unholy Underworld, Fearsome Factory, Tanker Trouble, Deviant\n\nDrilling and Orbital Oblivion.\n\n\n\n9 powerful weapons: Golden Eagle Pistol, Shotgun, Assault Rifle, Pipe Bomb,\n\nG.L.O.P.P. Ray, Pulse Cannon, Pneumatic Rocket-Propelled Grenade Launcher and\n\nthe Mighty Boot kick. Plus, some weapons get powerful upgrades by collecting all\n\nNuke symbols in the various skill levels, leading up to the incredible X-3000!\n\n\n\nMore than 25 enemies ranging from the Gator-Oids, mutated Uzi-wielding\n\nalligators, to Fem-Mechs, female robot mutants with deadly whips. Classic Duke\n\nenemies like the PigCops will also be among the dead piled up at your feet.\n\n\n\nTrue Duke Nukem action and attitude, great weapon effects and sarcastic\n\none-liners.\n\n\n\n\n\n2:Old Duke Nukem 3d but with better graphics!\n\n\n\nInstructions:\n\n\n\nOnce extracted just click on either setup.exe to start setting up your config before starting the game or click on one of the other duke3d exe's.\n\n\n\nUpdated from:\n\n\n\n1 Feb 2008 (3.6a)\n\n\nNote the Uploader:\n\n\n\nThe Duke3D High Resolution Pack allows you to use much better looking textures than the original game (released back in 1996) had to offer in the first place. It also introduces 3D model replacements for the old enemies/weapons/sprites. Incombination with an OpenGL port like JFDuke3D or EDuke32 this gives Duke Nukem 3D a modernized, more appealing look and even motivates Duke veterans to play through the original episodes once again.\n\n\n\nEnjoy this game with love From MAFIAA!","torrent":{"xt":"urn:btih:217914e6fe8bdb99feb6473c1f7182dce7d385b2","amp;dn":"Duke+Nukem.ITS.BEEN.12.FUCKING.YEARS.Pack-MAFIAA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217914e6fe8bdb99feb6473c1f7182dce7d385b2","infoHashBuffer":{"type":"Buffer","data":[33,121,20,230,254,139,219,153,254,182,71,60,31,113,130,220,231,211,133,178]},"announce":[],"urlList":[]}}