{"title":"UnHackMe.v5.99.385.Cracked-MESMERiZE","uid":6490184,"size":12412304,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:224ecec027482b36f66d2c4e5a1b4ec05c785f41&amp;dn=UnHackMe.v5.99.385.Cracked-MESMERiZE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1308852316,"description":"UnHackMe 5.99.385 \n\nUnHackMe - First BootWatch AntiRootkit! Now it is the must have tool for you! UnHackMe is specially designed to detect and remove Rootkits (a new generation of Trojan programs - invisible Trojans). A rootkit is a program that a hacker uses to mask intrusion and obtain administrator-level access to a computer or computer network. The intruder installs a rootkit on a computer using a user action or by exploiting a known vulnerability or cracking a password. The rootkit installs a backdoor giving the hacker a full control of the computer. It hides their files, registry keys, and process names, and network connections from your eyes. Your antivirus could not detect such programs because they use compression and encryption of its files. The sample software is Hacker Defender rootkit. UnHackMe allows you to detect and remove Rootkits.\n\nBenefits:\nUnHackMe Pro includes special designed tools for detecting deep hidden rootkits.\nUnHackMe Pro is unique for each user and it is invisible for a rootkit.\nYou can open UnHackMe Pro from CD-ROM or from a flash drive.\nYou can use UnHackMe Pro license for checking and removing rootkits from user computers.\nNo need to install UnHackMe on a user computer.\nNo need to purchase additional licenses.\nEasy in use. No comments!\n\nHome Page - http://www.greatis.com/\n\n\n","torrent":{"xt":"urn:btih:224ecec027482b36f66d2c4e5a1b4ec05c785f41","amp;dn":"UnHackMe.v5.99.385.Cracked-MESMERiZE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"224ecec027482b36f66d2c4e5a1b4ec05c785f41","infoHashBuffer":{"type":"Buffer","data":[34,78,206,192,39,72,43,54,246,109,44,78,90,27,78,192,92,120,95,65]},"announce":[],"urlList":[]}}