{"title":"DVDFab 8.0.9.0 Final Multilang (Qt)","uid":6378349,"size":18924747,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24262d9dca73ba6a8d31e88e31f3e7cc1f645818&amp;dn=DVDFab+8.0.9.0+Final+Multilang+%28Qt%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1304901290,"description":"DVDFab is the most powerful and flexible DVD/ Blu-ray copying/burning software. Also it's a fantastic file converter &amp; transfer which can rip and convert DVD/Blu-ray movies or transfer your local files to various portable devices like iPod, iPhone, PSP, cell phone, ZUNE, etc. With 8 copy modes, you can back up any DVD to DVDR in just a few clicks. DVDFab is simply the easiest way to copy a DVD/ Blu-ray movie. Just insert the movie and a blank DVD/ Blu-ray then press Start. Your entire movie - including menus, trailers and special features - is copied to a single DVD/ Blu-ray with just one click, and everything happens automatically. Backup your entire DVD/ Blu-ray - including menus, trailers, and special features - onto one or multiple discs. DVDFab Blu-ray to DVD Converter is definitely the first software in the world which can decrypt then convert any Blu-ray to DVD-Video disc for playback on DVD player or DVD player software with no third party's help.\n\n\nDVDFab &quot;Blu-ray to Blu-ray&quot; is the first full-featured Blu-ray copying/burning software. With 4 copy modes, you can backup Blu-ray to BD-R or hard drive in just one or a few clicks.\nDVDFab &quot;DVD to Mobile&quot; converts DVD title to AVI/MP4/WMV/MKV files which can be played on mobile devices like iPod, PSP, ZUNE, cell phone, etc.\nDVDFab &quot;File to Mobile&quot; converts source video file on your PC to next generation console like PS3 and Xbox 360, or mobile devices like iPod, PSP, ZUNE, cell phone, etc.\nDVDFab &quot;File Mover&quot; option transfers converted files to mobile devices like iPod, PSP, ZUNE, etc.\n\nDVDFab DVD Copy is popular worldwide and known for its power and flexibility. You can copy a DVD with just a click or two, or use DVD Copy's many settings to customize the ouput. Burn it to a blank DVD or write the output to a folder or image file on your hard drive or media server, compress content to fit on smaller discs, the choice is yours!\nDVDFab Blu-ray Copy firstly supports Civavia protection in the world and can lead you out of the above plight. How does it work? Blu-ray Copy now can copy any Blu-ray disc with Cinavia watermark, and create a protected disc (BDMV-REC) to disable Civania for playback on PS3. Keep in mind that you can only accomplish this in either &quot;Full Disc&quot; or &quot;Main Movie&quot; mode using Blu-ray Copy, check &quot;Create Protected Disc (BDMV-REC) to disable Cinavia&quot; option, and choose output as BD 50 / BD 25.\n\nPasskey for DVD/ Blu-ray is the very app for you to view any DVD/ Blu-ray using your region specific player regardless of annoying region code. And it can also remove all known DVD copy protections just in seconds, then work with a variety of software to access any DVD/ Blu-ray content, particularly works well with DVDFab DVD/ Blu-ray Copy and DVD/ Blu-ray Ripper. Really a powerful and helpful tool!\n\nDVDFab Blu-ray 3D Ripper is accurately the world's first Blu-ray 3D converter software. It can get rid of all Blu-ray protections and freely convert Blu-ray 3D to 3D video for playback on 3D display device. Especially, this best Blu-ray to 3D converter supports the current popular side-by-side format for 3D content.\n\nDVDFab HD Decrypter is a simple version of DVDFab &quot;DVD to DVD&quot; and DVDFab &quot;Blu-ray to Blu-ray&quot;. It copies entire DVD/Blu-ray movie to hard drive, and removes all the DVD protections and part of Blu-ray protections while copying.\nDVDFab File Transfer transfers converted files to devices. Currently it supports iPod, PSP and ZUNE, and it will support more devices in the future.\n\nWorks on Windows 7/Vista/XP/2000 (32-bit/64-bit).\n\nChanges in DVDFab 8.0.9.0 Qt (May 9, 2011):\n    * New: Rewritten user interface with Qt.\n    * New: Updated Qt language files.\n    * New: Some minor changes and improvements.\nDVD Ripper:\n    * Fix: A/V sync problems in certain cases.\nBlu-ray Copy:\n    * New: AACS MKB v24 is out and already be supported.\n    * New: Added support for ATI Stream acceleration technology.\n      Note: Please update AMD Radeon video card drivers first.\n      1. Visit http://sites.amd.com/US/GAME/DOWNLOADS/Pages/downloads.aspx\n      2. Download both &quot;Catalyst Software Suite&quot; and &quot;AMD Media Codec Package&quot; (Optional Downloads).\n    * Currently the ATI Stream support is limited to video decoding only. It's the problem of AMD driver, and we need to wait for driver updates to support H.264 video encoding. Also the decoding speed of ATI Stream is not very faster than DXVA, but it should be more stable than DXVA. New: Added support for new Java-based protection.\n    * New: Added option &quot;Enable Blu-ray 3D only disc to be played on 2D display&quot; in &quot;Settings -&gt; Protection -&gt; Blu-ray&quot; for &quot;Clone&quot; mode.\n    * New: Added option &quot;Hide PS3 update files&quot; in &quot;Settings -&gt; Protection -&gt; Blu-ray&quot; for &quot;Clone&quot; mode.\n    * New: Added option &quot;Always create miniso file&quot; in &quot;Settings -&gt; Blu-ray Copy&quot;.\n    * Fix: A problem that output size is too small when compressing certain discs like &quot;The Social Network&quot; to BD25.\n    * Fix: A problem that 2D copy of Blu-ray 3D disc cannot be played on certain players like PS3.\nBlu-ray Ripper:\n    * New: Added support for ATI Stream acceleration technology.\n    * New: Improved default audio stream selection.\n    * Fix: A crash problem when converting certain discs like &quot;Robin Hood&quot;.\nBlu-ray to DVD Converter:\n    * New: Added support for multiple audio stream selection.\n    * Fix: A video quality problem caused by the new VBR encoding.\nVideo Converter:\n    * Fix: Several problems when rendering external subtitle.\n2D to 3D Converter:\n    * New: Added brand new option &quot;2D to 3D Converter&quot;.\n    * New: &quot;2D to 3D Converter&quot; works with &quot;DVD Ripper&quot;, &quot;Blu-ray Ripper&quot; and &quot;Video Converter&quot; to convert DVD/Blu-ray/video file into 3D video.\n    * New: Sophisticated algorithms are used to do the 2D to 3D conversion for very high quality.\n    * New: The 3D video output can be left/right (side-by-side) or top/bottom format, or two separate files, just like &quot;Blu-ray 3D Ripper&quot;.\n\n","torrent":{"xt":"urn:btih:24262d9dca73ba6a8d31e88e31f3e7cc1f645818","amp;dn":"DVDFab+8.0.9.0+Final+Multilang+%28Qt%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24262d9dca73ba6a8d31e88e31f3e7cc1f645818","infoHashBuffer":{"type":"Buffer","data":[36,38,45,157,202,115,186,106,141,49,232,142,49,243,231,204,31,100,88,24]},"announce":[],"urlList":[]}}