{"title":"Democracy Now - 30 aug 2010","uid":5799146,"size":451180541,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:249000010995b0989f53f4611f7d87c4af843fee&amp;dn=Democracy+Now+-+30+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1283186799,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 30, 2010\n\n- Fire Set at Site of Future Mosque in Tennessee\n- Mexican Mayor Killed in Border State\n- FDA to Begin Inspections of Factory Egg Farms\n- UN Report Accuses Rwandan Troops of Committing Genocide in the Congo\n- Flooding Continue in Pakistan, a Month After Disaster Began\n- Influential Israel Rabbi: Palestinians Should Perish with a Plague\n- Glenn Beck Hosts Rally on Anniversary of MLK's March on Washington\n- Youth Unemployment Reaches Record Level\n- Heavily Armed Army Veteran Shot Dead in Utah\n\n\nSpecial reports\n\n- &quot;The Big Uneasy&quot;-In New Doc, Harry Shearer Makes the Case that Katrina Was an Unnatural Disaster\n\nOn the fifth anniversary of Hurricane Katrina, a new documentary, The Big Uneasy, argues that the destruction of New Orleans was an unnatural disaster and how it could have been prevented. We speak with the filmmaker: actor and satirist Harry Shearer.\n\n\n- Remembering Hurricane Katrina: Voices from the Storm\n\nThis Sunday marked the fifth anniversary of Hurricane Katrina. Early on the morning of August 29th, 2005, the storm slammed into the Gulf Coast, just south of New Orleans. It ravaged the coasts of Louisiana, Mississippi and Alabama and left over 1,800 people dead. Eighty percent of the city of New Orleans was under water after the levees failed. We go back to 2005 to air some of the voices from New Orleans in the aftermath of the storm.\n\n\n- Community &amp; Resistance After Katrina: Jordan Flaherty and Tracie Washington on the Fight to Save New Orleans\n\nPresident Obama visited New Orleans on Sunday and praised the recovery of the city and the resilience of its people five years after Hurricane Katrina. We talk to lifelong New Orleans resident and civil rights attorney, Tracie Washington, and Jordan Flaherty, a community organizer and author of Floodlines: Community and Resistance from Katrina to the Jena Six.\n\n\n- Displaced New Orleans Poet Sunni Patterson: I Will Be a &quot;Cultural Ambassador to Bring a Light to Every Injustice&quot;\n\nWe go to New Orleans to speak with poet and performer Sunni Patterson. She's from the Lower Ninth Ward, but like thousands of the city's residents has been forced to live outside and is now based in Houston, Texas.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:249000010995b0989f53f4611f7d87c4af843fee","amp;dn":"Democracy+Now+-+30+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"249000010995b0989f53f4611f7d87c4af843fee","infoHashBuffer":{"type":"Buffer","data":[36,144,0,1,9,149,176,152,159,83,244,97,31,125,135,196,175,132,63,238]},"announce":[],"urlList":[]}}