{"title":"La CittÃƒÂ  delle Donne","uid":5786602,"size":4509513728,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:25a8f28157cad7e8ade5ca3edf02aa443835dada&amp;dn=La+Citt%C3%83%C2%A0+delle+Donne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiagofavi2612","files":1,"time":1282661300,"description":"Neste filme-seqÃƒÂ¼ÃƒÂªncia de sonho, o renomado diretor italiano Federico Fellini  expÃƒÂµe longamente sobre a natureza, complexidade, atitudes e hang-ups da mulher e como isso tudo se relaciona com os homens &quot;caÃƒÂ§a&quot; conquistas sexuais. Snaporaz ( Marcello Mastroianni ) is traveling in a compartment on a train when he lapses into sleep and dreams the ensuing story. Snaporaz ( Marcello Mastroianni ) ÃƒÂ© viajar em um compartimento de um trem, quando ele cair em sono e os sonhos a histÃƒÂ³ria que se seguiu. He follows a woman off the train and through a field and then loses her. Ele segue uma mulher fora do trem e por um campo e depois perde-la. Soon, as a representative of the male sex in general he finds himself in a hotel, among myriad women attending a feminist conference. Logo, como representante do sexo masculino, em geral, encontra-se em um hotel, entre as mulheres mirÃƒÂ­ade assistir a uma conferÃƒÂªncia feminista. Surreal episodes take him through a villa with his alter-ego Dr. Katzone ( Ettore Manni , who died during filming) and references to his sexual exploits. Surreal episÃƒÂ³dios levÃƒÂ¡-lo atravÃƒÂ©s de uma villa com seu alter-ego do Dr. Katzone ( Ettore Manni , que morreu durante as filmagens) e referÃƒÂªncias ÃƒÂ s suas faÃƒÂ§anhas sexuais. Reunited with his former wife for a moment, he starts another sequence which reviews his past. Reunido com sua ex-esposa por um momento, ele comeÃƒÂ§a outra seqÃƒÂ¼ÃƒÂªncia que revÃƒÂª o seu passado. ~ Eleanor Mannikka, All Movie Guide ~ Eleanor Mannikka, All Movie Guide","torrent":{"xt":"urn:btih:25a8f28157cad7e8ade5ca3edf02aa443835dada","amp;dn":"La+Citt%C3%83%C2%A0+delle+Donne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25a8f28157cad7e8ade5ca3edf02aa443835dada","infoHashBuffer":{"type":"Buffer","data":[37,168,242,129,87,202,215,232,173,229,202,62,223,2,170,68,56,53,218,218]},"announce":[],"urlList":[]}}