{"title":"Dragon.Age.2.Update.v1.02.Cracked-FLTDOX","uid":6319987,"size":26114760,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:26d34a863872074516cc479fc321f9aca1dfc472&amp;dn=Dragon.Age.2.Update.v1.02.Cracked-FLTDOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1302917774,"description":"                Dragon Age 2 v1.02 *Cracked*                        \n                   (c) Electronic Arts                             \n\nCracked by:  FAiRLiGHT              Release Date: 15/04/11            \nPackaged by: FAiRLiGHT              # of Options: N/A                 \nType: [ ] Manual/Reference Card             Type: Crack               \n      [ ] CD/Box Covers           \n      [ ] Walkthrough             \n      [ ] Strategy Guide          \n      [ ] Cheat/Trainer          \n      [x] Patch                  \n      Number of archives: x                                               \n\nChanges coming with this patch:\n\n\nAMD and NVIDIA have recently released new graphics-card drivers. \nUsing old drivers may cause Dragon Age II to crash, run poorly, \nor display graphics incorrectly. Please visit your hardware vendor's \nwebsite for further information on obtaining new drivers:\n &lt;a href=&quot;\nhttp://www.nvidia.com/Download/Find.aspx?lang=en-us&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nvidia.com/Download/Find.aspx?lang=en-us&lt;/a&gt; &lt;a href=&quot;\nhttp://support.amd.com/us/kbarticles/Pages/Catalyst114earlypreview.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://support.amd.com/us/kbarticles/Pages/Catalyst114earlypreview.aspx&lt;/a&gt; \n\nNOTE: Some plot fixes are retroactive, but not all. Players with \nplot-breaking bugs may need to revert to an earlier save, \nparticularly a save prior to visiting the affected area during the \ncurrent year in the game.\n\nGAMEPLAY\n\n- The effects of various follower talents and item properties are \n  now being properly removed and re-applied when loading and saving.\n- Anders's default set of tactics will now activate Haste when \n  appropriate.\n- Aveline's final armor upgrade is now available during &quot;Favor and Fault.&quot;\n- Aveline's Retaliation talent no longer imposes a delay when activated.\n- The warrior's Rally talent now functions as described.\n- The rogue's Lacerate talent now functions as described.\n- Party members who are resurrected during a fight now rejoin combat properly.\n- Hawke no longer gains random spells or talents after using the Maker's \n  Sigh potion, then saving and reloading.\n- Potions, poisons, grenades, and runes can now still be ordered from \n  the Hawke estate after the main campaign is complete.\n- Various minor gameplay issues no longer occur.\n\n\nQUESTS (SPOILER WARNING)\n\n- &quot;Who Needs Rescuing&quot; can now be completed.\n- &quot;Duty&quot; will now appear on the Chanter's Board even if the player \n  accepted all of the board's quests before installing the Exiled \n  Prince premium content.\n- The journal for &quot;Duty&quot; will now update if the player left the \n  Docks (Night) area immediately after killing the Flint Company \n  mercenaries.\n- In &quot;Finders Keepers,&quot; the door to Woodrow's Warehouse will now\n  open if the player steals the location to the warehouse from the \n  harbormaster's office.\n- In &quot;Finders Keepers,&quot; if the player leaves Woodrow's Warehouse before \n  finding the crate, it is now possible to return to the warehouse to \n  complete the quest.\n- In &quot;Herbalist's Tasks,&quot; the varterral's heart is now available even \n  if the player killed the varterral before receiving the quest.\n- Merrill no longer refers to the aftermath of &quot;A New Path&quot; before \n  the plot has been completed.\n- Varric is no longer confused about which character Hawke has been romancing.\n- Various minor story-scripting issues no longer occur.\n\nPC/MAC-SPECIFIC FUNCTIONALITY\n\n- Varric's Embellishment talent no longer incorrectly refers to \n  movement speed.\n- It is now easier to select party members by clicking on their \n  portraits when the level-up arrow is displayed.\n- The game now functions correctly if the Windows desktop is set to \n  150% size.\n- The video options menu now allows a wider full-screen gamma range.\n- Various issues specific to DirectX 11 no longer occur.\n- Various technical changes should improve performance and limit crashes.\n\n\n\nInstructions:\n\n- Install the update\n- Copy the crack to the installed dir, overwrite when prompted\n\n\n                                                /TEAM FAIRLIGHT\n\n\n     +-+  Kindest regards - FairLight DOX 2011 +-+           ","torrent":{"xt":"urn:btih:26d34a863872074516cc479fc321f9aca1dfc472","amp;dn":"Dragon.Age.2.Update.v1.02.Cracked-FLTDOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26d34a863872074516cc479fc321f9aca1dfc472","infoHashBuffer":{"type":"Buffer","data":[38,211,74,134,56,114,7,69,22,204,71,159,195,33,249,172,161,223,196,114]},"announce":[],"urlList":[]}}