{"title":"From Ashes To Kings DEMO (2011)","uid":6387816,"size":6708740,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2af234b2137bef21b55a1b0054696e65f534ab1a&amp;dn=From+Ashes+To+Kings+DEMO+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FATKband","files":2,"time":1305261526,"description":"PLEASE LIKE US ON FACEBOOK FOR MORE:\nMusic will continue to be free!\n\n\n\nThis Demo was recorded and mixed by ourselves. We are very proud of the work that we have accomplished, however, there is still much more to be anticipated!\n\nABOUT OUR BAND:\n\n\nFrom Ashes To Kings is a 6 piece band from the Edmonton area with strong hopes to bring a new sound to the scene. With driving punk-pop beats, along with a heavy hitting hardcore sound; From Ashes To Kings truly have taken inspiration from every angle to create a diverse, unique sound.\nBiography\nFrom Ashes To Kings is a 6 piece band from the Edmonton area with strong hopes to bring a new sound to the scene.\nComposed back in September by founding members, Garrett Wilde, Robbie Townsend, and Aaron Blackburn; the band set their eyes on filling up all spots with as much diversity as possible. It was then that a synth player, Alicia Blackburn was introduced, followed shortly after by Tanner Ferbey and Marc-Andre Morin.\nWith the diverse blend of pop punk riffs, fused with hardcore breakdowns, and synth work; From Ashes To Kings is hoping to bring out a change in sound anywhere they reach out.\n\nMessage from the band:\n\nWatch for us early 2011 in the Edmonton Area! We have free music on the way for you guys, which includes a 5 song demo, along with all our artwork! We\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'re looking to get as interactive with you all as possible, whatever you want, request it on our Myspace, or our Facebook page. You guys are all a number one priority for us, and that won\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t ever change!\nSo for now, be on the look out, hit us up once we have all our promotional work together, and we\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'d be happy to set something up with you!\n\nThanks guys!\nWe\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'re stoked!\n- From Ashes To Kings","torrent":{"xt":"urn:btih:2af234b2137bef21b55a1b0054696e65f534ab1a","amp;dn":"From+Ashes+To+Kings+DEMO+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2af234b2137bef21b55a1b0054696e65f534ab1a","infoHashBuffer":{"type":"Buffer","data":[42,242,52,178,19,123,239,33,181,90,27,0,84,105,110,101,245,52,171,26]},"announce":[],"urlList":[]}}