{"title":"Resurrection Band","uid":5793442,"size":966819655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c0c9fbf1f8dc304d3cee86054bf511cb456df9f&amp;dn=Resurrection+Band&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freedomp","files":197,"time":1282945457,"description":"Resurrection Band, also known as Rez Band or REZ, was a Christian rock band formed in 1972. They were based out of the Jesus People USA Christian community in Chicago, Illinois, and most of its members continue to be part of that community to this day. Known for their blend of blues-rock and hard rock, Resurrection Band is credited as one of the forerunners of the Christian metal genre, releasing their debut in 1978. The band's greatest popularity was during the early 1980s, but later in the decade, they received some crossover success when they had two music videos featured on MTV.[1]\n\nLed by the husband-and-wife team of Glenn and Wendi Kaiser, the band sought to evangelize using Christian rock, and addressed a variety of social ills in the lyrics of their music. While the group is officially disbanded, they occasionally play one-off dates at the Cornerstone Festival, which members of the band helped establish. Currently Glenn Kaiser has an established solo career as a blues musician and is also a speaker on various spiritual issues to youth and adults.[2]\n","torrent":{"xt":"urn:btih:2c0c9fbf1f8dc304d3cee86054bf511cb456df9f","amp;dn":"Resurrection+Band","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c0c9fbf1f8dc304d3cee86054bf511cb456df9f","infoHashBuffer":{"type":"Buffer","data":[44,12,159,191,31,141,195,4,211,206,232,96,84,191,81,28,180,86,223,159]},"announce":[],"urlList":[]}}