{"title":"The Pacific (2010) DVD 4 Afl.7+8 NLT-Release","uid":5778667,"size":4663448065,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2cb361b5a5d7c38008b1cecfce42c41cb17379f7&amp;dn=The+Pacific+%282010%29+DVD+4+Afl.7%2B8+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nlt-Release-XX-Men","files":18,"time":1282338329,"description":"The Pacific (2010) DVD 4 Afl. 7+8 NLT-Release\n\n\n[url=http://www.imdb.com/title/tt0374463/]IMDB[/url]\nGenre: Oorlog, Drama\nActeurs: Joseph Mazzello, James Badge Dale, Jon Seda, Chris Milligan, Ashton Holmes, Josh Helman, Martin McCann, Keith Nobbs, Toby Leonard Moore, Tom Hanks, Jacob Pitts\n\nPlot: \nDe productie van The Pacific is op 13 augustus 2007 begonnen in AustraliÃƒÂ«. Filmlocaties zijn onder andere de omgeving van Port Douglas, Melbourne en Victoria.[1] De serie heeft een budget van meer dan $200 miljoen en is daarmee de duurste ooit gemaakt in AustraliÃƒÂ«.\n\nDe verhaallijn van The Pacific, geschreven door Hugh Ambrose, staat los van die van Band of Brothers en is voornamelijk gebaseerd op twee memoires van Amerikaanse mariniers: With the Old Breed van Eugene Sledge en Helmet for my Pillow van Robert Leckie. De serie zal het verhaal vertellen van de twee auteurs en marinier John Basilone, die deelnamen aan de oorlog tegen het Japanse Keizerrijk.\n\nDeel 7 - De mariniers zetten het gevecht met de Japanners om Peleliu voort in de heuvels van het eiland.\nDeel 8 - Basilone keert terug in actieve dienst. Hij gaat nieuwe mariniers trainen voor de strijd in de Grote Oceaan, met wie hij vervolgens ingezet wordt in de landing op Iwo Jima.\n\nGenre: War Drama\nActors: Joseph Mazzello, James Badge Dale, Jon Seda, Chris Milligan, Ashton Holmes, Josh Helman, Martin McCann, Keith Nobbs, Toby Leonard Moore, Tom Hanks, Jacob Pitts\n\nPlot:\nThe production of The Pacific on August 13, 2007 began in Australia. Film locations include the area of Port Douglas, Melbourne and Victoria. [1] The series has a budget of more than $ 200 million, making it the most expensive ever made in Australia.\n\nThe storyline of The Pacific, written by Hugh Ambrose, is separate from that of Band of Brothers is based primarily on two memoirs by U.S. Marines: With the Old Breed by Eugene Sledge and Helmet for My Pillow by Robert Leckie. The series will tell the story of the two authors and Marine John Basilone, who participated in the war against the Japanese Empire.\n\n7. Part Seven - The Marines continue the fight with the Japanese at Peleliu on in the hills of the island. \n8. Part Eight - Basilone returned to active service. He will train new Marines to fight in the Pacific, with whom he then \nBron: HD\nOndertiteling: Nederlands\nGesproken taal: Engels\nMenu: Nee\nExtras: Nee\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail \nOndertitels : Nederlands (instelbaar) \nGenre : Drama\nTV Shows/Series\nOorlog \n\n\nEnjoy the movie","torrent":{"xt":"urn:btih:2cb361b5a5d7c38008b1cecfce42c41cb17379f7","amp;dn":"The+Pacific+%282010%29+DVD+4+Afl.7%2B8+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cb361b5a5d7c38008b1cecfce42c41cb17379f7","infoHashBuffer":{"type":"Buffer","data":[44,179,97,181,165,215,195,128,8,177,206,207,206,66,196,28,177,115,121,247]},"announce":[],"urlList":[]}}