{"title":"Final Fantasy XIV Open Beta (EU)","uid":5815622,"size":4668753483,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d5cf73c470e9bfef394aa0a3272ce719ffde4a5&amp;dn=Final+Fantasy+XIV+Open+Beta+%28EU%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"to12horse","files":1,"time":1283812241,"description":"My second attemt to bringt you the full Beta Client - after my first Torrent got deleted.\n\n\nYou will hereby get the Installation folder of the EUROPEAN Final Fantasy XIV Open Beta. I chose to pack it into a .rar file, because the whole folder has more than 130.000 files in it, and I did not want to kill my HDD while seeding.\n\nOnce you've downloaded the file, unpack it and start the ffxivconfig.exe to change the language and the graphics settings. After that, start the ffxivboot.exe, it will start the updater and after all updates have been downloaded, the game will start. You can also try to directly start the ffxivupdater.exe oder ffxivgame.exe, but I could not start the game with it, so I always have to start the ffxivboot.exe.\n\nAnother notice: You need an open beta account to play this game! It does not have a single player mode, it is a MMORPG and you need to check http://entry.ffxiv.com/ to get into the beta - if you do not already have a beta account.\n\nAlso I hope this torrent won't get deleted again. I can understand, that TPB wants to keep the site virus-free, so please let this torrent be in for some time to give users the chance to confirm, that it works. (I uploaded during the time between the deletion of the first torrent, and this now, so there should be seeds who might confirm it).\n\n\nI wish you as much fun as I have with this game.","torrent":{"xt":"urn:btih:2d5cf73c470e9bfef394aa0a3272ce719ffde4a5","amp;dn":"Final+Fantasy+XIV+Open+Beta+%28EU%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d5cf73c470e9bfef394aa0a3272ce719ffde4a5","infoHashBuffer":{"type":"Buffer","data":[45,92,247,60,71,14,155,254,243,148,170,10,50,114,206,113,159,253,228,165]},"announce":[],"urlList":[]}}