{"title":"Mejasi","uid":5818427,"size":2997749738,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d90d9c6995c12ec1a818ac5f1b22c73e011f75a&amp;dn=Mejasi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bucov979","files":7,"time":1283954750,"description":"MEJAÃ…Â I - (1970)\n\n\nKOLINJE  : Ovo je pilot epizoda &quot;MejaÃ…Â¡a&quot; a kasnije je snimljeno joÃ…Â¡ Ã…Â¡est epizoda:\n\nU duhovito profiliranim likovima podravskih sela, kojima je Mladen Kerstner dao literarni dignitet, prepoznajemo glavne aktere kasnijih &quot;Gruntovcana&quot;.Gotovo svi vaÃ…Â¾niji likovi postavljeni su u seriji &quot;MejaÃ…Â¡i&quot;.\n\n1. epizoda: FALINGA IMBRE PRESVETLOG\nU prvoj epizodi &quot;Falinga Imbre Presvetlog&quot; Dudek i Regica imaju problema jer im Presvetli Ã…Â¾eli posjeci treÃ…Â¡nju koja mu baca sjenu na trsje...\n\n2. epizoda: KRCMA &quot;GROZDU&quot;\nPresvetli se dosjetio kako ce se i u njihovo selo slijevati &quot;penezi&quot;. Nece graditi nove kuce i tvornice, koje vidi u daljini, nego ce prodavati vino, pa prijatelja nagovori da otvori krcmu. Tako ce obitelj Ã…Â kvoro otvoriti gostionicu, a dobar posao i zardu zahvalit ce zamamnoj konobarici koju je doveo Presvetli. Uskoro u selu nastaje pomutnja...\n\n3. epizoda: PARADE MORA BITI\nObitelji Ã…Â kvoro i Cinoberi pokuÃ…Â¡avaju se nagoditi oko svadbe svoje djece. Ã…Â tef je Ivkicu &quot;zakaparil&quot; i sad Ã…Â¡alje pismo u kojem piÃ…Â¡e kako se vraca kuci i ne Ã…Â¾eli viÃ…Â¡e raditi u tudini. Sve bi bilo dobro da su roditelji o tome bili obavijeÃ…Â¡teni, jer Ã…Â tef i Ivka ne mogu sami odluciti o mirazu. Dok stariji pregovaraju, umalo ne izbije svada. Presvetli spaÃ…Â¡ava stvar, kao i uvijek...\n\n4. epizoda: VATROGASCI\nRazlog za paradu mejaÃ…Â¡i ce naci u obnovi vatrogasnoga druÃ…Â¡tva. Ali za paradu treba vjeÃ…Â¾bati, obnoviti znanje. Za komandira izabran je Imbra Presvetli, ali Cinober se ne slace s tim. Kad Dudek bude u nevolji, Cinober uzima stvar u svoje ruke. Tko je komandir parade, vidjet ce se na kraju...\n\n5. epizoda: COPRIJA\nÃ…Â inter u selu volio je popiti, a osobito je bio ljut na crne macke. Kad se navecer vracao kuci iz birtije, izvrijedao je susjede. To mu se preko noci osvetilo...\n\n6. epizoda: POGAN\nÃ…Â tefa i Ivkicu njihovi roditelji i rodaci nikada ne puÃ…Â¡taju na miru. Jedva su se stari nagodili kad se dogovarala svadba, a sad kad se rodio sin, nevolje ao da su tek pocele. Dijete treba krstiti, ali oko imena se ne mogu sloÃ…Â¾iti, no tu je Presvetli koji ima rjeÃ…Â¡enje...","torrent":{"xt":"urn:btih:2d90d9c6995c12ec1a818ac5f1b22c73e011f75a","amp;dn":"Mejasi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d90d9c6995c12ec1a818ac5f1b22c73e011f75a","infoHashBuffer":{"type":"Buffer","data":[45,144,217,198,153,92,18,236,26,129,138,197,241,178,44,115,224,17,247,90]},"announce":[],"urlList":[]}}