{"title":"Coast To Coast Am - 08-25-10 - The Facebook Phenomenon","uid":5793083,"size":56051117,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2db67fc3de511f9dd0cda278ea0eb99c7bfea474&amp;dn=Coast+To+Coast+Am+-+08-25-10+-+The+Facebook+Phenomenon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1282926869,"description":"Date:\n 08-25-10\n \nHost:\n George Noory\n \nGuests:\n David Kirkpatrick, Christian Wilde, Dr. Nabil Dib \n \n\n\nSenior tech writer at Fortune magazine, David Kirkpatrick discussed the origins of the social network Facebook from a Harvard dorm room to a worldwide, game changing cultural phenomenon. &quot;It is probably the fastest growing company of any type in the history of the planet, in terms of customers,&quot; with over 500 million users, within just six years, he reported. The spread of Facebook is not at all limited to America, and has shown phenomenal growth in other countries. &quot;It's the most efficient communications medium...we've ever had in that it automates the way we communicate with groups of other people,&quot; compared to email or phone calls which are individualized, he noted. \n\nFacebook is a technology company which has rapidly evolved, in contrast to MySpace, which has lagged behind in members and remained more of a content platform, said Kirkpatrick. Twitter, he noted, has a different type of business model than Facebook, with much of its communication functioning one-way, with large numbers of people just following one individual. \n\nAt just 26 years old, Facebook's founder, Mark Zuckerberg, has a net worth of around $6-7 billion, but has remained pragmatic, and focused on growing his company even larger, Kirkpatrick detailed. A computer scientist/engineer, he started the company at age 19 with several fellow students at Harvard, with the focus originally on just college students. As Facebook has grown, it's been dogged by concerns over the privacy and security of its members' data. Interestingly, the police now routinely use Facebook as a tool to investigate and solve crimes, and targeted advertising on the site has been extremely successful because they can extract detailed information on its members, he added. \n\nFacebook members-- in case you didn't know, Coast to Coast AM has its own page, with nightly updates and lively commenting. \n\nStem Cells &amp; Heart Treatments\nFirst hour guests, researcher Christian Wilde and Dr. Nabil Dib talked about stem cell trials and regenerative medicine. More than 2,500 heart patients have received stem cell treatments, and the results are very promising in the early clinical trials, said Dr. Dib. The two also noted that stem cells are much more cost effective for cardiac patients than such treatments as a pacemaker or transplant. \n\n\nWebsite(s):\n-techonomy.com\n-myheartbook.com\n-heartsciencescenter.com\nBook(s):\n-The Facebook Effect\n-Miracle Stem Cell Heart Repair","torrent":{"xt":"urn:btih:2db67fc3de511f9dd0cda278ea0eb99c7bfea474","amp;dn":"Coast+To+Coast+Am+-+08-25-10+-+The+Facebook+Phenomenon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db67fc3de511f9dd0cda278ea0eb99c7bfea474","infoHashBuffer":{"type":"Buffer","data":[45,182,127,195,222,81,31,157,208,205,162,120,234,14,185,156,123,254,164,116]},"announce":[],"urlList":[]}}