{"title":"Maurice Ravel Piano Works Disc 2","uid":6480778,"size":87334448,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e6c5d70166735aa74a5034e764d47ca7329f5eb&amp;dn=Maurice+Ravel+Piano+Works+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tmhlmr","files":15,"time":1308506815,"description":"\nVlado Perlemuter (Kovno, 26 mei 1904 - GenÃƒÂ¨ve, 4 september 2002) was een Franse pianist.\n\nPerlemuter werd geboren in het huidige Litouwen en kwam met zijn ouder als zeer klein kind mee naar Frankrijk waar hij opgroeide en naar school ging. Hij studeerde aan het Conservatorium van Parijs piano en had les van Moritz Moszkowski en later ook van Alfred Cortot. Reeds op vijftienjarige leeftijd behaalde hij zijn conservatoriumdiploma. Zijn eindexamenspel was het muziekstuk Thema en variaties van de Franse componist Gabriel FaurÃƒÂ© die hoewel toen al praktisch doof aanwezig was bij de uitvoering.\n\nPerlemuter ontmoette in 1925 de componist Maurice Ravel en verdiepte zich uitputtend in alle solowerken die Ravel voor piano had geschreven samen met de componist zelf. Hierdoor werd hij ÃƒÂ©ÃƒÂ©n van de meest bekende en gerespecteerde uitvoerend musici van Ravels werk.\n\nZijn pianospel werd gekenmerkt door een omfloerste toonkleur en een zingend legato gecombineerd met een moeiteloos lijkend gemak van interpretatie. Zijn carriÃƒÂ¨re als uitvoerend musicus en docent was wereldwijd. Perlemuter maakte plaatopnamen van alle piano sonates van Wolfgang Amadeus Mozart, de complete pianowerken van Maurice Ravel en verder nog diverse werken van FrÃƒÂ©dÃƒÂ©ric Chopin, Ludwig van Beethoven, Felix Mendelssohn, Robert Schumann, Franz Liszt en FaurÃƒÂ©.\n\n(bron: nl.Wikipedia.org 19-06-2011)","torrent":{"xt":"urn:btih:2e6c5d70166735aa74a5034e764d47ca7329f5eb","amp;dn":"Maurice+Ravel+Piano+Works+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e6c5d70166735aa74a5034e764d47ca7329f5eb","infoHashBuffer":{"type":"Buffer","data":[46,108,93,112,22,103,53,170,116,165,3,78,118,77,71,202,115,41,245,235]},"announce":[],"urlList":[]}}