{"title":"STARGATE.SG-1.S06E13-16.SWESUB. -Lindoff.ISO","uid":5796336,"size":3094945792,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2fc8d9a3553f62dd147055bc47874de0253cf89c&amp;dn=STARGATE.SG-1.S06E13-16.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lindoff41","files":1,"time":1283072429,"description":"Season 6, Episode 13: Sight Unseen\n\nSG-1 brings back an Ancient device, the purpose of which is unknown. When Jonas \n\ntouched it the device activated. Upon reaching the SGC Jonas sees a large red \n\ninsect fly into a wall, but no one else can confirm his sighting. The SGC is put \n\ninto lockdown, but nothing is found. Jonas suspects that the Ancient device is \n\ncausing his hallucinations, but to his dismay it is set to be shipped to Area 51. \n\nWhen Teal'c and Jack see the bugs as well, General Hammond decides to let Jonas \n\ntake a crack at deciphering the Ancient text on the device.\n\t\nSeason 6, Episode 14: Smoke &amp; Mirrors\n\nSenator Kinsey is shot in the chest at a public event, killing him just before his \n\nparty's presidential nomination. Jack is arrested for the murder, and General \n\nHammond assigns the rest of SG-1 to uncover the truth.\n\t\nSeason 6, Episode 15: Paradise Lost\n\nFormer Colonel Harry Maybourne comes to Jack with a proposition: Jack gets him a \n\npresidential pardon and Harry shows them the advanced weapons cache that Simmons \n\nwas trying to get to. They go through with the deal, but Harry attempts to double \n\ncross SG-1. He manages to get through the portal leading to the cache, but with \n\none unexpected item, Jack. They find themselves in a field and Harry's zat is \n\nmissing. Jack, however, still has his P-90. Harry reveals that they are not at a \n\nweapons cache, but rather a utopia. He meant to live out the rest of his life \n\nthere and believes that there is no way back.\n\t\nSeason 6, Episode 16: Metamorphosis\n\nThe Russian SG team brings back a man who claims that his people are being \n\nexperimented on by Nirrti. SG-1 investigate where the experiments are conducted, \n\nwith the Russian SG team as backup. The inhabitants worship Nirrti as their god \n\nand savior from a terrible plague. SG-1 attempts to use the same device Nirrti \n\nused on the people to reverse the mutations, but the people turn on them at the \n\narrival of Nirrti.","torrent":{"xt":"urn:btih:2fc8d9a3553f62dd147055bc47874de0253cf89c","amp;dn":"STARGATE.SG-1.S06E13-16.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fc8d9a3553f62dd147055bc47874de0253cf89c","infoHashBuffer":{"type":"Buffer","data":[47,200,217,163,85,63,98,221,20,112,85,188,71,135,77,224,37,60,248,156]},"announce":[],"urlList":[]}}