{"title":"Autosport Magazine UK 09/09/2010","uid":5821468,"size":91786021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:318b91cfbde8b60aa06466305d74355bb8a9c739&amp;dn=Autosport+Magazine+UK+09%2F09%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1284076067,"description":"NEWS\n10 Hamilton's crusade. McLaren star needs to build points cushion at Monza\n12 Korea opportunities. Track christener says new venue will produce good race\n14 Brawn backs Schuey. Merc team chief to stand by beleaguered pal for 2011\nl7 David Coulthard column.\n18 Italian GP preview.\n24 Audi evaluates ALMS. German giant could return to US series with new R18\n26 WTCC aces lose patience. Latest stewards' calls prompt call for F1-type expert panellist\n28 BMW winding up Merc. DTM dilly-dallying irritates Stuttgart series stalwart\n3O BTCC Ford petrol link. Focus squad could ditch LPG\n32 Rallying to go live. WRC to try again for as-it-happens TV coverage\n\nREPORTS\n40 BTCC Knockhill. Shedden scores at home; Plato builds on points lead\n44 Knockhill supports. Foster-Jones breaks his duck\n46 Euro F3 Brands Hatch. More and more for Mortara\n48 DTM Brands Hatch. Better than all di Resta\n55 FR3.5 Hockenheim. Ricciardo and Guerrieri put Aleshin under pressure\n56 IndyCar Kentucky. Strategic win for Castroneves\n58 WTCC Oschersleben. Stealthy Priaulx looms large\n60 Formula 2 Oschersleben. Brilliant Stoneman's double\n62 Superleague Adria. Rigon stars for Anderlecht\n64 World of Sport. NASCAR; Indy Lights; Brazil V8s; Scandinavian Touring Cars; Formula Renault Euro\n\nFEATURES\n34 Mercedes in F1. The hangover has struck from Brawn's year of brilliance, but the team's leading figures believe a comeback is on for 2011\n66 AUTOSPORT 1000km. Preview to this weekend's long-distance sportscar classic at Silverstone\n68 McLaren AUTOSPORT BRDC Award. Vote for your favourite young charger of 2010\n\nSPORTS EXTRA\n85 Formula BMW back in UK. Young Guns dumps JKS in favour of junior warhorse\n86 Pyro eyes Carrera Cup. Top Clio team aims to broaden its programme\n90 Reports. Brands Hatch DTM supports; Cadwell Park MGCC; Donington Park Masters; Silverstone CSCC; Oulton Park BRSCC; Prescott hillclimb\n\nREGULARS\n100 Photo finish. Colin McRae's BTCC one-off, Knockhill, 1992\n102 Race of my life. Alain Prost, Mexican GP, 1990\n\nOCRd by Acrobat Pro 9.3.4\nThe cover page has links to the articles\n","torrent":{"xt":"urn:btih:318b91cfbde8b60aa06466305d74355bb8a9c739","amp;dn":"Autosport+Magazine+UK+09%2F09%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"318b91cfbde8b60aa06466305d74355bb8a9c739","infoHashBuffer":{"type":"Buffer","data":[49,139,145,207,189,232,182,10,160,100,102,48,93,116,53,91,184,169,199,57]},"announce":[],"urlList":[]}}