{"title":"Formigoni chieda scusa e si dimetta [Mp3 ITA] TNT Village","uid":6329014,"size":11318335,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:324513e6f27798560ce4bc34b0175bb2ebe38af3&amp;dn=Formigoni+chieda+scusa+e+si+dimetta+%5BMp3+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"l.diliberto","files":1,"time":1303171810,"description":"Formigoni chieda scusa e si dimetta [Mp3 ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=248534&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=248534&lt;/a&gt;\n\nConferenza stampa di Marco Cappato\nFirme: associazione a delinquere.\nFormigoni chieda scusa e si dimetta.\n\nFirme false in Regione - Il famoso listino bloccato di Roberto Formigoni, giÃƒÂ  noto per aver consentito l'elezione dell'ex igienista dentale Nicole Minetti al consiglio regionale della Lombardia, rischia adesso di ricevere nuove pesanti accuse. Secondo quanto raccolto dai giudici della Procura di Milano, infatti, circa 700-800 firme delle 3.800 che hanno permesso alla lista &quot;Per la Lombardia&quot; di Roberto Formigoni di partecipare alle ultime elezioni regionali (vincendole), sarebbero false. Per questo gli inquirenti hanno invitato a comparire nei prossimi giorni 10 consiglieri comunali e provinciali di Milano, verso i quali ipotizzano i reati di falso ideologico e falso in atto pubblico. I controlli che hanno portato all'individuazione delle firme false sono stati realizzati grazie a un'attenta perizia calligrafica, che ha prodotto quelle che i magistrati di Milano hanno definito &quot;prove granitiche&quot;.\n\nLa denuncia di Cappato - A dare il via alle indagini ÃƒÂ¨ stato il radicale Marco Cappato: &quot;Si tratta di una truffa elettorale - ha detto - realizzata attraverso un'attivitÃƒÂ  di falsificazione massiccia che non puÃƒÂ² che configurare il reato di associazione per delinquere contro i diritti civili e politici dei cittadini. Un'associazione per delinquere - ha insistito il radicale - che ÃƒÂ¨ stata coordinata da un responsabile che spetterÃƒÂ  alla magistratura individuare, senza limitarsi agli esecutori materiali&quot;. Non solo: per Marco Cappato non puÃƒÂ² essere sottostimata la posizione del governatore Roberto Formigoni, che &quot;ha mentito - ha dichiarato il radicale - sapendo di mentire. Per la parola tradita prima ancora che per il tipo di coinvolgimento, attivo o omissivo, nell'associazione a delinquere della truffa realizzata - ha notato Cappato - il presidente Formigoni si deve ora dimettere&quot;.\n\nLa replica del Pdl lombardo - Una richiesta, quella del capolista della Lista Bonino-Pannella a Milano, considerata irricevibile dal capogruppo del Pdl nel consiglio della Regione Lombardia, Paolo Valentini: &quot;Marco Cappato - ha detto - ÃƒÂ¨ in preda a una vera e propria ossessione, gli consigliamo di prendere un Valium. Invece di continuare a ripetere come un disco rotto le sue elucubrazioni, rispetti l'azione della magistratura e i suoi tempi e mediti sulle quattro sconfitte che ha giÃƒÂ  subito davanti al Tar e al Consiglio di Stato. Fortunatamente - ha concluso il pidiellino - non ÃƒÂ¨ Cappato che amministra la giustizia in Italia&quot;.\n\nMaria Saporito www.newnotizie.it\n &lt;a href=&quot;\nhttp://img192.imageshack.us/img192/1131/cappatovsformigoni.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img192.imageshack.us/img192/1131/cappatovsformigoni.png&lt;/a&gt;","torrent":{"xt":"urn:btih:324513e6f27798560ce4bc34b0175bb2ebe38af3","amp;dn":"Formigoni+chieda+scusa+e+si+dimetta+%5BMp3+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"324513e6f27798560ce4bc34b0175bb2ebe38af3","infoHashBuffer":{"type":"Buffer","data":[50,69,19,230,242,119,152,86,12,228,188,52,176,23,91,178,235,227,138,243]},"announce":[],"urlList":[]}}