{"title":"SpiderMan Shattered Dimensions [R.Free][Xbox360][English-Sub.Spa","uid":5799334,"size":7838695886,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:326c170d3bc2372b42c02a6fd77d4afa68fa77de&amp;dn=SpiderMan+Shattered+Dimensions+%5BR.Free%5D%5BXbox360%5D%5BEnglish-Sub.Spa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":4,"time":1283196551,"description":"Spider-Man: Dimensions es el nuevo videojuego de Spiderman basado en sus aventuras y que reproduce de manera fiel las diferentes caras de este complejo personaje de comic. Los jugadores podrÃƒÂ¡n conocer nuevos lugares nunca antes vistos en un videojuego de Spiderman, desde la exuberante jungla a desiertos polvorientos pasando por una moderna ciudad. El aclamado autor Dan Slott es el encargado de crear esta historia y llevar a los jugadores a intentar salvar la Tabla del Orden y el Caos que ha sido partida en pedazos y lanzada a varios universos paralelos, luchando contra algunos de los villanos favoritos de los jugadores.\n\nCaracterÃƒÂ­sticas:\nCuatro dimensiones, una historia: Spider-Man: Dimensions ofrece la posibilidad de jugar en cuatro universos paralelos.\nLa Fortaleza de los cuatro Spiderman: Los jugadores experimentarÃƒÂ¡n en cada nivel diferentes modalidades de juego gracias a los diferentes trajes de Spiderman.\nEn Amazing Spiderman los fans disfrutarÃƒÂ¡n con la lucha cuerpo a cuerpo en un escenario que rinde tributo a las historietas clÃƒÂ¡sicas de este superhÃƒÂ©roe. Mientras que en Spiderman Noir el jugador deberÃƒÂ¡ merodear en las sombras de un ambiente influenciado por el cine negro de los aÃƒÂ±os 30.\nLlevando el Spiderman tradicional a un nuevo nivel: Por primera vez en un juego de Spiderman los jugadores podrÃƒÂ¡n disfrutar de la perspectiva en primera persona en algunas de las batallas. Los jugadores se verÃƒÂ¡n inmersos en un ritmo frenÃƒÂ©tico de juego gracias a la variedad de escenarios, villanos y mÃƒÂºsica que forman Spider-Man: Dimensions. Los jugadores entrarÃƒÂ¡n en el mundo del gran cazador Kraven en Amazing Spiderman y se enfrentarÃƒÂ¡n a Goblin o Hammerhead en Spiderman Noir.\nVariedad para todos los fans: AdemÃƒÂ¡s de la variedad que aportan las cuatro dimensiones los jugadores encontrarÃƒÂ¡n en todos los escenarios nuevas habilidades, bonus y trajes para desbloquear.","torrent":{"xt":"urn:btih:326c170d3bc2372b42c02a6fd77d4afa68fa77de","amp;dn":"SpiderMan+Shattered+Dimensions+%5BR.Free%5D%5BXbox360%5D%5BEnglish-Sub.Spa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"326c170d3bc2372b42c02a6fd77d4afa68fa77de","infoHashBuffer":{"type":"Buffer","data":[50,108,23,13,59,194,55,43,66,192,42,111,215,125,74,250,104,250,119,222]},"announce":[],"urlList":[]}}