{"title":"Democracy Now - 11 may 2011","uid":6384054,"size":448822178,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:32f901506a199c0f59129f849eb993f93d885d46&amp;dn=Democracy+Now+-+11+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1305133860,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 11, 2011\n\n- NATO Continues Bombing of Tripoli\n- Bin Laden's Family Challenges Legality of Killing\n- Drone Attack Kills 4 in Pakistan; Attorney Preps Legal Challenge\n- Syrian Forces Shell Residential Areas\n- Obama Touts Immigration Reform Plan\n- Federal Court Blocks Utah Anti-Immigrant Law\n- California Teachers Launch &quot;State of Emergency&quot; Protests\n- Senate Dems Call for Repealing Oil Company Tax Breaks\n- Single-Payer Measure Introduced in Congress\n- Study: GOP Budget Plan Would Drop 44 Million From Medicaid\n- Japan Abandons Plan for New Nuclear Reactors\n- Mubarak Faces Extended Detention in Egypt\n- Flooding Hits Poor Areas of Memphis\n\n\nSpecial reports\n\n- Obama Calls for Immigration Reform Amidst Record Levels of Deportations\n\nOn Tuesday, President Obama visited the U.S.-Mexico border for the first time since his election in 2008 to deliver a major policy speech on comprehensive immigration reform. Meanwhile, Illinois Gov. Pat Quinn and 38 New York state lawmakers have asked to withdraw from Obama's flagship immigration enforcement program, Secure Communities, which has led to a record number of deportations. We get reaction from Ali Noorani, executive director of the National Immigration Forum, and Sunita Patel, staff attorney with the Center for Constitutional rights. &quot;This enforcement first, and reform later, approach is just not working. The states and Congress are losing patience at this point,&quot; Patel says. Acknowledging the political hurdle Obama faces in passing immigration reform with a divided Congress, Noorani notes, &quot;The President has executive authority to better prioritize his enforcement resources so that those who are causing real harm to our communities are the ones removed, not the students, not the families who are working hard.&quot;\n\n\n- &quot;A War on Civilians&quot;: Mexico's Drug War Draws Protests as Grueling Death Toll Grows\n\nA march against the U.S.-backed war on drugs drew 20,000 people into the streets of Mexico City on Sunday, calling attention to the country's gruesome drug war-related violence that has claimed more than 38,000 lives since Mexican President Felipe CalderÃƒÂ³n launched the campaign against drug traffickers and cartels in 2006. Congress has appropriated $1.5 billion for Mexico's drug war since 2008. The march began in the central Mexican state of Morelos, led by the Mexican poet Javier Sicilia, whose 24-year-old son was killed by gunmen earlier this year. We speak with Molly Molloy, an expert on the drug war and U.S.-Mexican border issues, and co-editor of the new book, &quot;El Sicario: The Autobiography of a Mexican Assassin.&quot; &quot;I believe it's a war on the Mexican people, carried out by the Mexican government,&quot; Molloy says.\n\n\n- &quot;Every 30 Minutes&quot;: Crushed by Debt and Neo-Liberal Reforms, Indian Farmers Commit Suicide At Staggering Rate\n\nA quarter of a million Indian farmers have committed suicide in the last 16 years-an average of one suicide every 30 minutes. The crisis has ballooned with economic liberalization that has removed agricultural subsidies and opened Indian agriculture to the global market. Small farmers are often trapped in a cycle of insurmountable debt, leading many to take their lives out of sheer desperation. We speak with Smita Narula of the Center for Human Rights and Global Justice at New York University Law School, co-author of a new report on farmer suicides in India.\n\n\n- Noam Chomsky: &quot;The U.S. And Its Allies Will Do Anything to Prevent Democracy in the Arab World&quot;\n\nSpeaking at the 25th anniversary of celebration of the national media watch group, Fairness and Accuracy in Reporting, world-renowned political dissident and linguist Noam Chomsky analyzes the U.S. response to the popular uprisings sweeping the Middle East and North Africa. &quot;Across the [Middle East], the overwhelming majority of the population regards the United States as the main threat to their interests,&quot; Chomsky says. &quot;The reason is very simple ... Plainly, the U.S. and allies are not going to want governments, which are responsive to the will of the people. If that happens, not only will the U.S. not control the region, but it will be thrown out.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:32f901506a199c0f59129f849eb993f93d885d46","amp;dn":"Democracy+Now+-+11+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f901506a199c0f59129f849eb993f93d885d46","infoHashBuffer":{"type":"Buffer","data":[50,249,1,80,106,25,156,15,89,18,159,132,158,185,147,249,61,136,93,70]},"announce":[],"urlList":[]}}