{"title":"Download Meter for Wi-Fi 3G EDGRS - reduce spending on mobile in","uid":5762194,"size":1081309,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:338895227e41b67775ca72586baf164703799ef8&amp;dn=Download+Meter+for+Wi-Fi+3G+EDGRS+-+reduce+spending+on+mobile+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KING_Ayub","files":4,"time":1281766111,"description":"\n[img]http://img94.imageshack.us/img94/5159/cooltext455930705.gif[/img]\n\n[img]http://img269.imageshack.us/img269/7896/screenshot012814198818c.jpg[/img] [img]http://img440.imageshack.us/img440/9036/screenshot112814198811c.jpg[/img]\n[img]http://img405.imageshack.us/img405/1918/screenshot21281419881ea.jpg[/img] [img]http://img180.imageshack.us/img180/9760/screenshot312814198820f.jpg[/img]\n[img]http://img295.imageshack.us/img295/5751/screenshot4128141988214.jpg[/img]\n\n[img]http://img52.imageshack.us/img52/9205/infosg.png[/img]\n[color=orange][b]Ready to get control of your spending on mobile Internet? Then it is time to get Download Meter, a new application to measure and track traffic - the amount of data your device transfers from and to the Internet while surfing websites, watchingchecking email, researching maps, or playing online games. \n\nMeasuring traffic allows you to control your expenses on your connectivity by not exceeding the limits of data you can transfer for free per your cell phone plan or traffic allowed by your WiFi plan. You can also estimate your needs in traffic before traveling abroad and estimate your expenses. \n\nThis application even allows users to define a monthly traffic limit. &quot;Daily&quot; and &quot;Weekly&quot; types of limit are also supported (use them if your plan gives you the same amount of free traffic every day or every week). It will also compute the amount of remaining free traffic for the current period (month or week). Additional features recommend how much free traffic can be used today by dividing the amount of free traffic remaining in the current month by the number of days remaining and using the result as a daily limit. The program will also display the percentage of free traffic consumed today and in the current month. The amount of traffic consumed today automatically resets every day in the early morning, and the amount of traffic consumed in the current month resets on a day defined as the beginning of the month.\n\nIn addition, this application allows you to create and operate any number of &quot;counters,&quot; which are an advanced way of tracking traffic beginning with a particular moment of time. Several counters can function simultaneously, be set on pause, or reset entirely and allow you to compute the amount of traffic consumed by a particular application or the traffic consumed at a given location. Counters are effective tools because you can, for example, account for traffic consumed by watchingall traffic consumed while you are at work, or even all traffic used by reading emails only on the weekends. Several special counters are available that make tracking traffic easier than ever.\nFeatures: \n- Works with any carrier (iPods are supported too!). Requires no login/password to your carrier's site. \n- Does not require Internet connection to get traffic usage statistics (works even in Airplane mode) because it gets information on traffic from the device, not a carrier; this means it won't cost you anything to view current traffic consumed, even while roaming in a location where traffic is very expensive. \n- Allows you to create and operate an unlimited number of &quot;counters,&quot; which are an advanced way of tracking traffic per application or by period of time. \n- Suggests daily traffic limit and computes the current day's traffic automatically. \n- Calculates remaining traffic for current month/week and day, displays traffic consumtion in percents, and notifies using different colors when limit is about to be exceeded soon or has already been exceeded. \n- Allows to adjust consumed traffic for today or this month/week to match traffic amounts reported by your carrier. \n- Stats on the screen are updated every second. \n- Measures traffic in real time with up to byte precision. \n- Separates traffic into incoming and outgoing, Wi-Fi traffic and mobile Internet traffic. \n- Includes a complementary introductory tour on the use of the application that is run on the initial start of the program. \n- This application is the only one that allows a user to measure WiFi traffic.\nVideo available on support page (or search for &quot;Download Meter&quot; on\n\n#6 Top Paid Utility in Germany in November.\n#3 Top Paid Utility in Italy in November.\n#12 Top Paid App in Italy in November.\n#1 Top Paid Utility and #3 Top Paid App in Russia in October.\n#2 Top Paid Utility and #10 Top Paid App in Greece in November.\n#9 Top Paid Utility in China and Portugal in November.\n#10 Top Paid Utility in UAE in November.\nWhat's new in Version 2.4\n* Current day limit was calculating incorrectly when limit type was set to Daily. Now it's fixed.\n\n* Added missing translation to word &quot;monthly&quot; in Settings screen.[/b][/color]\n[color=purple][b]* You will firstly have to Jailbreak your iphone, which installs Cydia. \n\n\n* Then to install cracked apps you will need to: \n\n* Go into Cydia on Iphone/Ipod touch\n\n* Go to manage, then sources\n\n* Add: (Http://) cydia.hackulo.us/\n\n* Next search for appsync (Mipatch will not work with 3.0) and install onto iphone\n\n* Next add the app to itunes\n\n* Sync your iphone to itunes and add the application\n\n JOB DONE [/b][/color]\n[img]http://img138.imageshack.us/img138/9931/coollogocom3072999443.png[/img]\n[img]http://img695.imageshack.us/img695/7097/6sdez7.gif[/img]\n[img]http://img690.imageshack.us/img690/2538/2s9d1cg.gif[/img]","torrent":{"xt":"urn:btih:338895227e41b67775ca72586baf164703799ef8","amp;dn":"Download+Meter+for+Wi-Fi+3G+EDGRS+-+reduce+spending+on+mobile+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338895227e41b67775ca72586baf164703799ef8","infoHashBuffer":{"type":"Buffer","data":[51,136,149,34,126,65,182,119,117,202,114,88,107,175,22,71,3,121,158,248]},"announce":[],"urlList":[]}}