{"title":"LOVERS GUIDE IGNITING DESIRE 1991 1080p BluRay QEBS AAC MP4-FASM","uid":6319330,"size":1550500586,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3493972258956518497c7ed4c5dca32783c82051&amp;dn=LOVERS+GUIDE+IGNITING+DESIRE+1991+1080p+BluRay+QEBS+AAC+MP4-FASM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":-1,"time":1302810646,"description":"Movie name ................: Lovers Guide - Igniting Desire (1991)\nMovie info.................: http://www.imdb.com/title/tt0164734/\nMovie Lenght ..............: 1:05:59\nFile size .................: 1.41GiB\nFile Container ............: MP4\nVideo Source ..............: BLURAY MPEG4 AVC\nVideo Format ..............: MPEG4 AVC HIGH PROFILE LEVEL 4\nVideo Aspect Ratio ........: 16:9\nVideo Attributes ..........: 23.976 fps 1920x1080 @ 2758 kbps\nVideo Commpresion Technique: Quality Enhancer Bitrate Squeezer 3.4\nVideo colour matrix .......: BT.709-5\nAudio1 Source .............: BluRay - DTS HD core 5.1\nAudio1 Format .............: AAC LC 5.1\nAudio1 Attributes .........: 321 kbps\nAudio1 Language ...........: English\nSubtitles .................: None\nDXVA Compatible ...........: YES\nFAT32 Compatible ..........: YES\nPS3 Compatible ............: YES\nIPHONE 4/IPAD Compatible ..: YES\nXBOX360 Compatible ........: Read below\nWDTV Compatible ...........: Read below\nWWW Streamable ............: YES\nStandalone players ........: Limited to h264 devices only\nSample Video...............: Included\n\nPlot:\nTwenty years after the original The Lovers' Guide exploded into the lives of the UK public, the ground-breaking guide is back with another no-holds-barred exploration of the pleasures of love-making. To mark the anniversary of the series that has brought adult sex advice firmly into the mainstream, the latest instalment has been created using cutting edge 3D technology as the next stop in the sexual revolution. Here the audience is engaged with a never-before-seen sense of intimacy and massively richer viewpoint. Now bigger, better and bolder than ever before, The Lovers' Guide 3D - Igniting Desire features the voices of Gemma Bissix (Eastenders, Hollyoaks, Dancing on Ice) and Jeremy Edwards (Hollyoaks, Holby City) and will take audiences to an altogether new level of love-making enlightenment. The Lovers' Guide 3D has been created by the original producers of The Lovers' Guide series--Robert Page and William Campbell--and filmed by the award-winning director Kenny Rye. \n\nSCREENS: &lt;a href=&quot;\nhttp://lookpic.com/c1/i2/3222/OD2SdPlE.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lookpic.com/c1/i2/3222/OD2SdPlE.png&lt;/a&gt;\n\nEncoders note: \nHigh quality version of this nice &quot;educational document&quot;.\n\nRegards to all encoders especially Big thanx to Atom, FLAWL3SS and FraMeSToR crew, my friends Filix,\nRok3r, Kempas, Stun, Askeen, Faolanscath and all who likes my work.\n\n1. All FASM releases were done by THE PEOPLE for THE PEOPLE, so if you think they are worthy share them anywhere you want,\nbut if you like the movie, show your gratitude to the creators by going to cinema or buying Bluray/DVD!\n\n2. UNFINISHED/SAMPLE movies HAVE synchro problems, full movies DON`T. This is the nature of highly compressed content. \nIf you have any problemms with your video player check &quot;Instruction for fixing your player problemms&quot; folder.\n\n3. Please COMMENT my work ONLY if you have actually seen it. If you LIKED this release - tell others about it.\nIf you didnt, leave a comment saying  why, so I can learn from your opinions and provide you with something better in the future.\nEverything here has been done with the reason, so if you do not understand something dont assume its done bad. Of course\nwe also make mistakes so any observation is welcome.\n\n4. I have found that XBox360 can play stereo AAC directly and 5.1 through WINDOWS media center extender. For more info read this forum: &lt;a href=&quot;\nhttp://www.avforums.com/forums/streamers-network-media-players/1107552-what-xbox-360-like-media-extender.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.avforums.com/forums/streamers-network-media-players/1107552-what-xbox-360-like-media-extender.html&lt;/a&gt;\n\n5. WDTV devices are causing so much problemms with AAC than its better for me to give you stright link to the disscussion regarding this: &lt;a href=&quot;\nhttp://wdtvhd.com/index.php?showtopic=23287&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wdtvhd.com/index.php?showtopic=23287&lt;/a&gt;\n\n6. These movies can be directly streamed through WWW using Adobe Flash Player version 9 or higher.\n\n7. The name FASM was derived from assembler efficiency. When you write something directly in assembler, it usually\nruns much faster and has smaller size, than the same thing written in C, Java etc. It also means FAchman SoofMan\n- founders of FASM \n\n8. FASM Quality Enhancer Bitrate Squeezer is h264 compression method optimized directly for lowbitrate HD contents.\nIt is constantly being improved,  each revision brings quality to a new level. Its efficiency over standard\nx264 encoding is explained by the same reasons as XVID encodes are better than DIVX3.\n\n9. FASM recommends IMGBURN for burning those files into DVD.\n\n10. Any subtitles made for different releases, but taken from the same source (Bluray) should also work with this release.\n\n11. AAC sound must be decompressed and send through HDMI or SPDIF as PCM. Please also note that if you do have video card with HDMI that\nmeans you do have two different sound cards. Please make sure you do send the sound to the correct one. Its quite different from AC3/DTS\nwhere you send commpressed sound directly from the source.\n\n12. FASM 540p releases will concentrate almost totally on size to keep it as low as possible and STEREO sound to allow play these directly on most devices possible (even on newer cellphones.). Almost because the quality will be better than you expect it to be at this size...\n\n13. FASM 720p releases will concentrate on the best balanced quality/size ratio, will introduce special Fullscreen effect (no black bar), including true HD quality of the video and special stereo AAC LC sound to retain surround effects on small size. Such encodes should work directly on XBOX.\n\n14. FASM 1080p releases will concentrate on quality, but the size will be low enough to fit below 4GiB limit and will contain AAC5.1 sound encoded to be almost transparent to source. The goal would be to create Rip with quality better than Bluray original itself (without guarranty that the size limit allows it).\n\n-------------------------------------------------------------------------------\nJoin us at irc.Prison.NET channel #thepiratebay.se or chit-chat or supporting reasons.\nOr Join our TPB Community Forum @ &lt;a href=&quot;\nhttp://forum.suprbay.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org&lt;/a&gt;\n-------------------------------------------------------------------------------\n\nKeep Seeding Please! Don't Hit and Go!\t\t\t\t\t","torrent":{"xt":"urn:btih:3493972258956518497c7ed4c5dca32783c82051","amp;dn":"LOVERS+GUIDE+IGNITING+DESIRE+1991+1080p+BluRay+QEBS+AAC+MP4-FASM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3493972258956518497c7ed4c5dca32783c82051","infoHashBuffer":{"type":"Buffer","data":[52,147,151,34,88,149,101,24,73,124,126,212,197,220,163,39,131,200,32,81]},"announce":[],"urlList":[]}}