{"title":"The Hidden (1987) -Hyperdrive25","uid":6334529,"size":520538694,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3522000cdc9f9c763a5cc129d03e98ef7be85df6&amp;dn=The+Hidden+%281987%29+-Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":5,"time":1303414208,"description":"          THE HIDDEN 1987 DVDRIP + ENG SUBS AND THEATRICAL TRAILER\n          --------------------------------------------------------\nThe Hidden is a 1987 science fiction film from New Line Cinema. The film was written by Jim Kouf (credited as Bob Hunt) and directed by Jack Sholder. The cast featured Kyle MacLachlan and Michael Nouri with supporting roles by Clu Gulager as Nouri's character's superior and Chris Mulkey, Ed O'Ross, Clarence Felder, and Claudia Christian as the alien antagonist's human hosts. Larry Cedar of The Crazies and Twilight Zone: The Movie also co-star as one of Nouris characters colleagues.\n\nPlot:\n-----\nA murderous alien master criminal and a master of disguise from outer space arrives on Earth and begins to inhabit human bodies, using them as hosts to disguise itself so that it can move around undetected. The creature likes to commit violent crimes, such as armed robbery and carjacking, and is willing to kill anyone that gets in its way, including children and law enforcement officers. It also seems to enjoy driving Ferrari cars at reckless speeds and listens to loud heavy metal music, which leads to a confrontation with the police after it commits a bank robbery, killing five guards at the bank, and mowing down two civilians whilst trying to escape. The police officer in charge of the investigation, Sgt. Thomas Beck (Nouri), is baffled when the suspect will not fall after being wounded several times in a shoot-out. In the process the creature uses up its human host body (Chris Mulkey), leaving a corpse, and eventually moves on to its next victim with a record of poor health (William Boyett) while its host dies in the hospital after sustaining multiple fatal injuries during the shoot-out with the police. This creature commits a series of murders in Los Angeles while jumping from body to body (including a stripper (Christian), a dog, Beck's partners and closest friends Lt. John Masterson and Cliff Willis (Felder and O'Ross), and eventually a senator (John McCann), leaving the police department perplexed. In the process the creature transits from a small-time crook to a serial killing hitman up to a full-time political terrorist, scheming from petty thefts to a U.S. government takeover. Arriving on the scene is FBI agent Lloyd Gallagher (MacLachlan), who is actually an alien policeman inhabiting the body of Robert Stone, Gallagher's friend (there was a real Agent Gallagher, albeit deceased; the alien has taken the name and identity of Gallagher but the body of Stone; Gallagher and Stone had been hunting when a forest fire killed the real Gallagher).\n\n...................................................................................\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. \nJust burn the MP4 files and the subtitle file onto a CD using Nero or Ashampoo Burning Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!**********************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\nPS. PLEASE ADD A COMMENT. :)","torrent":{"xt":"urn:btih:3522000cdc9f9c763a5cc129d03e98ef7be85df6","amp;dn":"The+Hidden+%281987%29+-Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3522000cdc9f9c763a5cc129d03e98ef7be85df6","infoHashBuffer":{"type":"Buffer","data":[53,34,0,12,220,159,156,118,58,92,193,41,208,62,152,239,123,232,93,246]},"announce":[],"urlList":[]}}