{"title":"The Saxon Chronicles","uid":6316870,"size":966512283,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:35b783431c486371e94c033954db9c3a93172b68&amp;dn=The+Saxon+Chronicles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"donk1664","files":254,"time":1302735308,"description":"Here are the first 3 audio books in the Saxon Chronicle series of books by Bernard Cornwell, the creator of Sharpe.\n1.\tThe Last Kingdom (Read by Jamie Glover)\n2.\tThe Pale Horseman (Read by Tom Sellwood)\n3.\tLords of the North (Read by Tom Sellwood)\n\nThese tell the tale of Alfred the Great and his descendants through the eyes of Uhtred, an English boy born into the aristocracy of 9th century Northumbria, who is captured by the Danes and taught the Viking ways. The stories follow his travels and battles as he comes to struggles with his conscience and divided loyalties between those who raised him and his respect and burgeoning friendship of the embattled English King Alfred.\nThe series is, as usual from Cornwell, a brilliant worked tale of divided loyalties and desperate heroism. Filled with a excellently brought to life range of characters from Vikings to British kings in their Cornish fortresses, from political but passionate priests to enduring fishermen and farmers desperately striving to survive as the battle sweeps over them. Uhtred and Alfred, Vikings and Saxons, are a winning combination for Bernard Cornwell. \nFormat: MP3\nBit Rate: 64kps rate\nChapters: Yes\nQuality: Good-Excellent\nCover Art: Yes\n\nAll in all good quality audio books, perfect for listening on your MP3 player on the daily commute.\n","torrent":{"xt":"urn:btih:35b783431c486371e94c033954db9c3a93172b68","amp;dn":"The+Saxon+Chronicles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b783431c486371e94c033954db9c3a93172b68","infoHashBuffer":{"type":"Buffer","data":[53,183,131,67,28,72,99,113,233,76,3,57,84,219,156,58,147,23,43,104]},"announce":[],"urlList":[]}}