{"title":"The Boppin' Kids - The Ultimate Worst Of '85-'90 (2008) 320","uid":6368320,"size":89249828,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35b719b1087962f97552a53d207dd2ded7205b52&amp;dn=The+Boppin%5C%27+Kids+-+The+Ultimate+Worst+Of+%5C%2785-%5C%2790+%282008%29+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1304586739,"description":"The Boppin' Kids\nThe Ultimate Worst Of\n1985-1990 (2008)\n\n\n\nIn 1984 the BoppinÃ‚Â´Kids, still in their teens, started as a visibly underage rockabilly trio. Playing wild rockÃ‚Â´nÃ‚Â´roll sessions after school in their hot hot hot hometown, in Sicily, Italy. Following a few school gigs and some hiccups with the legal system, in Ã‚Â´86 the band signed up with Rock 86/Polygram Rec and their first album 'Go wild' immediately entered the national charts with the much celebrated 'Tainted Love'. Radio, press and national TV recognized their talent and contributed to spread the Boppin Kids mania around. The Kidz of course attracted the more hardcore rockÃ‚Â´nÃ‚Â´roll crowd, but strangely enough, they were also saluted as a teen idol band by their more mainstream younger followers. Fans started to come from everywhere to see their show and never got disappointed. The shows were always wild, raw and outrageous and the bandÃ‚Â´s live act was labelled as an authentic 'earthquake'!!! The Kids used to appear on stage bare-chested playing and furious tunes, brilliant guitar sounds and a 'master blaster slap-bass, screaminÃ‚Â´ and jumpinÃ‚Â´ all over the stage. The Kids loved violation and stretching to the utmost the sounds of many glorious artists, from Johnny Cash, Curtis Gordon, the Sonics, Hasil Hadkins to Motorhead, Tommy Steel and the Meteors, mixing together rockÃ‚Â´nÃ‚Â´roll, rockabilly, gothic, psychobilly, punk, surf influences and 60Ã‚Â´s garage into agalactic 100% Italian cocktail! In the 80s European climate of rockabilly revival the BoppinÃ‚Â´Kids found themselves pushed to fame, with over 200 gigs a year across the country and were turned overnight into a huge and fast success phenomenon?  Too fast?  Too furious?? With the 1987 EP 'Still rockin' and the 1989 album 'Just for fun', their records were played all over Europe, and even in Japan! The Stray Cats made their 'first and only' Italian show in 1989 at the Rolling Stone in Milano and The Boppin Kids were special guests with the Guana Bats. The BK also supported many other international acts, such as Mano Negra, the Pogues, the Cramps, Tav Falco, Violent Femmes, the Meteors, touring until 1990. In 1991 after 7 years of recording, heavy touring across the world and equally heavy dinking, the 3 'rude boys' finally split up in 1991. Following the BK adventure, Boppin Orazio Grillo, band founder, re-invented himself as Brando, starting a solo career as musican and producer.\n\nIn February 2008, having been away from the rockinÃ‚Â´ scene for 20 years, the Boppin' Kids decide it was the right time to come back, with a new double bass player and a brand new album: 'Last Train to Hell' coming soon! The BoppinÃ‚Â´Kids played the Psychobilly Festival at  Pineda del Mar, to announce theire official return to the world!\n        \n\n\nFormat:\t\t\tMp3\nBit Rate:\t\t320 CBR\nContains:\t\tAlbum Art/ID Tags\nM3U Playlist:\t\tYes\nGenre:\t\t\tRockabilly\n\n\n\nAudio-Info\n\n01.Feel So Lonely\n02.Crazy Lovin'\n03.Go Wild\n04.Castle Of Death\n05.Little Little Girl\n06.Fire In My Soul\n07.Rebel Without A Cause\n08.Tainted Love\n09.Invisible Life\n10.Horks\n11.Don't You Make Me Cry\n12.Something Else\n13.Love Like A Stone\n14.Lonesome Train\n15.Do You Love Me\n\n\n\n\n\n\n\n\n\n\n             ****Support the artists &amp; buy it if you like it.****\n\n\n                 ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n","torrent":{"xt":"urn:btih:35b719b1087962f97552a53d207dd2ded7205b52","amp;dn":"The+Boppin%5C%27+Kids+-+The+Ultimate+Worst+Of+%5C%2785-%5C%2790+%282008%29+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b719b1087962f97552a53d207dd2ded7205b52","infoHashBuffer":{"type":"Buffer","data":[53,183,25,177,8,121,98,249,117,82,165,61,32,125,210,222,215,32,91,82]},"announce":[],"urlList":[]}}