{"title":"Happy Gilmore(1995)DVDRip.AC3(ENG)-DROCK","uid":6390061,"size":732676096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:384f76070e319540adcc8af4ccade0f76c4e1abb&amp;dn=Happy+Gilmore%281995%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1305328201,"description":"Adam Sandler's second popular starring vehicle after Billy Madison is a goofy lowbrow paean to golf, hockey, and the comic hysterics of its childlike star. In Happy Gilmore, Sandler plays the title character, a raw, determined, but ultimately untalented hockey player who keeps trying out for the pros. When Happy discovers his grandmother (Frances Bay) will lose her home if she doesn't fork over 270,000 dollars to the IRS, he tries to figure out how he can possibly scrounge up the cash. An idea strikes during a game of one-upmanship with a couple furniture movers stripping his grandmother's home: On his first-ever swing, he drives a golf ball farther than the movers have ever seen. Before long, he has transplanted the foul-mouthed, aggressive persona of the hockey rink to the links, winning an amateur tourney that earns him a spot on the pro tour. Throttling everyone from a helpless caddy to game show host Bob Barker during the course of his 90-day quest to amass prize money, Happy also wins the sport a legion of new fans with his in-your-face style. Guiding him on his quest is a whimsical retired pro who lost his hand to an alligator (Carl Weathers) and an attractive public relations woman charmed by Happy's antics (Julie Bowen). Opposing him, however, is sneering hotshot Shooter McGavin (Christopher McDonald), who will do anything to win his championship jacket and see Happy fail. \n\nRipped with Autogk.\n\nLength: 1 Hour 32 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:384f76070e319540adcc8af4ccade0f76c4e1abb","amp;dn":"Happy+Gilmore%281995%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"384f76070e319540adcc8af4ccade0f76c4e1abb","infoHashBuffer":{"type":"Buffer","data":[56,79,118,7,14,49,149,64,173,204,138,244,204,173,224,247,108,78,26,187]},"announce":[],"urlList":[]}}