{"title":"Democracy Now - 10 sep 2010","uid":5823176,"size":456626957,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3856cfe860d50aad2b9b5ededf15caa76b65e6b7&amp;dn=Democracy+Now+-+10+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1284150443,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 10, 2010\n\n- Judge: &quot;Don't Ask, Don't Tell&quot; Is Unconstitutional\n- U.S. Troops Accused of Killing Afghans For Fun, Collecting Fingers As Trophies\n- Florida Pastor Rethinks Suspension of &quot;Burn A Koran Day&quot;\n- Iran To Release One of Detained American Hikers\n- Court Rules Against Anti-Immigrant Law in Penn. City\n- Pentagon Considers Buying and Destroying Copies of Afghan War Memoir\n- U.S. Carries Out Four More Drone Strikes in Pakistan\n- 14 Die in Attack on Somali Airport; 230 Dead Over Past 2 Weeks\n- Rape Survivors in the Congo Recall Horror\n- Univision Tops National TV Ratings For Key Demographic\n- Peace Rallies and Interfaith Vigils Planned For Sept. 11 Anniversary\n\n\nSpecial reports\n\n- Why is Oil Giant BP Helping Develop California Schools Environmental Curriculum?\n\nShould an oil giant responsible for the worst spill in US history play a role in what public school children learn about the environment? Well if you're in California, there's a good chance they will. BP has helped develop the new environmental curriculum for California's public schools. The curriculum will be taught to over six million pupils in some 1,000 districts. BP employees were part of a state-appointed team that crafted the program's &quot;guiding principles.&quot;\n\n\n- Arianna Huffington on Third World America: How Our Politicians Are Abandoning The Middle Class And Betraying the American Dream\n\nOne out of every six Americans are in government anti-poverty programs. More than 50 million Americans are in Medicaid, forty million receive food stamps and 10 million receive unemployment benefits. The prospects for a speedy recovery from the Great Recession appear dim. We speak with Arianna Huffington, co-founder and editor-in-chief of the Huffington Post about her latest book, Third World America\n\n\n- In Landmark Ruling, Judge Rules 'Don't Ask Don't Tell' Policy is Unconstitutional\n\nA federal judge has ruled the military's &quot;don't ask, don't tell&quot; policy toward gay and lesbian members of the military is unconstitutional. Judge Virginia Phillips said she will issue an injunction that will halt the enforcement of the policy that allows gay men and lesbian to serve in the armed forces, as long as they do not disclose their orientation and do not engage in homosexual acts.\n\n\n- Pakistan Flood Victims Tell of Suffering, Unfolding Disaster in Southern Sindh Province\n\nPakistan is still reeling from the worst floods in its history. Some 21 million people have been affected even as the flooding continues. Forty villages were submerged in the past few days and a 50 foot breach in an embankment this morning has sent flood waters surging towards three more towns. Independent journalist Madiha Tahir was in the flood-ravaged Sindh province last week and filed this report from Sukkur.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3856cfe860d50aad2b9b5ededf15caa76b65e6b7","amp;dn":"Democracy+Now+-+10+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3856cfe860d50aad2b9b5ededf15caa76b65e6b7","infoHashBuffer":{"type":"Buffer","data":[56,86,207,232,96,213,10,173,43,155,94,222,223,21,202,167,107,101,230,183]},"announce":[],"urlList":[]}}