{"title":"Red Riding Hood 2011 BluRay With Greek Sub","uid":6480883,"size":8207777201,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3864d7d2ef71778d8c516920bdc5aa4ff599852b&amp;dn=Red+Riding+Hood+2011+BluRay+With+Greek+Sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blaxos","files":2,"time":1308510238,"description":"Valerie (Amanda Seyfried) is a beautiful young woman torn between two men. She is in love with a brooding outsider Peter (Shiloh Fernandez), but her parents have arranged for her to marry the wealthy Henry (Max Irons). Unwilling to lose each other, Valerie and Peter are planning to run away together when they learn that Valerie's older sister has been killed by the werewolf that prowls the dark forest surrounding their village. For years, the people have maintained an uneasy truce with the beast, offering the creature a monthly animal sacrifice. But under a blood red moon, the wolf has upped the stakes by taking a human life. Hungry for revenge, the people call on famed werewolf hunter, Father Solomon (Gary Oldman), to help them kill the wolf. But Solomon's arrival brings unintended consequences as he warns that the wolf, who takes human form by day, could be any one of them. As the death toll rises with each moon, Valerie begins to suspect that the werewolf could be someone she loves. Panic grips the town as Valerie discovers that she has a unique connection to the beast-one that inexorably draws them together, making her both suspect...and bait.\n\n\nPG-13, 2 hr.\n\nHorror, Romance\n\nDirected By:Catherine Hardwicke\n\n\nIn Theaters: Mar 11, 2011 Wide\n\nOn DVD: Jun 14, 2011\n\nUS Box Office:$37.7M\n\nWarner Bros.\n","torrent":{"xt":"urn:btih:3864d7d2ef71778d8c516920bdc5aa4ff599852b","amp;dn":"Red+Riding+Hood+2011+BluRay+With+Greek+Sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3864d7d2ef71778d8c516920bdc5aa4ff599852b","infoHashBuffer":{"type":"Buffer","data":[56,100,215,210,239,113,119,141,140,81,105,32,189,197,170,79,245,153,133,43]},"announce":[],"urlList":[]}}