{"title":"Katy Perry - Waking Up In Vegas (Live-MTV Unplugged)(2nafish)","uid":5760081,"size":163758084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:39cdc75c4dd258023766b6d28b19a7d5a38fb0bf&amp;dn=Katy+Perry+-+Waking+Up+In+Vegas+%28Live-MTV+Unplugged%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1281698351,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Waking Up in Vegas&quot; is a song by American singer-songwriter, Katy Perry taken as the fifth and final single off her debut album, One of the Boys. It was written by Katy Perry, Desmond Child and Andreas Carlsson. It is produced by Greg Wells  and co-produced by Perry. Wells is credited with playing all the instruments on the song. It was officially released to US radio stations on April 21, 2009 (2009-04-21). The song made it to #9 on the Billboard Hot 100, making it Perry's third single to reach the top 10.\n\nKaty Perry performed &quot;Waking Up in Vegas&quot; on Later With Jools Holland in March 2008. She was also a guest on Ant and Dec's Saturday Night Takeaway in March 2009 where she performed &quot;Waking Up in Vegas&quot; instead of her then-current single, &quot;Thinking of You&quot;. which had been released that month. She performed on a Las Vegas-themed stage with her backing band dressed as Elvis Presley. The single was released to Australian radio on March 23, where it became the fourth most added song in its release week. Perry performed the song on American Idol  on May 13, 2009. In the performance she was dressed in an Elvis-themed outfit and a cape emblazoned with Adam Lambert's name on it. The video stars &quot;Grandma's Boy&quot; actor, Joel David Moore. Perry performed the song on July 24, 2009 on NBC's &quot;Today&quot; show in New York's Rockefeller Plaza.\n\nThe song debuted on the UK Singles Chart at number 107 following her performance on Ant and Dec's Saturday Night Takeaway, and peaked at number nineteen on the UK Singles Chart. In the US, it debuted at number sixty five on the Billboard Hot 100, her highest debut. Following her performance on American Idol, the song jumped to number thirteen and remained in the top fifteen for the following three months, peaking at number nine. &quot;Waking Up In Vegas&quot; also went on to become Perry's second number one hit on Mainstream Top 40, matching the airplay success of her first two singles. In Canada, the song was driven all the way to number five and then number two thanks in part to her performance on Idol, but also due to increasing sales and airplay. On the Irish Singles Chart it peaked at number eight. Ultimately, the song's success was considered a rebound for Perry after &quot;Thinking of You&quot; failed to ignite the charts. The single also helped OneItalic text of the Boys return to the top 50 of the Billboard 200  albums chart. &quot;Waking Up In Vegas&quot; was the 33rd most purchased song on iTunes in the US during 2009. As of June 16, 2010 the song has sold 1,768,000 copies in the U.S.\n\nOne of the Boys is the second studio album by American singer-songwriter Katy Perry and her major-label  debut. Her change in record label and adoption of a pseudonymous surname accompanies a notable shift from the Christian gospel rock of her self-titled debut album. The album was released in the United States and Canada on June 17 2008 and has sold over 7 million copies worldwide up to June 2010. The album features the Billboard Hot 100 number one single &quot;I Kissed a Girl,&quot; top 3 single &quot;Hot n Cold,&quot; top 10 single &quot;Waking Up in Vegas&quot;, and top 30 single &quot;Thinking of You&quot;. The album has been certified platinum by the RIAA. The album has earned Perry two Grammy nominations.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:39cdc75c4dd258023766b6d28b19a7d5a38fb0bf","amp;dn":"Katy+Perry+-+Waking+Up+In+Vegas+%28Live-MTV+Unplugged%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39cdc75c4dd258023766b6d28b19a7d5a38fb0bf","infoHashBuffer":{"type":"Buffer","data":[57,205,199,92,77,210,88,2,55,102,182,210,139,25,167,213,163,143,176,191]},"announce":[],"urlList":[]}}