{"title":"Democracy Now - 13 apr 2011","uid":6316137,"size":451634023,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3aec1ea7348c697546d45f28deae0dc2ecf20115&amp;dn=Democracy+Now+-+13+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1302712087,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 13, 2011\n\n- Japan Claims Radiation Levels Decreasing\n- Fukushima Residents Protest TEPCO\n- Egypt Detains Mubarak, Sons in Corruption Probe\n- Rebels Attend Libya Meeting in Qatar\n- Obama to Unveil Deficit Plan\n- Protests Continue in Yemen; 7 Killed in Clashes\n- Obama to Address Mideast Popular Uprisings\n- Detained Blogger Dies in Bahrain\n- Syrian Forces Raid Village, Arrest 200\n- Ivory Coast Generals Back Ouattara\n- Mass Grave Toll Grows in Mexico\n- Allende Family Requests Exhumation\n- Kansas Enacts New Abortion Restrictions\n\n\nSpecial reports\n\n- Expert: Despite Japanese Gov't Claims of Decreasing Radiation, Fukishima a &quot;Ticking Time Bomb&quot;\n\nThe Japanese government is trying to calm fears about radiation levels and food safety in the region around the heavily damaged Fukushima Daiichi nuclear power facility, even as it has raised the severity rating of the crisis to the highest possible level. &quot;Radiation is continuing to leak out of the reactors, the situation is not stable at all,&quot; says Dr. Michio Kaku, professor of theoretical physics at the City University Of New York and the City College of New York. &quot;The slightest disturbance could set off a full scale melt down at three nuclear power stations-far beyond what we saw at Chernobyl.&quot;\n\n\n- Dr. Michio Kaku on &quot;Physics of the Future: How Science Will Change Daily Life by 2100&quot;\n\nDr. Michio Kaku, a Japanese-American theoretical physicist and best-selling author, joins us to talk about his new book, Physics of the Future: How Science Will Change Daily Life by 2100. Kaku outlines a future in which cars will be driven by computers, the aging process will be frozen, and the Internet will be surfed in contact lenses. &quot;You will blink and you will see biographies of people that will emerge so you will know who you are talking to. Do you remember the movie &quot;Terminator?&quot; We are going to have that capability. Also, our contact lens will translate what people say into English as you talk to them. You will know always who you are talking to and what they are saying,&quot; says Kaku.\n\n\n- D.C. Mayor Vincent Gray Arrested Protesting Dem-GOP Budget Deal\n\nWashington, D.C. Mayor Vincent Gray and several members of the D.C. Council were arrested Monday when they sat down in the middle of a key intersection in the nation's capital, blocking traffic to protest &quot;riders&quot; in the federal budget deal between Democrats and Republicans. The proposed budget reimposes a Republican-backed ban on the District spending its own money to provide abortions to low-income women. The District would also be prevented from spending city money on needle exchange programs regarded as crucial to curbing the spread of HIV in Washington, D.C., where the disease is considered an epidemic. We speak to Mayor Gray about why he took to the streets in protest.\n\n\n- Journalists, Activists Targeted as Honduran Repression Grows\n\nWorkers, students and activists have held a month-long general strike in Honduras to protest repression by the government of President Porfirio Lobo. Lobo came to power following elections under the regime of Roberto Micheletti, who seized power in a violent military coup against democratically elected President Manuel Zelaya in June 2009. In 2010, Honduras became the most dangerous country in the world for journalists, with March being the deadliest month on record. We speak to Gerardo Torres, an independent journalist and a leading member of the National Front of Popular Resistance in Honduras.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:3aec1ea7348c697546d45f28deae0dc2ecf20115","amp;dn":"Democracy+Now+-+13+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aec1ea7348c697546d45f28deae0dc2ecf20115","infoHashBuffer":{"type":"Buffer","data":[58,236,30,167,52,140,105,117,70,212,95,40,222,174,13,194,236,242,1,21]},"announce":[],"urlList":[]}}