{"title":"BitDefender AntiVirus Pro 2011 [theLEAK]","uid":6369495,"size":257173016,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3bf8409d3cfce30ca9eaae99c065f8c6a93ab9d8&amp;dn=BitDefender+AntiVirus+Pro+2011+%5BtheLEAK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"theLEAK","files":2,"time":1304629151,"description":"\nBitDefender Antivirus Pro 2011 - Professional anti-virus program with features designed for your computer more secure. The program provides advanced proactive protection against viruses, spyware, phishing attacks and identity theft, without slowing down your computer.\n\nThe new version of antivirus BitDefender Antivirus Pro 2011 extended features fast scanning, access to training videos, the output of intelligent tooltips, creating shortcuts on the toolbar, warning about the potential dangers of pages displayed in search results.\n\n\n\nThe main components of BitDefender Antivirus Pro 2011:\n\n* Antivirus and antispyware\n* Protection against phishing\n* Chat Encryption\n* Fast scanning\n* Family Network Protection\n* Checking Smart Scan\n* Planner Smart Schedule\n* Help System Smart Help\n* Smart Sense\n* Personal Toolbar\n\n\n\n\nKey features BitDefender Antivirus Pro 2011:\n\n* Proactive protection from common and new viruses and malicious programs.\n* Filter visited web-pages to protect against phishing.\n* Detect and remove hidden threats such as rootkits.\n* Update the antivirus database every hour.\n* Reducing the risk of identity theft and diversion of other confidential information via e-mail, IM, Facebook, other sites that monitor online activity.\n* Information for users with knowledge bases, help files, video content libraries.\n* Automatic activation module Game, Laptop or Silent in order to prevent disengagement from the Internet, extending battery life and reduce the load on the system.\n* Use the definition of an interface configuration choices basic, medium or expert settings.\n* Provide proposals for protecting the system while being a user to a dangerous Internet environment.\n\n\n\n\nNew BitDefender Antivirus Pro 2011:\n\n* Fast system scan. Module Quick Scan uses cloud data processing technology, which facilitates rapid identification and repel attacks, new and unknown viruses.\n* Check the search results. With BitDefender Antivirus Pro 2011 to learn about the potential dangers of certain sites can be when viewing search results. The system indicates which resources are infected with spyware or other malicious software.\n* visual images. The user is available for immediate assistance through the training video that explains step by step how to configure BitDefender Antivirus Pro 2011.\n* Creating shortcuts. The program allows you to create your own toolbar of labels frequently used functions.\n* Conclusion of intelligent prompts. In response to recent action, the system provides personalized suggestions and warnings.\n\n\n\n\n\nInstruction:\n\n1) Install\n2) If ask a serial number, enter one of the following keys -\n\n6FAF3688CA2CAF26D0FE\nF36F53A497A60831AEA7\n5B260E6EBDC10010F69F\n2B79D18819C527F9E195                                                    \n6FAF3688CA2CAF26D0FE \n\n\n\n\n\n\n\n\n\nAny problem during or after the installation, comment below.\n\n-theLEAK team\n\n","torrent":{"xt":"urn:btih:3bf8409d3cfce30ca9eaae99c065f8c6a93ab9d8","amp;dn":"BitDefender+AntiVirus+Pro+2011+%5BtheLEAK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bf8409d3cfce30ca9eaae99c065f8c6a93ab9d8","infoHashBuffer":{"type":"Buffer","data":[59,248,64,157,60,252,227,12,169,234,174,153,192,101,248,198,169,58,185,216]},"announce":[],"urlList":[]}}