{"title":"An Introduction to Indian Philosophy","uid":6502319,"size":1024045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d61c23dfd76fec4d2fa4da700064e47b442d364&amp;dn=An+Introduction+to+Indian+Philosophy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1309291498,"description":"An Introduction to Indian Philosophy by Christopher Bartley\nContinuum | 2011 | ISBN: 1847064493 | English | 256 pages | PDF | 1.00 MB\n\nAn Introduction to Indian Philosophy is the definitive companion to the study of Indian philosophy. The book offers an accessible and comprehensive introduction to all the major philosophical concepts and issues in Indian thought. Ideal for undergraduate students the book is written and structured to reflect as closely as possible the way the subject is taught and studied. The book offers lucid coverage of Indian philosophy and breaks new ground, considering the latest directions in this growing area of philosophical interest. The book describes the various relationships and disputes between Indian traditions of thought in a chronological framework. All the major philosophical schools are covered. Key topics and controversies are illustrated by annotated translations of primary sources that are otherwise difficult to access. Christopher Bartley's rigorous analysis is supplemented by useful study features, including key examples from philosophical writing, summaries of core concepts, study questions, and guides to further reading.","torrent":{"xt":"urn:btih:3d61c23dfd76fec4d2fa4da700064e47b442d364","amp;dn":"An+Introduction+to+Indian+Philosophy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d61c23dfd76fec4d2fa4da700064e47b442d364","infoHashBuffer":{"type":"Buffer","data":[61,97,194,61,253,118,254,196,210,250,77,167,0,6,78,71,180,66,211,100]},"announce":[],"urlList":[]}}