{"title":"EastEnders 21042011","uid":6334707,"size":178782208,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3eef0269ea2f63edf42f64c2da98b8d7359f7d7a&amp;dn=EastEnders+21042011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"darrenh2009","files":1,"time":1303419792,"description":"SUPER FAST UPLOAD ENJOY!!!\nUPLOADED 2 MINS AFTER TV SHOWING \n\n\nWhitney pays a visit to Pat's house for a talk with Ricky and Carol at their request. However, things don't go well as Whitney is defensive amid their concerns for her. Soon afterwards, things get worse as Ricky reads the interview that Whitney has given to the Walford Gazette. An upset Whitney insists that she was tricked by the reporter and that he took her words out of context. As tensions rise, Whitney storms out of the house. Later, she tries to ask Mr Lister about her stall, but he brushes her off. As the day continues, though, Lister takes pity on Whitney and invites her to lunch at The Vic, where he finally agrees to let her have the stall back.\n\nLister starts to get drunk at the pub and informs Whitney about how his life is miserable. Whitney comforts him but when Janine spots this, she's concerned and brands Lister a pervert. Ricky walks in on the heated scene and tries to drag Whitney home with him, but she runs off. Later, Ricky visits Whitney at Dot's and reprimands her over the interview and for getting drunk with Lister. When Whitney reminds him that he is not her father, Ricky hits back by saying that he's glad he's not. Ricky then tells Dot that he's had enough of Whitney and she can throw her life away if that's what she wants.\n\nCharlie reveals to Kat that he has news and he is engaged!\nMeanwhile, Jack asks Alfie whether the name on the baby's headstone can be changed, so Alfie agrees to talk to Kat about it and tells Jack to come back later. At the same time, Charlie has some happy news for Kat as he reveals that he's engaged. Later, Jack arrives at the pub and sees everyone toasting Charlie, and Kat and Alfie looking happy with Tommy. An upset Jack turns to leave, but Alfie spots him and realises that he's forgotten to ask Kat about the headstone. As the day draws to a close, Alfie realises that Kat is still struggling to cope with the strange situation but he promises that they'll get through it together.\n\nRoxy and Michael sit in the cafe talking.\nElsewhere, Roxy confronts Michael about his confusing reaction to the news about Tommy, and he tells her that maybe it's time for him to leave; Phil warns Rainie to stay away from him as he's now clean; Ashley accuses Mercy of stringing Fatboy along before spitefully calling the UK border agency to report that someone has outstayed their visa; and Janine is curious when she spots that Lydia has a letter from Blythe Wealth Management, but Lydia snatches it away before she can investigate further.\n","torrent":{"xt":"urn:btih:3eef0269ea2f63edf42f64c2da98b8d7359f7d7a","amp;dn":"EastEnders+21042011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eef0269ea2f63edf42f64c2da98b8d7359f7d7a","infoHashBuffer":{"type":"Buffer","data":[62,239,2,105,234,47,99,237,244,47,100,194,218,152,184,215,53,159,125,122]},"announce":[],"urlList":[]}}