{"title":"Ben10 Protection of earth [PSP][Spanish]","uid":5773154,"size":612516102,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:3ef8c9cae2cb4b6ada05cc983a8a234b0dd257c3&amp;dn=Ben10+Protection+of+earth+%5BPSP%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1282173252,"description":"\nIdioma: EspaÃƒÂ±ol\nDistribuidor: Virgin Play\nDesarrollado Por: High Voltage Software\nGÃƒÂ©nero:AcciÃƒÂ³n, Plataformas\n\n\nDescripciÃƒÂ³n\nBen, un protagonista de muchas caras\nBen 10 es una serie en la que el protagonista, merced a un brazalete especial y a una trama bastante indulgente, puede transformarse en 10 tipos de alienÃƒÂ­genas distintos, cada uno con sus propios poderes y habilidades, que usarÃƒÂ¡ para salvar la tierra de diferentes amenazas. El juego comienza cuando Ben descubre que su brazalete no funciona y no puede transformarse, de modo que emprenderÃƒÂ¡ un viaje para recuperar sus poderes perdidos y, de paso, salvar de nuevo la tierra. La estructura del videojuego es parecida a la de un capÃƒÂ­tulo de la serie y no busca ninguna proeza argumental, sÃƒÂ³lo el grado justo de personalidad para que cualquier aficionado pueda reconocer la serie en el videojuego.\nLo primero que reulta patente es que Ben 10 ha sido cuidado desde el punto de vista grÃƒÂ¡fico, sin destacar pero haciendo algo muy vistoso que se asocia perfectamente a los dibujos gracias al uso del Cel Shaded. Los entornos son bastante simples y llanos, pero la animaciÃƒÂ³n de los personajes, y particularmente de Ben, es tan efectiva como variada, lo que no sÃƒÂ³lo es agradable a la vista sino que tambiÃƒÂ©n tiene ramificaciones en la propia jugabilidad. Aunque sin duda donde el juego brilla con luz propia es sus combates contra jefes de pantalla, en la que se puede apreciar un apego a algunos clÃƒÂ¡sicos de 16 bits gracias a los gigantescos enemigos y a algunas mecÃƒÂ¡nicas de juego similares. ","torrent":{"xt":"urn:btih:3ef8c9cae2cb4b6ada05cc983a8a234b0dd257c3","amp;dn":"Ben10+Protection+of+earth+%5BPSP%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ef8c9cae2cb4b6ada05cc983a8a234b0dd257c3","infoHashBuffer":{"type":"Buffer","data":[62,248,201,202,226,203,75,106,218,5,204,152,58,138,35,75,13,210,87,195]},"announce":[],"urlList":[]}}