{"title":"The Jacksons - Dreamer  (Beat Club) (2nafish)","uid":5810138,"size":159100932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ff6bceaf11f8deddf979d42170db04dcc6a9c69&amp;dn=The+Jacksons+-+Dreamer++%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1283601119,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Jacksons is the 10th album released by The Jacksons in 1976 for Epic/CBS Records under the Philadelphia International label. The album was the band's first for CBS, following their seven-year tenure on Motown as &quot;The Jackson 5&quot;. Jackson 5 member Jermaine Jackson stayed with Motown when his brothers broke their contracts and defected to CBS; he was replaced by youngest Jackson brother Randy.\n\nPhiladelphia International heads Kenneth Gamble and Leon Huff produced and executive produced the album, including their first top ten hit in two years &quot;Enjoy Yourself&quot;, but had a difficult time focusing on a sound for the now-grown-up boy band. However, the group was able for the first time to write their own material, something that had been denied to them at Motown. The Jacksons composed &quot;Style of Life&quot; and &quot;Blues Away&quot; on their own. &quot;Blues Away&quot; was the first published song written by lead singer Michael Jackson, who began to take a more percussive vocal approach beginning with this album. This album also spawned the second R&amp;B single &quot;Show You the Way to Go&quot;. The album itself placed #36 and #6 on the pop and R&amp;B album charts respectively.\n\nThe album was the Jacksons' first gold album, despite their having sold more than 10 million albums while at Motown. (Motown's sales and financial records were never presented for auditing by the RIAA until 1976).\n\nThe Jackson 5 (also spelled The Jackson Five, or The Jackson 5ive), later known as The Jacksons, are an American popular music family group from Gary, Indiana. Founding group members Jackie, Tito, Jermaine, Marlon and Michael formed the group after performing in an early incarnation called The Jackson Brothers, which originally consisted of a trio of the three older brothers. Active from 1964 to 1990, the Jacksons played from a repertoire of R&amp;B, soul, pop and later disco. During their six-and-a-half-year Motown tenure, The Jackson 5 were one of the biggest pop-music phenomena of the 1970s, and the band served as the launching pad for the solo careers of their lead singers Jermaine and Michael, the latter brother later transforming his early Motown solo fame into greater success as an adult artist.\n\nThe Jackson 5 were the first act in recording history to have their first four major label singles (&quot;I Want You Back&quot;, &quot;ABC&quot;, &quot;The Love You Save&quot;, and &quot;I'll Be There&quot;) reach the top of the Billboard Hot 100. Several later singles, among them &quot;Mama's Pearl&quot;, &quot;Never Can Say Goodbye&quot; and &quot;Dancing Machine&quot;, were Top 5 pop hits and number-one hits on the R&amp;B singles chart. Most of the early hits were written and produced by a specialized songwriting team known as &quot;The Corporation&quot;; later Jackson 5 hits were crafted chiefly by Hal Davis, while early Jacksons hits were compiled by the team of Gamble and Huff before The Jacksons began writing and producing themselves in the late 1970s.\n\nSignificantly, they were the first black teen idols to appeal equally to white audiences thanks partially to the successful promotional relations skills of Motown Records CEO Berry Gordy. With their departure from Motown to CBS in 1976, The Jacksons were forced to change their name and Jermaine was replaced with younger brother Randy as Jermaine chose to stay at Motown. After two years under the Philadelphia International Records  label, they signed with Epic Records and asserted control of their songwriting, production, and image, and their success continued into the 1980s with hits such as &quot;Shake Your Body (Down to the Ground)&quot;, &quot;Lovely One&quot;, and &quot;State of Shock&quot;. Their 1989 album 2300 Jackson Street  was recorded without Michael and Marlon. Michael and Marlon did appear, however, on the title track. The disappointing sales of the album led to the group being dropped by their record label at the end of the year. The group has never formally broken up, but has been dormant since then, although all six brothers performed together at two Michael Jackson tribute concerts in September 2001.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3ff6bceaf11f8deddf979d42170db04dcc6a9c69","amp;dn":"The+Jacksons+-+Dreamer++%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff6bceaf11f8deddf979d42170db04dcc6a9c69","infoHashBuffer":{"type":"Buffer","data":[63,246,188,234,241,31,141,237,223,151,157,66,23,13,176,77,204,106,156,105]},"announce":[],"urlList":[]}}