{"title":"Century Falls","uid":6485041,"size":2981227795,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:40dc184f86a14740d93896f4b6a73f14e49fddd2&amp;dn=Century+Falls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chrismyarse","files":7,"time":1308676685,"description":"I finally got round to uploading my first torrent and thought I would start with this gem. The long-awaited return of this tense and dark drama by Russell T. Davies. \n\nTess Hunter, a lonely girl moves to a sinister village called Century Falls where she meets the strange twins Ben and Carey Naismith. The villagers are strange in that they share a psychic conscioussness, and are all linked by the shocking events of 40 years ago. \n\nThe plot unfurls beautifully, with some interesting twists and turns. The psychic / temporal concepts are a bit tricky to get your head round, but it comes together successfully. \n\nIt is very dark...but it works. The creators are to be congratulated for choosing an ordinary looking cast, some of which are quite elderly actors (unusual for kids drama). They bring real class to this production. \n\nAnother reason this drama has dated so well is that it depends very little on special effects. The intensity is brought about by the lingering menace and uncertainty. The soundtrack is also spot-on, and matches the scenes perfectly. \n\nEnjoy this series, and be grateful if you saw this series first time around in 1993; and all hail Russell T. Davies the saviour of Dr. Who.\n\nRipped from the PAL DVD a year or so ago...I'm a newbie but tried to get it best I could! It is not widescreen.\n\nVideo:\nframe width 720\nheight 576\ndata rate 2500kbps\ntotal bitrate 2756kbps\nframe rate 25 frames/second\nAudio:\nbit rate 256kbps\nchannels 2 stereo\naudio smaple rate 48jhz","torrent":{"xt":"urn:btih:40dc184f86a14740d93896f4b6a73f14e49fddd2","amp;dn":"Century+Falls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40dc184f86a14740d93896f4b6a73f14e49fddd2","infoHashBuffer":{"type":"Buffer","data":[64,220,24,79,134,161,71,64,217,56,150,244,182,167,63,20,228,159,221,210]},"announce":[],"urlList":[]}}