{"title":"Nokia N70 Symbian Flashlight software","uid":5779317,"size":4824287,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:4130fd7de4376c1c941e3b70758e5548245b2099&amp;dn=Nokia+N70+Symbian+Flashlight+software&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"3ogdy","files":1,"time":1282358237,"description":"This pack includes some useful software for the Nokia n70 and any other compatible phone.\nThe pack includes:\nFlashlight 1.1.0 - FULL version\nAllows you to use your N70's flash as a lintern(constantly powered on, ot just for a moment)\n\nBlacklist PRO\nThis version didn't work for me but I included it in the package because there might be people who know khow to make it work by modyfing it a bit.\nIt's a program that allows you to filter the calls you receive, so that you only receive calls frm numbers you want to.\nIt works somewhat like the Adblock Plus in Firefox.\n\nBluetooth Remote Control\nControl your PC using your phone, via Bluetooth\n\nAlarm Manager\nYou can set alarms for each day of the week without having to activate them and they will just start at the time you set them to.\n\nAnamwhite\nSimple white skin for N70\n\nBest Desk - main screen replacement for N70\nCallFilter(same function as Blacklist PRO)\nCall Recorder-&gt;record your calls\nCamera FX -&gt; allows you to modify , transform the aspect of an object before you take a photo of it.(not FULL version, will post a comment when I find it)\nXviD Codec\nDivX Player\nEZScreenLock-&gt;allows you to set a timer after which the phone locks(like a self-locking keyboard configuration but this also gives you the option of setting a photo as a background while the phone's locked and of course, put a password protection so no one can access your phone without your knowledge)\nFaceWarp-&gt;allows you to modify the aspect of someone's face in a a funny way\nFontViewer-&gt;allows viewing the phone's currently installed fonts\nHairStyle-&gt;allows you to change someone's hairstyle by using one of the available styles,after taking a photo of that person.\nInstantMe-&gt;navigae faster within the Symbian OS.\nLCG Jukebox-&gt;A way better Music Player that doesn't necesarilly replace it but it can also replace it. It's much etter designed and thought,allowing for quicker use of the music player.","torrent":{"xt":"urn:btih:4130fd7de4376c1c941e3b70758e5548245b2099","amp;dn":"Nokia+N70+Symbian+Flashlight+software","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4130fd7de4376c1c941e3b70758e5548245b2099","infoHashBuffer":{"type":"Buffer","data":[65,48,253,125,228,55,108,28,148,30,59,112,117,142,85,72,36,91,32,153]},"announce":[],"urlList":[]}}