{"title":"Pinkpop - 1981 (DVD) MSG U2 and others","uid":6479679,"size":2583384110,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4227033f8836934545d790260cd4157a804898bc&amp;dn=Pinkpop+-+1981+%28DVD%29+MSG+U2+and+others&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":8,"time":1308458876,"description":"Pinkpop - Geleen The Netherlands June 8th 1981\n\nActs: New Adventures, U2, Fischer Z, Madness, Michael Schenker Group, UB40, Ian Dury &amp; The Blockheads.\n\nLocatie: Burg. Damensportpark Geleen\n\nEntree: 37,50 (voorverkoop 30,00)\n\nWeer: bewolkt met af en toe een bui\n\nToeschouwers: 48.000\n\nPresentatie: John Peel\n\nLineage: Proshot KRO TV &gt; TV Broadcast Cultura TV &gt; Humax IR-Fox C SD Tuner &gt;\nPioneer DVR-555H-S Recorder SP mode harddisk &gt; DVD-R SP mode (Philips DVDR 990) &gt; DVDFab 7 &gt; You\n\nThe DVD is NOT chaptered.\nNO art work.\n\nOok dit jaar gaan we dertig jaar terug in de Pinkpop-historie met een ruime samenvatting van editie 12 in 1981.\nIn het eerste deel reist verslaggever Bram van Splunteren vanuit Engeland mee met zanger Ian Dury (bekend\nvan hits als 'Sex and drugs and rock 'n roll' en 'Hit me with your rhthm stick') naar het Pinkpop-festivalterrein\nwant hij zou dat jaar het festival met een daverend optreden met zijn Blockheads afsluiten.\nDat zien we in deel 2 maar niet voor we genoten hebben van: New Adventures (rock uit NL), Fischer Z (New wave rock uit GB),\nMadness (ska, GB), Michael Schenker Band (Duitse hard rock), UB40 (reggae, GB) en een piepjong Iers combootje genaamd U2.\nEerder uitgezonden door de KRO op 8 mei 1982.\n\nHet trio New Adventures, troetelkindje van Earring George Kooymans, mag het binnenstromende publiek wakker\nschudden met hun flitsende rock &amp; roll. Het prille U2 neemt dan zelfverzekerd bezit van het podium, laat er geen\ntwijfel over bestaan een mega-act te worden en krijgt er duizenden volgelingen bij. Fischer Z zet het nummer\nRed Skies Over Paradise kracht bij door de lucht te bezwangeren met rode wolken maar kan de indruk die haar voorganger heeft gemaakt niet doen vergeten.\n\nMadness doet haar naam eer aan met een knotsgekke set vol stuiterende ska en melodieuze hardrock van de net\nafgekickte ex-UFO-gitarist Michael Schenker krijgt de nodige respons met een ere-vermelding voor drumbeest Cozy Powell.\nVan ruig naar reggae met UB40 dat vandaag ondubbelzinnig benadrukt geen One In Ten te zijn. Een doodnerveuze Ian Dury\nis verrast over het razend enthousiaste publiek dan zijn nummers woord voor woord meezingt en neemt na afloop zichtbaar\ngeroerd van Jan Smeets een enorme bos bloemen in ontvangst.\n(Bron: 25 jaar Pinkpop)\n\nBono en U2Optreden van U2 U2, waarvan de elpee Boy is verschenen, heeft gisteren eenfantastisch visitekaartje achtergelaten.\nAls het Pinkpoppubliek van gisteren representatief is voor Nederlandse popliefhebbers kan een doorbraak van deze Ierse viermansband niet uitblijven...\n(Bron: Arnhemse Courant 09-06-1981)\n\nDe firma TFA-Electrosound is al jaren verantwoordelijk voor het geluid. Hoofdtovenaar Brian Croft is speciaal eerder naar Geleen\ngekomen om nieuwe technische wegen in te slaan, waarbij de zuiverheid van het geluid altijd uit moet tonen boven het aantal decibellen.\nDit jaar zullen de PA-wings bijvoorbeeld in etagevorm worden opgebouwd...\n(Bron: OOR Pinkpopkrant 1981)\n\nPinkpop 1981 was niet uitverkocht. Volgens Marij Somers, een medewerkster van Buro Pinkpop, is de geringere belangstelling\nvooral te danken aan het ontbreken van een act die exclusief voor Pinkpop naar Europa was gekomen, zoals bijvoorbeeld de J. Geils Band vorig jaar.\nWel waren er ruim driekeer zoveel Duitse popminnende naar Geleen gekomen...(red: waarschijnlijk voor de Michael Schenker Group)\n(Bron: Algemeen Dagblad 10-06-1981)\n\nTerwijl de gemeentelijke reinigingsdienst van Geleen daags na het Pinkpopfestival grote schoonmaak hield in de binnenstad, ruimde\neen door Buro Pinkpop gehuurd aannemersbedrijf de rommel binnen de poorten van het Burgemeester Damensportpark op.\nNiet minder dan 40.000 kg plastic, papier, etensresten en achtergelaten kledingstukken bedekten als een bonte lappendeken de groene grasmat...\n(Bron: De Limburger 10-06-1981)\n\nOptreden van U2 Maar hoe sterk het programma ook ieder jaar is, het geheim van het succes schuilt in de uiterst gezellige sfeer.\nPinkpop, een popfestival waar je je thuisvoelt...\n(Bron: Folder Buro Pinkpop 1981)\n\nMadness op Pinkpop 1981 Een stuk ingetogener was UB40. Zij onderbraken hun Britse toer voor een dag om The Pretenders te vervangen,\ndie de voorkeur gaven aan het voltooien van hun plaatopnamen...\n(Bron: Nieuwsblad van het Noorden 09-06-1981)\n\nDe Schlagerfestival-achtige finale, waarin Ian Dury in Sex, Drugs &amp; Rock 'n Roll de steun kreeg van leden van Madness\nen UB40 liet zien hoe een festival tot een ware happening kan uitgroeien...\n(Bron: De Stem 15-06-1981)\n\nDe winst van het twaalfde Pinkpop-festival is dit jaar minder geweest dan vorige jaren.\nVoor Buro Pinkpop betekent dit dat het komend jaar minder verliesgevende activiteiten georganiseerd kunnen worden.\nHoewel insiders beweren dat de winst dit jaar met anderhalve ton is gedaald, bedraagt die winstdaling volgens\nhoofd-organisator Jan Smeets niet meer dan ongeveer 80.000 gulden...\n(Bron: Dagblad voor Noord-Limburg 23-06-1981) ","torrent":{"xt":"urn:btih:4227033f8836934545d790260cd4157a804898bc","amp;dn":"Pinkpop+-+1981+%28DVD%29+MSG+U2+and+others","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4227033f8836934545d790260cd4157a804898bc","infoHashBuffer":{"type":"Buffer","data":[66,39,3,63,136,54,147,69,69,215,144,38,12,212,21,122,128,72,152,188]},"announce":[],"urlList":[]}}