{"title":"F.E.A.R.3-SKIDROW","uid":6488062,"size":4365301255,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42bc13951d5a5c76c4e6903ddd7411856d99e705&amp;dn=F.E.A.R.3-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BOZX","files":90,"time":1308779200,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nF.E.A.R. 3 (c) WB Games\n\n22-06-2011........Release Date - Protection.........Steam  CEG\nFPS..................Game Type - Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nAlma is expecting and a new level of terror grows as you and your\ncannibal brother battle through a hellish nightmare. Fight together or\ndie alone on a deadly mission to confront your twisted mother. Players\ncan take on the role of Point Man, a genetically enhanced soldier with\nsuperhuman reflexes and the ability to manipulate time, or the undead\nspirit of his brother Paxton Fettel, a paranormal entity who possesses\nincredible psychic powers.\n\nFeatures:\n\nBlood Runs Deep, F.E.A.R. Runs Deeper: F.E.A.R. 3 delivers all the\nhallmarks that define the F.E.A.R. brand: terrifying paranormal\nexperience, frenetic combat and a dramatic storyline.\n\nNever Face Fear Alone: F.E.A.R. 3 evolves the brand, introducing\nDivergent Co-op: deep, social gameplay that gives players distinctly\ndifferent abilities that affect their own play as well as the\nexperience of gamers they are playing with or against.\n\nFrenetic Combat: Active 360 degree cover, evolutionary slow-mo modes,\nscoring systems and best in class mech- combat aid players in facing an\narmy of soldiers and paranormal enemies.\n\nExperience the Almaverse: The game world is tainted by the Almaverse,\nthe alternate dimension where Alma's psychic essence subsists. New\nsinister and fantastical enemy creatures birthed in Almas warped mind\nspill into reality and intensify the panic.\n\nGenerative System: Proprietary technology creates random events to\nincrease the feeling of isolation and unpredictability when playing\nalone or with a friend, and offers new experiences each time gamers\nplay through.\n\nMasters of Horror: Legendary film director John Carpenter and writer\nSteve Niles provide their expertise and guidance to take F.E.A.R. 3's\nintensity to the next level. Niles co-wrote the twisted storyline that\nreveals the motivations and family dynamics of the main characters, and\nCarpenter helped craft the cinematics for maximum storytelling and\nfright factor.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy all files from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:42bc13951d5a5c76c4e6903ddd7411856d99e705","amp;dn":"F.E.A.R.3-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42bc13951d5a5c76c4e6903ddd7411856d99e705","infoHashBuffer":{"type":"Buffer","data":[66,188,19,149,29,90,92,118,196,230,144,61,221,116,17,133,109,153,231,5]},"announce":[],"urlList":[]}}