{"title":"Coast To Coast Am - 09-03-10 - Crystal Skulls &amp; Open Lines","uid":5812688,"size":55138949,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:43615378e9bffd93257f5f4951d7e5d24406e456&amp;dn=Coast+To+Coast+Am+-+09-03-10+-+Crystal+Skulls+%26+Open+Lines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1283709303,"description":"Date: 09-02-10 \n\n\nHost: George Noory \n\n\nGuests: Dr. Melvin Morse, August Goforth, Barry Downing  \n\nAppearing in the second hour, psychotherapist and spirit medium August Goforth discussed his contacts with his deceased partner, Tim, who communicated with him from the Other Side. Tim described to him what it was like to transition into the spirit world, and what he experiences there. The afterlife is similar to our world, yet there are expanded colors and new types of sounds, and &quot;everything has music, everything emits light,&quot; Goforth shared. That's one reason why we often don't hear from people on the Other Side because they're so fascinated with what they're experiencing there, he added. \n\nOften times when people pass on, it's like they're still asleep, and they wake very slowly in special healing centers, Goforth said. In a world where reality is manifested by emotions and thoughts, spirits help and teach new arrivals, he continued. Interestingly, Tim informed him that reincarnation is not a necessity or a reality on the Other Side, and there are even people there that don't believe the earthly plane exists at all. \n\nIn the latter half of the show, neuroscientist Dr. Melvin Morse presented reports of NDEs (near-death encounters) that are are consistent with modern physics and psychology. Premonitions, after-death communications, NDEs, mediumships, and remote viewing are all types of &quot;non-local perceptions,&quot; --things that seem as real as ordinary experiences but come to us from non-ordinary means, he explained. Very specific areas of the brain allow us to have these experiences, he added. In recounting the NDEs of children from places like Japan and Africa, he noted that the kids described sights specific to their culture, yet shared certain commonalities, such as being told 'it's time to come back.' \n\nIn tandem with this topic, a Coast to Coast AM Insta-Poll showed that listeners overwhelmingly believe there is life after death. \n\nCreation, God, &amp; UFOs\nFirst hour guest, minister and author Dr. Barry Downing (book link) talked about UFOs, the Bible, and creation, and reacted to Stephen Hawking's recent comment that God was not needed to create the universe. While &quot;I don't think science will ever come up with proof for God in a direct way,&quot; the reality of UFOs may have a connection with the divine, he stated. But, if you get rid of the idea that we've been created for a purpose, then morality gets tossed aside, he noted. \n\nWebsite(s): \n-therisenbooks.com\n-melvinmorse.com\n-spiritualscientific.com\nBook(s): \n-The Risen: Dialogues of Love, Grief &amp; Survival Beyond Death\n-Where God Lives: The Science of the Paranormal and How Our Brains are Linked to the Universe\n-The Bible and Flying Saucers\n","torrent":{"xt":"urn:btih:43615378e9bffd93257f5f4951d7e5d24406e456","amp;dn":"Coast+To+Coast+Am+-+09-03-10+-+Crystal+Skulls+%26+Open+Lines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43615378e9bffd93257f5f4951d7e5d24406e456","infoHashBuffer":{"type":"Buffer","data":[67,97,83,120,233,191,253,147,37,127,95,73,81,215,229,210,68,6,228,86]},"announce":[],"urlList":[]}}