{"title":"Coast To Coast Am - 08-31-10 - The Hutchison Effect &amp; Antigravit","uid":5806021,"size":55765062,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:43b016706c9436ca8ae1a5e94cc0baba8d974ea9&amp;dn=Coast+To+Coast+Am+-+08-31-10+-+The+Hutchison+Effect+%26+Antigravit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1283447783,"description":"Date:\n 08-31-10\n \nHost:\n George Noory\n \nGuests:\n Bob Koontz, John Hutchison, Seth Shostak \n \n\n\nExperimental nuclear physicist Dr. Bob Koontz, and independent researcher John Hutchison discussed the Hutchison Effect, and such topics as antigravity, Tesla technology, UFO propulsion, free energy, and the Philadelphia Experiment. The Hutchison Effect &quot;was an accidental discovery I made way back in 1979 when I was replicating a lot of Nikola Tesla's machinery...I was playing with this high voltage equipment and started noticing that certain things would happen like objects moving around by themselves a little bit,&quot; said Hutchison. &quot;You cannot explain this effect with conventional physics,&quot; noted Koontz, who views this work as far more important than the Large Hadron Collider experiments at CERN. \n\nKoontz characterized Hutchison's experiments as highly sophisticated-- he used one-million-volt Tesla coils to create electromagnetic fields that induced scalar effects or antigravity-- such as levitating heavy objects, or turning metal into jelly. A kind of antigravity shield could be used in a craft or spaceship, Hutchison outlined. By canceling inertial effects, spacecraft could make sharp right turns, and through jumping into subspace or hyperspace, ships could move as fast as they want and not collide with anything, said Koontz. &quot;It doesn't violate the laws of physics to produce free energy-- it's a zero point process,&quot; he added. \n\nNot unlike the purported Philadelphia Experiment, Hutchison said he's had samples disappear and reappear during tests. &quot;I've had other samples where the steel itself is aging in time,&quot; for every day about 10 years ahead in time-- according to a study the Max Planck Institute conducted on one of the samples, he reported. Hutchison, who has achannel featuring videos of levitation and many of his experiments, said he is currently focused on developing free energy and new propulsion systems. \n\nSETI Update\nFirst hour guest, astronomer Seth Shostak talked about SETI and the discovery of new exoplanets. Star systems known to have planets, and located far enough north to be picked up on SETI's radio telescopes, are definitely on their observing list, he noted. \n\n\nWebsite(s):\n-doctorkoontz.com\n-seti.org\nBook(s):\n-Confessions of An Alien Hunter","torrent":{"xt":"urn:btih:43b016706c9436ca8ae1a5e94cc0baba8d974ea9","amp;dn":"Coast+To+Coast+Am+-+08-31-10+-+The+Hutchison+Effect+%26+Antigravit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43b016706c9436ca8ae1a5e94cc0baba8d974ea9","infoHashBuffer":{"type":"Buffer","data":[67,176,22,112,108,148,54,202,138,225,165,233,76,192,186,186,141,151,78,169]},"announce":[],"urlList":[]}}