{"title":"Coast To Coast Am - 08-16-10 - Earth Changes &amp; Biblical Prophecy","uid":5775055,"size":55785466,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:447c2a90e23c87599de8f25540ad718feea8780f&amp;dn=Coast+To+Coast+Am+-+08-16-10+-+Earth+Changes+%26+Biblical+Prophecy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1282235833,"description":"Coast To Coast Am - 08-16-10 - Earth Changes &amp; Biblical Prophecy\n\nDate:\n 08-16-10\n \nHost:\n George Noory\n \nGuests:\n L. A. Marzulli, Captain Kelly Sweeney \n \n\n\nAuthor and researcher L.A. Marzulli discussed his latest research exploring various events that he believes could be harbingers to the prophecy in the Book of Revelation: &quot;When you hear of wars, and rumors of wars, do not be troubled for such things must happen. But the end is not yet. For nation will rise against nation, and kingdom against kingdom. And there will be earthquakes...and famines and troubles. These are the beginnings of sorrows.&quot; He listed a number of current disasters which he thinks could be tied in: the Russian heatwave/wildfires, flooding in Pakistan &amp; China, and a sea-life die-off in Bolivia. \n\nHe also pointed out there's been a recent bout of quakes higher than magnitude 7, and reports of a more devastating volcanic eruption to come in Iceland. &quot;I'm alarmed at what I see. I've never seen the global atmosphere so charged, so uncertain...as it is now,&quot; he commented. Marzulli views the focus on 2012 as a deliberate obfuscation from the dire events happening right now. In terms of war, if Russia sides with Iran, we could see the fulfillment of Ezekiel's prophecy referring to the war of Gog and Magog, he noted. \n\nMarzulli went on to outline how the Antichrist will be associated with the rebuilding of the Temple Mount in Jerusalem, the forming of a one-world religion, as well as the instigation of a chip or tattoo that people will need to buy or sell. &quot;I believe the whole idea of the extraterrestrial...is part of a coming great deception,&quot; he said, suggesting that so-called aliens are malevolent beings who spill over from another dimension to carry out a breeding program, and that their presence will be used to trick people into following the one-world religion. For more, check out Marzulli's blog. \n\nBP Spill Update\nFirst hour guest, Capt. Kelly Sweeney shared an update on the BP oil spill. After the relief well is completed, the Deepwater Horizon oil rig is going to be brought back up from the ocean bottom and be used as evidence in a criminal investigation, he reported. In talking about other maritime issues, he noted that the ice melt in the Arctic is leading to more ship traffic in the waters above Canada and Russia, and possible new oil drilling there. \n\n\nWebsite(s):\n-lamarzulli.net\n-maritimeheadhunters.com\n-professionalmariner.com\nBook(s):\n-The Alien Interviews\n-Politics, Prophecy &amp; the Supernatural\n-The Unholy Deception\n-From the Bridge: Authentic Modern Sea Stories","torrent":{"xt":"urn:btih:447c2a90e23c87599de8f25540ad718feea8780f","amp;dn":"Coast+To+Coast+Am+-+08-16-10+-+Earth+Changes+%26+Biblical+Prophecy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"447c2a90e23c87599de8f25540ad718feea8780f","infoHashBuffer":{"type":"Buffer","data":[68,124,42,144,226,60,135,89,157,232,242,85,64,173,113,143,238,168,120,15]},"announce":[],"urlList":[]}}