{"title":"Jimena Jimenez Cacho - Six quasi-sonatas in quarter tones for so","uid":6460274,"size":340740096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:453a5bd6bdc4c71fb719fe49f7e6bdf9f4225ac5&amp;dn=Jimena+Jimenez+Cacho+-+Six+quasi-sonatas+in+quarter+tones+for+so&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shamex","files":18,"time":1307732284,"description":"Yo digo: JuliÃƒÂ¡n Carillo. AdemÃƒÂ¡s de ser una calle en #CUU es un compositor mexicano a la altura de cualquiera de los grandes del siglo XX. Este CD doble presenta un montÃƒÂ³n de composiciones para violoncello, grabadas por la mexicana Jimena GimÃƒÂ©nez Cacho (Ã‚Â¿hermana de Daniel tal vez?), activista de la causa de Carrillo en nuestro paÃƒÂ­s.\nEste disco nos muestra algunas de las ÃƒÂºltimas obras que compuso Carrillo poco antes de su muerte en 1965 y si eres un curioso que quiere experimentar de primer oÃƒÂ­do quÃƒÂ© carajos es eso de sonido 13, aqui puedes sentir toda su gloroiosa quietud, incÃƒÂ³moda e inquietante. Creo que este es el primer disco doble que se sube en nochepasta.\n\nOtros dicen:\n\nDe LastFm: &quot;JuliÃƒÂ¡n Carrillo Trujillo (28 de enero de 1875 - 9 de septiembre de 1965), fue un compositor, director de orquesta y violinista mexicano dentro de la corriente modernista internacional. RealizÃƒÂ³ investigaciones sobre el microtonalismo desde fines del siglo XIX y desarrollÃƒÂ³ la teorÃƒÂ­a del Sonido 13, primer intento por formalizar el estudio sistemÃƒÂ¡tico del microtonalismo.\n\nFue director del Conservatorio Nacional de MÃƒÂºsica y de la Orquesta SinfÃƒÂ³nica Nacional de MÃƒÂ©xico, y fundÃƒÂ³ la Orquesta SinfÃƒÂ³nica Beethoven y la Orquesta del Sonido 13, con sede en Nueva York.\n\nDiseÃƒÂ±ÃƒÂ³ y construyÃƒÂ³ pianos y arpas microtonales para interpretar sus composiciones, en un esfuerzo que reunÃƒÂ­a conocimientos de acÃƒÂºstica, resistencia de materiales y teorÃƒÂ­a musical.&quot;\n\n\n\n","torrent":{"xt":"urn:btih:453a5bd6bdc4c71fb719fe49f7e6bdf9f4225ac5","amp;dn":"Jimena+Jimenez+Cacho+-+Six+quasi-sonatas+in+quarter+tones+for+so","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"453a5bd6bdc4c71fb719fe49f7e6bdf9f4225ac5","infoHashBuffer":{"type":"Buffer","data":[69,58,91,214,189,196,199,31,183,25,254,73,247,230,189,249,244,34,90,197]},"announce":[],"urlList":[]}}