{"title":"Broadcast - Tender Buttons","uid":5767030,"size":58481765,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4551588792a34b266cf0d282306392a36230bdbc&amp;dn=Broadcast+-+Tender+Buttons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"the_guttersnipe","files":15,"time":1281953184,"description":"If you thought Haha Sound was a sonic mess, you might want to bring a Dust Buster with you for your first go with Tender Buttons. Where The Noise Made By People eagerly embraced listeners with its pastiche of groovy space-age bachelor pad couture and timeless pop songsmithery, Haha Sound was more standoffish at first blush. The tunes were there, but they were covered in a bit of soot. Those able to look past the static were rewarded; the clash between the off-putting sounds and the melodies created something greater.\n\nThe same plan of attack is in place for this album. Only two folks were involved in the making of Tender Buttons-- vocalist Trish Keenan and bassist James Cargill. What the group lost in manpower, they more than make up for in racket. Keenan, as always, lends her gorgeous frigid voice to the proceedings, often two times (as on the lilting ballad &quot;Tears in the Typing Pool&quot;). As for the music, Keenan and Cargill bring the melodies, but then dress their poptastic efforts with whatever ruckus they can conjure.\n\nIt begins with the keening pings that kick off &quot;I Found The F&quot;, and continues throughout. (For what it's worth, a kinder, gentler reprisal of the first track's melody ends the record.) The first single, &quot;America's Boy&quot;, disguises its topicality in warbling, ghostly shrieks. &quot;Arc of a Journey&quot; chirps and skitters through its tunefulness for three minutes, then ends with a distorted and distended coda. Meanwhile, &quot;Corporeal&quot; decides to just throw in the raucous bits against the tune's Young Marble Giants-esque facade to see what sticks.\n\nThis possibly comes off as a dour appraisal of this album, which I enjoy, and there a good reason for this. As noted earlier, Haha Sound went for the approach, and brought stronger tunes to the mix (cf. &quot;Colour Me In&quot;, &quot;The Little Bell&quot;). There's no such stand-out track on this album (and there's certainly no &quot;oh wow&quot; moments like &quot;Papercuts&quot; or &quot;Come On Let's Go&quot;, either). What you have with Tender Buttons is a Broadcast album that listeners might need to spend more time with than expected. That said, this is still a Broadcast album, meaning it's one of the better things you'll put in your ear this year. Don't mind me if I reciprocate the album's tough love in equal measure.","torrent":{"xt":"urn:btih:4551588792a34b266cf0d282306392a36230bdbc","amp;dn":"Broadcast+-+Tender+Buttons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4551588792a34b266cf0d282306392a36230bdbc","infoHashBuffer":{"type":"Buffer","data":[69,81,88,135,146,163,75,38,108,240,210,130,48,99,146,163,98,48,189,188]},"announce":[],"urlList":[]}}