{"title":"Ren &amp; Stimpy iPod DVDRip &quot;uncut&quot; and &quot;lost episodes&quot;","uid":6324139,"size":3942230877,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:461f1c53bdbbba7727320bb3c6347d820f82d60d&amp;dn=Ren+%26+Stimpy+iPod+DVDRip+%5C%22uncut%5C%22+and+%5C%22lost+episodes%5C%22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mtndoug","files":25,"time":1303050820,"description":"dvdrips of the following region 1 paramount dvd sets:\n\n&quot;John K Presents The Ren &amp; Stimpy Show UNCUT: The First and Second Seasons&quot;\n\n&quot;John K Presents Ren &amp; Stimpy the Lost Episodes&quot;\n\nthese are encoded at 320x240 in ipod video format, ripped directly from dvd and encoded with HandBrakeCLI\n\nFiles in the torrent:\n\nfiles named rs_1??.mp4 are Ren and Stimpy Show season 1 episodes\nfiles named rs_2??.mp4 are Ren and Stimpy Show season 2 episodes\n\nfiles named rsapc_10?.mp4 are the new 2003 adult episodes made for TNN (now spike)\nexcept rsapc_101.mp4 is the uncensored Ren and Stimpy unaired pilot and &quot;Man's Best Friend&quot;, which spike aired in 2003\n\nthere's some debate about episode numbers.  i've numbered them in original broadcast order, and grouped the unaired pilot/man's best friend with the adult party cartoon because that's how it aired (even though it's on the season 1 &amp; 2 dvd)\n\nSeasons 3-5 are not included in this torrent because i don't own them because Nickelodeon made these without John K\n\ndvd extras and commentary are also not included because i haven't encoded them for my ipod\n\nThe adult episodes are very disturbing and should not ever be shown to children.\n\nIf you only want the adult episodes, select the files &quot;rsapc_102-rsapc_107&quot; in your bittorrent client, and deselect everything else\n\nThe quality on season 1 &amp; 2 isn't perfect.  This is just how the dvds are.  Even though this dvd set is advertised as &quot;uncut&quot;, there seem to be several differences between what is on the dvd and what originally aired on nickelodeon, and there are several really ugly video freezes and other glitches that were part of the &quot;digital remastering&quot; which john k even complains about in the commentary (commentary not in this torrent)\n\nthe adult episodes are even better than what aired on spike because they are completely uncensored.","torrent":{"xt":"urn:btih:461f1c53bdbbba7727320bb3c6347d820f82d60d","amp;dn":"Ren+%26+Stimpy+iPod+DVDRip+%5C%22uncut%5C%22+and+%5C%22lost+episodes%5C%22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461f1c53bdbbba7727320bb3c6347d820f82d60d","infoHashBuffer":{"type":"Buffer","data":[70,31,28,83,189,187,186,119,39,50,11,179,198,52,125,130,15,130,214,13]},"announce":[],"urlList":[]}}