{"title":"Star Ruler RIP-Unleashed","uid":5782959,"size":127091917,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:471cd66df89a2f01aa8b9556e9d99f71343fd9e7&amp;dn=Star+Ruler+RIP-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":28,"time":1282483149,"description":"Release Date  :  22/08/2010                Protection  :  Nothing\nRelease Type  :  RIP 26x5.00MB             Company     :  Blind Mind Studios\n\nRelease Notes:\n\nEver wanted to rule the galaxy? Now's your chance!\n\nTake command of a vast interstellar empire and safeguard your species\nfrom total extinction. Prove your species' ingenuity through a deep\nand intricate combat system where anything (from individual components\non ships to the stars themselves) is a target of opportunity.\n\nUtilize your silver tongue to twist other Empires into submitting\nunder your galaxy-class wit with a complex and full-featured diplomacy\nsystem or wheel-and-deal your way to supremacy.\n\nResearch deadly new weapons, new engines, shields, and more with a\nresearch web whose contents are shuffled with every game.\n\nExplore vast interstellar phenomenae such as black holes and asteroid\nbelts and exploit them for yourself or destroy them to deny your foes.\n\nMatch your wits with up to 10 online or LAN-linked opponents, save the\ngame when dawn breaks, and boot it back up at dusk. It isn't over\nuntil you say it is!\n\nMod the game to suit your playstyle! Your weapons, your ships, your\nrules. Almost the entire game can be modified entirely through an\neditor as simple as notepad. Easily add new models and particle\neffects to the game with a robust set of out-of-the-box developer tools.\n\nVast, Procedurally Generated Galaxies: Choose however many systems\nyou desire - limited only by the speed of your CPU. Rich, diverse\nplanets whose type, size, number of moons and other characteristics\nvary makes every game unique.\n\nIntricate Ship Design and Exciting Combat: Massive ship battles\nfought in real-time with particle effects and directional damage with\nfull simulated Newtonian physics. Individual ship components can be\ncompromised, destroyed, disabled, repaired and renovated.\n\nUnique Research System: Explore a web-like research system with\nunexpected discovereies around every turn. Choose between a\nstructured, static web or a highly varied web each game.\n\nEasy to Use Interface; Complex Gameplay: Govern your planets with a\nsimple, yet powerful interface to customize the behavior of your\nworlds. Customize the GUI via scripting to add new windows or change\nexisting interface behavior.\n\nEngaging AI Opponents: Choosen from various levels of difficulty,\nwith optional 'cheating' AIs. AIs will adapt their ship designs and\nstrategies to counter yours.\n\nExtensive Modding Support: Modify data files and scripts in any\neditor. Use developer tools to create particle effects and configure\nimported models. Smart use of AngelScript allows users to create\nentirely new game modes, gameplay and online experiences.\n\nMultiplayer: Co-Op, Team and Free-For-All: Play with as many\ncompetitors as your server can manage, with drop-in-drop-out\ncompatibility over LAN or Internet. Multiplayer games can be saved,\nplayed in single-player, and then brought back into multiplayer.\n\nOriginal Soundtrack by Artem Bank.\n\nRIPPED: Nothing\n\nInstall Notes:\n\n1. Unpack the release with WinRAR or equivalent\n2. Install by running unl-stru.exe\n3. Start game with StarRuler.exe\n4. Enjoy!\n\nImportant:\n\nRun the included vcredist_x86.exe and oalinst.exe, if you don't have\nthem  installed. Game needs them to run!\n\nRemember to support quality games!","torrent":{"xt":"urn:btih:471cd66df89a2f01aa8b9556e9d99f71343fd9e7","amp;dn":"Star+Ruler+RIP-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"471cd66df89a2f01aa8b9556e9d99f71343fd9e7","infoHashBuffer":{"type":"Buffer","data":[71,28,214,109,248,154,47,1,170,139,149,86,233,217,159,113,52,63,217,231]},"announce":[],"urlList":[]}}