{"title":"Trace Adkins - This Ain't No Love Song (2nafish)","uid":5757359,"size":130615300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:48ce54b30a0a2154e1dd22ecedb9187846a7f1c0&amp;dn=Trace+Adkins+-+This+Ain%5C%27t+No+Love+Song+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1281608957,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;This Ain't No Love Song&quot; is the title of a song written by Tony Lane, Marcel Chagnon and David Lee and recorded by Trace Adkins for his upcoming 2010 album Cowboy's Back in Town. It was released as the second single from the album in May 2010.\n\nThe music video was directed by Michael Salomon and premiered on the CMT website on June 18, 2010.\n\n&quot;This Ain't No Love Song&quot; debuted at #54 on the U.S. Billboard Hot Country Songs charts for the week of May 22, 2010.\n\nBobby Peacock of Roughstock gave the song 3.5 out of 5 stars, describing the song as &quot;a neat little inversion and a perfect fit for his voice.&quot; He also said that Adkins &quot;seems to overdose on the masculine swagger, he tones it down just enough without sacrificing his slightly defiant, strong nature.&quot; Peacock also said that the song should get Adkins back on track as a country artist for good.  Kevin John Coyne of Country Universe gave the song a B grade saying that the Adkins sings the song well but he &quot;doesn't sing it well enough to elevate it beyond what it already is&quot;.\n\nCowboy's Back In Town is the ninth studio album by American country music artist Trace Adkins. It is set to be released on August 17, 2010 via Show Dog-Universal Music Nashville. The first single, This Ain't No Love Song, was released to radio in May 2010 and debuted at #54 on the U.S. Billboard Hot Country Songs  chart for the week of May 22, 2010. Also included on the album is &quot;Ala-Freakin-Bama,&quot; a song that charted in late 2009 and was promoted by Adkins's former label, Capitol Records.\n\nCowboy's Back In Town is the first release for Adkins under his new record deal with Show Dog-Universal Music, after his contract with Capitol Records was fulfilled with the release of 2008's X. Adkins also commented on the recording sessions of the album, saying &quot;Toby  has said this new music has a smile on it, and maybe that's just a reflection of where I'm at right now, I have this new sense of invigoration, and making this record was a lot of fun.&quot; In an interview with Billboard Magazine, Adkins talked about the album and the title, &quot;I feel as energized and enthusiastic as I did when I first got a record deal, I'm having fun again, so [the title] 'Cowboy's Back in Town' just made sense to me.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:48ce54b30a0a2154e1dd22ecedb9187846a7f1c0","amp;dn":"Trace+Adkins+-+This+Ain%5C%27t+No+Love+Song+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48ce54b30a0a2154e1dd22ecedb9187846a7f1c0","infoHashBuffer":{"type":"Buffer","data":[72,206,84,179,10,10,33,84,225,221,34,236,237,185,24,120,70,167,241,192]},"announce":[],"urlList":[]}}