{"title":"DVDRebuilder 1.28.2.rar","uid":6325637,"size":10698848,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4a45bf96452296ba24992bb4fde6e6e267eab93f&amp;dn=DVDRebuilder+1.28.2.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":-1,"time":1303106815,"description":"NEW! Now you can use DVD-RB to create MOBILE video output!\nClosed Captions - Now DVD-RB will extract closed caption data from the original DVD and remultiplex it into the MPEG stream during REBUILD. \nMenu Encoding - The ability to scan and reencode menu segments in the same way as standard title sets.\nMultiple encoder instances - On multiple core computers and some very fast single core computers using hyperthreading this will take advantage of unused processor time.\nMovie and Menus Only capability - allows you to get the best quality within limited available space.\nSegment Blanking - Provides you a capability to remove annoying intro screens.\nSlideshow Mode - Convert &quot;Extra&quot; segments into a slideshow, saving valuable space for the Feature.\nAdvanced Encoding Features - Modify GOP size, add customized encoder quantizer matrices, set DC precision.\nMovie-Only - mode that gives the highest quality possible. Every available bit is dedicated to the feature.\nOne pass encoding support for HC encoder - Gives high quality results in much less time.\nGraphic Analysis display for use in analyzing the IFO structure - draws PGC/CELL relationships.\nISO file creation is now supported to make it easier to archive or burn DVD-RB's output.\nAutomatic burning using ImgBurn or DVD Decrypter - makes complete DVD Backup truly &quot;one-click&quot;.\nRemapping audio tracks - set the default to your language or preferred format.\nNew intuitive interface - modernizes and simplifies control of your rebuild!\nFull support for video interleaving (ILVU) - re-encodes angle and seamless branching.\n...and more... with many additional features planned in the near future!\n\n\n\n1. Install the program\n2. Paste Qkgp.exe inside installation folder and run it\n3. Choose a email or name (ascii characters) and press Go!\n\n(4. Optional: if fails, check the SystemId with Reg-RB.exe; press Edit to enter manually; try with another email)\n\nand don't forget to consider buy this program","torrent":{"xt":"urn:btih:4a45bf96452296ba24992bb4fde6e6e267eab93f","amp;dn":"DVDRebuilder+1.28.2.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a45bf96452296ba24992bb4fde6e6e267eab93f","infoHashBuffer":{"type":"Buffer","data":[74,69,191,150,69,34,150,186,36,153,43,180,253,230,230,226,103,234,185,63]},"announce":[],"urlList":[]}}