{"title":"FingerTouch Pro Version. 2.1 For The Pocket PC","uid":5812448,"size":3558266,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:4b38c3b492b7989b4aa4228bb1f364ad1d2fd37b&amp;dn=FingerTouch+Pro+Version.+2.1+For+The+Pocket+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxThugxx","files":-1,"time":1283697096,"description":".\n\n\n                           *******   *    *  *     *   *****\n                              *      *    *  *     *   *\n                              *      ******  *     *   *\n                              *      *    *  *     *   * ****\n                              *      *    *  *     *   *    *\n                              *      *    *  *******   ******\n\n\n\n                                ingerTouch Pro Version. 2.1\n\n                                                             \n\nFingertouch Professional is by FAR the best keyboard released for the Pocket PC platform. Big, finger friendly keys, fT9 technology, UltraKeyboard technology, predictive keyboard, multiple languages, drag-and-drop configurable keyboard, \ngestures, skins, magnifier, are just a few to provide an insight into the thought and research that went into developing this program. Entering text on your Pocket PC has never been this fast!\n\n\n\n* Fingertouch PRO comes with 5 layouts, meaning you have 5 keyboards in 1: classic keyboard, smart keyboard \n  (predictable), phone keyboard (phone-like), calculator/numeric keyboard and the successful big keyboard (predictable).\n* Fast text input with our patented technologies:\n* Embedded fT9 Technology, this is the Teksoft Patented, T9 like technology included in Fingertouch Professional\n* Embedded UltraKeyboard Technology, for assigning various actions to text commands (triggers)\n* Configurable layout, including keyboard Skin, text font, size and color\n* Drag and drop on keyboard for changing the keyboard size, or for customizing the position of the keys\n* Magnifier, that can help you better see the keys you are pressing\n* Configurable fT9 parameters, for easy use including finger easy interface\n* Gestures, you can slide over your keyboard to send Backspace, space, Enter or upper case letters to your documents\n* Ultrakeyboard advanced configuration panel for defining your custom action and triggers.\n* WM4.0, WM5.0, WM6.0 and even WM6.1 compatible!\n* Works with various screen heights, square, qvga, vga, etc\n* It supports 96x96DPI and 128x128DPI. TrueVGA compatible\n* Can be installed on SDCard to save storage space\n\n","torrent":{"xt":"urn:btih:4b38c3b492b7989b4aa4228bb1f364ad1d2fd37b","amp;dn":"FingerTouch+Pro+Version.+2.1+For+The+Pocket+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b38c3b492b7989b4aa4228bb1f364ad1d2fd37b","infoHashBuffer":{"type":"Buffer","data":[75,56,195,180,146,183,152,155,74,164,34,139,177,243,100,173,29,47,211,123]},"announce":[],"urlList":[]}}