{"title":"The Pacific (2010) DVD 1 Afl. 1+2 NLT-Release","uid":5773854,"size":4663429995,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4c6141abef75529d581bc6b92a4f9d2a37610f46&amp;dn=The+Pacific+%282010%29+DVD+1+Afl.+1%2B2+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1282209483,"description":"The Pacific (2010) DVD 1 Afl. 1+2 NLT-Release\n\n\n[url=http://www.imdb.com/title/tt0374463/]IMDB[/url]\nGenre: Oorlog, Drama\nActeurs: Joseph Mazzello, James Badge Dale, Jon Seda, Chris Milligan, Ashton Holmes, Josh Helman, Martin McCann, Keith Nobbs, Toby Leonard Moore, Tom Hanks, Jacob Pitts\n\nPlot: \nDe productie van The Pacific is op 13 augustus 2007 begonnen in AustraliÃƒÂ«. Filmlocaties zijn onder andere de omgeving van Port Douglas, Melbourne en Victoria.[1] De serie heeft een budget van meer dan $200 miljoen en is daarmee de duurste ooit gemaakt in AustraliÃƒÂ«.\n\nDe verhaallijn van The Pacific, geschreven door Hugh Ambrose, staat los van die van Band of Brothers en is voornamelijk gebaseerd op twee memoires van Amerikaanse mariniers: With the Old Breed van Eugene Sledge en Helmet for my Pillow van Robert Leckie. De serie zal het verhaal vertellen van de twee auteurs en marinier John Basilone, die deelnamen aan de oorlog tegen het Japanse Keizerrijk.\n\n1. Part One - Basilone en Leckie bereiden zich voor op hun inzet in de strijd om de Salomons-eilanden tegen Japan. De 1st Marine Division met daarin Leckie wordt uiteindelijk ingezet in de Slag om Guadalcanal.\n2. Part Two - Basilone en de 7th Marine Division komen aan op Guadalcanal om de 1st Marine Division te versterken en het belangrijkste vliegveld te verdedigen. Basilone speelt een belangrijke rol in het afweren van een nachtelijke Japanse aanval.\n\n\nGenre: War Drama\nActors: Joseph Mazzello, James Badge Dale, Jon Seda, Chris Milligan, Ashton Holmes, Josh Helman, Martin McCann, Keith Nobbs, Toby Leonard Moore, Tom Hanks, Jacob Pitts\n\nPlot:\nThe production of The Pacific on August 13, 2007 began in Australia. Film locations include the area of Port Douglas, Melbourne and Victoria. [1] The series has a budget of more than $ 200 million, making it the most expensive ever made in Australia.\n\nThe storyline of The Pacific, written by Hugh Ambrose, is separate from that of Band of Brothers is based primarily on two memoirs by U.S. Marines: With the Old Breed by Eugene Sledge and Helmet for My Pillow by Robert Leckie. The series will tell the story of the two authors and Marine John Basilone, who participated in the war against the Japanese Empire.\n\n1. Part One - Basilone Leckie and prepare for their efforts in the struggle for the Solomon Islands to Japan. The 1st Marine Division containing Leckie is eventually used in the Battle of Guadalcanal.\n2. Part Two - Basilone and the 7th Marine Division on Guadalcanal to come to the 1st Marine Division to strengthen and defend the main airport. Basilone plays an important role in repelling a Japanese attack at night.\n\nBron: HD\nOndertiteling: Nederlands\nGesproken taal: Engels\nMenu: Nee\nExtras: Nee\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail \nOndertitels : Nederlands (instelbaar) \nGenre : Drama\nTV Shows/Series\nOorlog \n\n\nEnjoy the movie\n\n\n\n","torrent":{"xt":"urn:btih:4c6141abef75529d581bc6b92a4f9d2a37610f46","amp;dn":"The+Pacific+%282010%29+DVD+1+Afl.+1%2B2+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6141abef75529d581bc6b92a4f9d2a37610f46","infoHashBuffer":{"type":"Buffer","data":[76,97,65,171,239,117,82,157,88,27,198,185,42,79,157,42,55,97,15,70]},"announce":[],"urlList":[]}}