{"title":"Krokus - Hoodoo Woman (2nafish)","uid":5792503,"size":124901380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4edb8f0b929fd7f694aed45a33c236b09f3b41ad&amp;dn=Krokus+-+Hoodoo+Woman+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1282905031,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nHoodoo Is the 16th album by heavy metal band Krokus. It includes a Steppenwolf cover of Born to be wild. It failed to top the Billboard Top 200. Unlike Their last album Hellraiser.\n\nKrokus is a Hard Rock band from Switzerland. They enjoyed moderate success in North America during the 1980s.\n\nKrokus was founded in Solothurn in 1974 by bassist (and original lead vocalist) Chris von Rohr and guitarist Tommy Kiefer. Former Eazy Money vocalist Marc Storace joined the band as frontman in time for their Metal Rendez-vous album in 1980.\n\nThe band name &quot;Krokus&quot; evolved from the word for a flower common to the region of southern Europe, the crocus. Early in the spring of 1975, band founder Chris von Rohr observed a field of these flowers while traveling by train. He was returning from L'Ecole des Chefs located in France after an aborted career in the culinary arts, and it was around this time the idea for a Metal band was formed. The band members stated that it was the perfect name, since it features &quot;Rock&quot; right in the middle.\n\nKrokus was formed in 1974 as a primarily prog rock  act. Chris von Rohr, originally the bassist, switched to lead vocals in the late 1970s and with that formation Krokus was successful in Switzerland, touring throughout the country. After seeing AC/DC  in concert in the late 70s, they decided to change their musical direction and adopted a new sound which was heavily influenced by the band. Since von Rohr possessed limited vocal abilities and was not capable of hitting the third octave, the band decided to hire a new lead vocalist. Eventually, Marc Storace, formerly of TEA and Eazy Money, was hired. With the new lineup in place, the band recorded and released a new album entitled Metal Rendez-vous in 1980, bringing much wider international recognition.\n\nThe 1981 follow-up album, Hardware, was recorded at the Hammersmith Studios in London and featured such songs as &quot;Easy Rocker&quot; and &quot;Rock City&quot;, which are still a part of the band's live repertoire today.\n\nIn 1982, with new American management, Krokus recorded One Vice at a Time, which featured the hits, &quot;Long Stick Goes Boom,&quot; and the Guess Who cover, &quot;American Woman&quot;. Chris von Rohr described the album at the time as &quot;the album AC/DC never made&quot;, as the influence of the Australian band is difficult to ignore. The comparisons actually cast doubt on the creativity of the band, as many listeners now began to regard Krokus merely as AC/DC imitators. Nevertheless, Krokus became increasingly popular in Europe and began to receive attention in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4edb8f0b929fd7f694aed45a33c236b09f3b41ad","amp;dn":"Krokus+-+Hoodoo+Woman+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4edb8f0b929fd7f694aed45a33c236b09f3b41ad","infoHashBuffer":{"type":"Buffer","data":[78,219,143,11,146,159,215,246,148,174,212,90,51,194,54,176,159,59,65,173]},"announce":[],"urlList":[]}}