{"title":"Skyline  [2010]RTB.NL.Sub.CBCS.SH@R","uid":6467032,"size":4332530352,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4ef6be7e9b582ed539c8d453df40d7f402c5ee18&amp;dn=Skyline++%5B2010%5DRTB.NL.Sub.CBCS.SH%40R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CBCS","files":18,"time":1307996094,"description":"THIS IS A TEST&gt;THIS IS A TEST\n\nSkyline [2010]RTB.NL.Sub.CBCS.SH@R\n\n\nDit is een test.\t\n==================\n\nWij hebben deze film in DVD bestand omgezet.\n\nWij noemen dat een &quot;RTB&quot; film\n\nDeze Torrent-naam heeft de navolgende betekenis:\n\nSkyline is de naam van de film\n\n[2010] is het jaar dat de film werd uitgebracht\n\nRTB staat voor 'Ready To Burn' \n\n1080p staat voor resolutie van de film\n\nBluRay staat voor BluRay\n\nNL.Sub staat voor Nederlandse ondertiteling\n\nCBCS.SH@R staat voor uploader\n\nDe bedoeling is dat, nadat je deze film hebt gedownload, het complete bestand kan 'slepen' naar je brandprogramma (bijvoorbeeld 'Nero'), waarna je de film op je eigen televisie kan zien met behulp van je DVD speler.\n\nWij willen graag weten wat jullie ervaring is bij het downloaden, het branden van de film en het zien van de film op jullie televisie (of computer) en of wij hier mee door moeten gaan.\n\nWe zitten wel in een testfase en daarom is je mening (liefst in het Nederlands) voor ons erg belangrijk.\n\nDus na het downloaden NIET afhaken maar zoveel mogelijk blijven 'seeden' zodat anderen dezelfde film sneller kunnen binnenhalen en hun commentaar kunnen geven.\nNa ongeveer 50 reacties (30 dagen na de upload) zullen wij bekijken of het zinvol is om hiermee door te gaan.\n\nOp dit moment is het (nog) niet mogelijk de film als zodanig nog beter te krijgen dan wat wij al hebben geupload als MP4 of AVI.\n\nIndien er al positieve reacties binnenkomen, zullen wij nog 3 films (Nederlands ondertiteld) op deze manier presenteren, t.w. 300 en Sarahs Key.\n\n\n\nSkyline (2010)\n\n94 min  -  Action | Sci-Fi | Thriller   -  3 February 2011 (Netherlands)\n\nJarrod and his pregnant girlfriend Elaine travel to Los Angeles to meet his old friend and successful entrepreneur Terryand his wife Candice... See full summary Ã‚Â»\n\nDirectors: \nColin Strause, Greg Strause\n\n Writers: \nJoshua Cordes, Liam O'Donnell\n \nStars:\n Eric Balfour, Donald Faison and Scottie Thompson \n\nStoryline\n\nJarrod and his pregnant girlfriend Elaine travel to Los Angeles to meet his old friend and successful entrepreneur Terryand his wife Candice. Terry gives a party in his apartment for Jarrod and offers a job position to him in LA. Terry's assistant and lover Denise (Crystal Reed) and his friend Ray (Neil Hopkins) sleep in the couch in the living room, but in the dawn of the next morning, the group is awakened by mysterious beams of blue light. Ray stares at the light and is taken by the mysterious force. The group of friends try to escape from the alien invaders.\n","torrent":{"xt":"urn:btih:4ef6be7e9b582ed539c8d453df40d7f402c5ee18","amp;dn":"Skyline++%5B2010%5DRTB.NL.Sub.CBCS.SH%40R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef6be7e9b582ed539c8d453df40d7f402c5ee18","infoHashBuffer":{"type":"Buffer","data":[78,246,190,126,155,88,46,213,57,200,212,83,223,64,215,244,2,197,238,24]},"announce":[],"urlList":[]}}