{"title":"Coast To Coast Am - 08-13-10 - Weird News &amp; Friday The 13th Open","uid":5765321,"size":53598284,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:52b2e4765c7388d336dbca0f3815a5e11a5ce5b6&amp;dn=Coast+To+Coast+Am+-+08-13-10+-+Weird+News+%26+Friday+The+13th+Open&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1281880332,"description":"Coast To Coast Am - 08-13-10 - Weird News &amp; Friday The 13th Open Lines\n\nDate:\n 08-13-10\n \nHost:\n George Noory\n \nGuests:\n Buck Wolf, Open Lines \n \n\n\nDuring the first half of the program, George welcomed Buck Wolf (book link), a senior correspondent at AOL News specializing in weird news, who shared some of the offbeat stories he has worked on over the course of his career. Wolf reported on a 60-year-old man, Gary Duschl, who has been building a chain of chewing gum wrappers since he was 14 (article). The chain is now 12 miles long, twice the height of Mount Everest, he added. Wolf talked about his story on the New York Towers (article), an all-dwarf basketball team. According to Wolf, the small athletes play on a regulation size court and have no trouble reaching the basket. Wolf has also looked into the peculiar things hockey players do with the Stanley Cup (article). \n\nWolf discussed the time he met with Julia Gnuse, recognized by Guinness as the World's Most Tattooed Woman (article). About 95% of Gnuse's body is covered in an ink tapestry of 400 or so tattoos, only two of which she regrets getting, he said. In addition, Wolf recalled being cursed by a Wicca high priestess, his battle to unmask the original Bozo the Clown (article), the time he accompanied the late King of Pop, Michael Jackson, on his first visit to a synagogue (article), as well as his 3000-mile bike trek across the United States. Wolf said one of the best experiences of his life occurred during that trip, when police in Spearman, Texas, booked him for vagrancy so he could spend the night in jail instead of sleeping outside in a park. \n\nFriday the 13th Open Lines\nThe last two hours featured Friday the 13th Open Lines. Mike, a former U.S. soldier in Austin, Texas, told George about his best friend Josh, who died while they were serving together in Germany, just two weeks before he was to be married. Mike said several years later a woman with psychic abilities approached him with an after death communication from Josh. The psychic told Mike that Josh had been watching over him as a guardian angel, ever since the funeral, and had prevented him from jumping off a cliff in Germany, as well as protected him from being blown up in Somalia -- two things she could not have known, Mike noted. \n\nCatherine from St. Louis, Missouri, shared the paranormal circumstances surrounding the death of a male high school friend. According to Catherine, the friend appeared in a dream one night and asked her to come with him. When she finally awoke from the dream it was 2:31am -- the precise time he had been killed in a car crash, Catherine later found out. Scarlet in Nashville, Tennessee, remembered a strange coincidence in Key West, where she was vacationing with her family. The power had mysteriously blacked out in their section of hotel for four minutes, she noted. Shortly after it was restored, Scarlet's family received a phone call from an aunt whose little boy had been dead for the same 4-minute period before being successfully resuscitated. \n\n\nBook(s):\n-The Wolf Files: Adventures in Weird News","torrent":{"xt":"urn:btih:52b2e4765c7388d336dbca0f3815a5e11a5ce5b6","amp;dn":"Coast+To+Coast+Am+-+08-13-10+-+Weird+News+%26+Friday+The+13th+Open","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52b2e4765c7388d336dbca0f3815a5e11a5ce5b6","infoHashBuffer":{"type":"Buffer","data":[82,178,228,118,92,115,136,211,54,219,202,15,56,21,165,225,26,92,229,182]},"announce":[],"urlList":[]}}