{"title":"Wel L A (VHS) [1976] Alan Rudolph","uid":6392230,"size":1049652948,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:53d3b9cd9929e08e51fc0979cdfba515186b9877&amp;dn=Wel+L+A+%28VHS%29+%5B1976%5D+Alan+Rudolph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1305389438,"description":" &lt;a href=&quot;http://bayimg.com/baIFeaadB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/baIFeaadB&lt;/a&gt;\n\nWelcome to L.A. (1976) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0076910/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0076910/&lt;/a&gt;\n\nWelcome to L.A. is a 1976 film directed by Alan Rudolph and starring Keith Carradine.\n\n  Keith Carradine  ...  Carroll Barber  \n  Sally Kellerman  ...  Ann Goode  \n  Geraldine Chaplin  ...  Karen Hood  \n  Harvey Keitel  ...  Ken Hood  \n  Lauren Hutton  ...  Nona Bruce  \n  Viveca Lindfors  ...  Susan Moore  \n  Sissy Spacek  ...  Linda Murray  \n  Denver Pyle  ...  Carl Barber  \n  John Considine  ...  Jack Goode  \n  Richard Baskin  ...  Eric Wood  \n  Allan F. Nicholls  ...  David Howard  \n  Cedric Scott  ...  Faye  \n  Mike Kaplan  ...  Russell Linden (as Mike E. Kaplan)  \n  Diahnne Abbott  ...  Jeannette Ross  \n\nThe theme of romantic despair and shallowness is displayed utilizing a La Ronde-like circle of sexual adventures and failed affairs centered around songwriter Carroll Barber, played by Keith Carradine, which spread out through the city. Barber is an aloof womanizer who cannot commit or love and is used by Alan Rudolph to illustrate the loneliness inherent in big-city life. The film features a continual score by Richard Baskin, present throughout, and features among its cast Sally Kellerman as a lonely real estate agent, Geraldine Chaplin, as a Valley housewife addicted to taxi rides, Lauren Hutton as the mistress of a wealthy man (Carroll's father), Sissy Spacek as a southern housekeeper, and Harvey Keitel as a troubled business man.\n\nCarradine's character is a songwriter of mediocre talent, who is nonetheless supported financially, with enthusiasm, by his wealthy father Denver Pyle. An inveterate womanizer, he has affairs with Kellerman, the real estate agent who found his apartment, and whose husband, a successful businessman, covets their maid (Spacek). He also beds Chaplin, the wife of Keitel, who is the C.O.O. of his dad's successful dairy business. Keitel fancies Kellerman. He also includes his father's mistress (Hutton) among his conquests. Kellerman sends her maid, Spacek, to clean his apartment, which she does &quot;topless.&quot; However, despite this, theirs is the only male-female relationship in the film which is platonic, and although weird, in the context of this story, the most &quot;normal.&quot;\n\nLike padrone Robert Altman, Alan Rudolph sees filmmaking as jazz visualized, though where the former is interested in the genre's form, the latter is fascinated by its emotional intimations, while Altman's camera charts the filmic equivalent of jazz's improvisatory slipperiness, Rudolph's takes the music's expressive unpredictability as a template for his characters' forlorn relationships. This yearners-on-the-prowl mosaic, Rudolph's first official feature (he disowns Premonition, his not-uninteresting 1972 horror effort), sets the pattern for his later, more stylized roundelays: people struggling to connect, flakiness as spiritual mobility, an ineffably, floatingly satirical romanticism. The City of Angels here is, like Chantal Akerman's Brussels, a metropolis of ephemeral connections -- all &quot;daydreams and traffic,&quot; according to Sally Kellerman, one of the various Angelenas who pass through the hands of moody, beatnik-whiskered songwriter Keith Carradine in the course of the recording of an album. (The others include married socialite Geraldine Chaplin, photographer Lauren Hutton, maid Sissy Spacek, and music agent Viveca Lindfors.) The loneliness of the characters emphasizes Rudolph's sensibility to the transience of love, feelings in constant flux which can split or reconnect relationships with a single gesture. In fact, the film's center lies in Chaplin's seesawing marriage to Harvey Keitel, which, upon Carradine's entrance, turns triangular and clarifyingly unstable. If the film isn't nearly as successful as Choose Me or The Moderns, it's because, for all the mirrors and references to Garbo, the L.A. setting is too literal for the characters' stylized demands. Still, it has its place as the anti-Shampoo, its irony of a time stuck between effervescent '60s and sterile '80s.\n","torrent":{"xt":"urn:btih:53d3b9cd9929e08e51fc0979cdfba515186b9877","amp;dn":"Wel+L+A+%28VHS%29+%5B1976%5D+Alan+Rudolph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53d3b9cd9929e08e51fc0979cdfba515186b9877","infoHashBuffer":{"type":"Buffer","data":[83,211,185,205,153,41,224,142,81,252,9,121,205,251,165,21,24,107,152,119]},"announce":[],"urlList":[]}}