{"title":"skin true story DD5.1 NL Subs PAL --TBS","uid":6476594,"size":4154498967,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:53d9aa1ff45c3f5edd5b710db13832a0770633eb&amp;dn=skin+true+story+DD5.1+NL+Subs+PAL+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1308330345,"description":"Skin true story DD5.1 NL Subs PAL\n\n\n\nVerenigd Koninkrijk / Zuid-Afrika\nDrama\n107 minuten\n\ngeregisseerd door Anthony Fabian\nmet Sophie Okonedo, Sam Neill en Alice Krige\n\nSandra Laing groeit op in het door apartheid verdeelde Zuid-Afrika. Ze wordt in de jaren vijftig geboren als het zwarte kind van twee blanke Afrikaners, die niet wisten dat ze zwarte voorouders hadden. Ze voeden haar op als hun 'blanke' dochtertje, maar op haar tiende wordt Sandra uit de blanke gemeenschap gestoten. De film volgt haar dertig jaar durende strijd om een eigen plek te veroveren in een veranderende wereld. Naar een waargebeurd verhaal.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/56152&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/56152&lt;/a&gt;\n\nTen year-old Sandra has distinctly African-looking features. Her parents, Abraham and Sannie, are white Afrikaaners, unaware of their black ancestry. They are shopkeepers in a remote area of the Eastern Transvaal and, despite Sandra's mixed-race appearance, have lovingly brought her up as their white little girl. Sandra is sent to a boarding school in the neighbouring town of Piet Retief, where her (white) brother Leon is also studying, but parents and teachers complain that she doesnt belong. She is examined by State officials, reclassified as Coloured, and expelled from the school. Sandra's parents are shocked, but Abraham fights through the courts to have the classification reversed. The story becomes an international scandal and media pressure forces the law to change, so that Sandra becomes officially White again.\n\nBy the time she is 17, Sandra realises she is never going to be accepted by the white community. She falls in love with Petrus, a black man and the local vegetable seller, and begins an illicit love affair. Abraham threatens to shoot Petrus and disown Sandra. Sannie is torn between her husband's rage and her daughter's predicament. Sandra elopes with Petrus to Swaziland. Abraham alerts the police, and has them arrested and put in prison. Sandra is told by the local magistrate to go home, but she refuses.\n\nNow Sandra must live her life as a black woman in South Africa for the first time, with no running water, no sanitation, and little income. She and Petrus have two children, and although she feels more at home in this community, she desperately misses her parents and yearns for a reunion. After many more years of hardship and struggle, the chances of that reunion ever happening seem remote. slide, but the boy is determined to help his father and seek out the real culprit.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0964586&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0964586&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.skinthemovie.net/site/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.skinthemovie.net/site/&lt;/a&gt;\n\n\nSpotinformatie\n\n\nBron             : Retail\nAudio            : Engels DD5.1\nSubs             : NL\nBeeldverhouding  : 16:9\nFramerate        : 25,000 fps\nStandaard        : PAL\nMenu             : Ja\nExtra's          : Ja","torrent":{"xt":"urn:btih:53d9aa1ff45c3f5edd5b710db13832a0770633eb","amp;dn":"skin+true+story+DD5.1+NL+Subs+PAL+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53d9aa1ff45c3f5edd5b710db13832a0770633eb","infoHashBuffer":{"type":"Buffer","data":[83,217,170,31,244,92,63,94,221,91,113,13,177,56,50,160,119,6,51,235]},"announce":[],"urlList":[]}}