{"title":"Hey Monday - I Don't Wanna Dance (Xvid-2nafish)1080p","uid":5814736,"size":216683878,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54387f95e4cd39302ed9c1fb1ae31e4a4b15dfed&amp;dn=Hey+Monday+-+I+Don%5C%27t+Wanna+Dance+%28Xvid-2nafish%291080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283734344,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:59\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 6927 Kbps\nQuality Factor : 0.14 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\nBeneath It All is the first EP by pop punk band Hey Monday. On June 23, Hey Monday announced the album name, track listing, as well as deluxe and standard editions of the Album. The music video for 'I Don't Wanna Dance' was shot on June 24. On July 23rd, 2010 Cassadee Pope posted on the official website that it would no longer be an album but a 6-song CD EP (and a 7-song EP on iTunes). She also said that a full length album would follow in early 2011. I Don't Wanna Dance  was released on July 27th, 2010, and the video premiered on MTV July 29th. On August 12, 2010, Hey Monday, Jersey, and Cassadee tweeted that the album was streaming on their MySpace page. Patrick McKenzie did not record the drums for this EP. Instead, Stacy Jones played the drums. The album debuted on The Billboard 200 at #25 selling 14,494 copies in its first week.\n\n&quot;I Don't Wanna Dance&quot; was released as the first single on July 27th. The video premiered the following Thursday on MTV. It was released as the iTunes free single of the week. As of September 3rd, it reached #7 on the &quot;iLike Libraries: Most Added&quot;.\n\nThe music video premiered on July 29th, 2010 and was directed by Petro Papahadjopoulos. It starts out with Hey Monday walking up to the stage, and seemingly performing a concert as the lyrics follow the &quot;take me home&quot; intro. Cassadee Pope is dressed in a black, strapless minidress with hot pink leggings. As the verse begins, it goes to the POV of her love interest; it is shot through his eyes. They begin on good terms, having fun at a concert but he soon leaves to flirt with other girls. During the bridge, her friends inform her of this and she mouths in sync with the lyrics, &quot;You'll never take me home&quot;. At the end of the video, Pope stands still, glaring at him, while the rest of the females swarm around her and chase him away.\n\nHey Monday is an American pop rock trio from West Palm Beach, Florida, formed in 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:54387f95e4cd39302ed9c1fb1ae31e4a4b15dfed","amp;dn":"Hey+Monday+-+I+Don%5C%27t+Wanna+Dance+%28Xvid-2nafish%291080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54387f95e4cd39302ed9c1fb1ae31e4a4b15dfed","infoHashBuffer":{"type":"Buffer","data":[84,56,127,149,228,205,57,48,46,217,193,251,26,227,30,74,75,21,223,237]},"announce":[],"urlList":[]}}