{"title":"1- Keroro llega a la Tierra Y Se presenta el Sargento Keroro. by","uid":6327351,"size":241512448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:546c76f4acc8c2a7d254b2838fbefeef12302608&amp;dn=1-+Keroro+llega+a+la+Tierra+Y+Se+presenta+el+Sargento+Keroro.+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gaditano_cc","files":1,"time":1303155245,"description":"Keroro llega a la Tierra: Un chico de 12 aÃƒÂ±os llamado Fuyuki Hinata tiene un sueÃƒÂ±o en el que una tropa de ranas alienÃƒÂ­genas conquista el planeta. Natsumi, su hermana, para despertarle le dice que en la pared hay un alien (en broma) pero luego resulta que sÃƒÂ­ que lo hay. Cogen a ese alienÃƒÂ­gena verde con aspecto de rana deforme llamado Keroro y lo atan mientras estÃƒÂ¡n en el colegio mientras que Fuyuki se lleva al colegio la Kero-bola del alienÃƒÂ­gena para utilizarla. Mientras tanto, se desata y tiende una trampa a Natsumi cuando viene del colegio. Cuando los dos estaban perdidos llega Aki, la madre y Fuyuki y Natsumi advierten a Keroro que ella podÃƒÂ­a diseccionarle o atropellarle con el coche. Fuyuki dice al sargento que podÃƒÂ­an ser amigos, a lo que Keroro rechaza indirectamente. Finalmente cuando recibe un mensaje de la comandancia que dice que lo abandonan, acepta la propuesta de Fuyuki y son amigos. \nSe presenta el Sargento Keroro: Keroro, ya acoplado en casa de los Hinata, piensa que tiene que tener una habitaciÃƒÂ³n para dormir ya que pasarÃƒÂ¡ allÃƒÂ­ mucho tiempo. Aki le dice que tiene una habitaciÃƒÂ³n en el sÃƒÂ³tano, debajo de la escalera y les cuenta a Fuyuki y Natsumi que esa casa estÃƒÂ¡ construida sobre una cÃƒÂ¡rcel. Keroro le pide a Fuyuki la Kerobola y convierte su habitaciÃƒÂ³n, un cuarto lleno de telaraÃƒÂ±as y barriles viejos en una habitaciÃƒÂ³n pintoresca donde hay de todo: internet, videojuegos, maquetas, mÃƒÂºsica... y ademÃƒÂ¡s descubren que allÃƒÂ­ yace una fantasmita ademÃƒÂ¡s.","torrent":{"xt":"urn:btih:546c76f4acc8c2a7d254b2838fbefeef12302608","amp;dn":"1-+Keroro+llega+a+la+Tierra+Y+Se+presenta+el+Sargento+Keroro.+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"546c76f4acc8c2a7d254b2838fbefeef12302608","infoHashBuffer":{"type":"Buffer","data":[84,108,118,244,172,200,194,167,210,84,178,131,143,190,254,239,18,48,38,8]},"announce":[],"urlList":[]}}