{"title":"Deadliest Wariors (1st &amp; 2nd Seasons Complete) HDTV","uid":5797744,"size":8651151505,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5511d10dbe9eceeb34e53ed55353ff99530a2bbd&amp;dn=Deadliest+Wariors+%281st+%26+2nd+Seasons+Complete%29+HDTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"abbas_nasir","files":31,"time":1283134761,"description":"Deadliest Warrior is a television program in which information on historical or modern warriors and their weapons are used to determine which of them is the &quot;deadliest&quot; based upon tests performed during each episode. The show is characterized by its use of the data compiled in creating a dramatization of the warriors' battle to the death.\n\nThe show is hosted by three commentators: Geoff Desmoulin (biomedical scientist and high speed camera operator),[3] Dr. Armand Dorian (medical consultant), and Max Geiger (simulations programmer). All three provide commentary throughout the show, as well as technical details of each weapons test. The show is narrated by Drew Skye.[4]\n\nSeason two had 13 episodes and began airing on April 20, 2010, with the last episode airing on July 27, 2010.[5]\n\nThe show was originally developed by Morningstar Entertainment, and has since moved to production company 44 Blue.[6] The Show Runner (Senior Producer) in the first season was Tim Prokop. Tim Warren became the show runner during the second season and has continued with the show during its move to 44 Blue. Historical Advisor and Associate Producer in the Second Season is Barry Jacobsen.\n\nThe show has been renewed for a third season. Season 3 will start in Summer 2011\n","torrent":{"xt":"urn:btih:5511d10dbe9eceeb34e53ed55353ff99530a2bbd","amp;dn":"Deadliest+Wariors+%281st+%26+2nd+Seasons+Complete%29+HDTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5511d10dbe9eceeb34e53ed55353ff99530a2bbd","infoHashBuffer":{"type":"Buffer","data":[85,17,209,13,190,158,206,235,52,229,62,213,83,83,255,153,83,10,43,189]},"announce":[],"urlList":[]}}