{"title":"AnyPic Image Resizer Pro 1.2.6 Build 2898 registered version{fie","uid":6460335,"size":5495764,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:561e8480e2390f3580d43278533722ae7ab93fd3&amp;dn=AnyPic+Image+Resizer+Pro+1.2.6+Build+2898+registered+version%7Bfie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"AUDI-A4","files":1,"time":1307735136,"description":"\n\n\n\nResize, convert, add watermark to hundreds of images in batch mode\n\nAnyPic Image Resizer Pro is a professional image resizer and converter that features support for the most popular image formats: JPEG, BMP, PNG, TIFF, PSD, GIF, TGA, RAW, and others.\n\nIt's a fast and easy-to-use image conversion tool for both amateur and professional photographers to deal with digital photos, with one click your digial photos will be just right for the Web, blog, e-mail, photo printing, Facebook, MySpace, mobile phone. It's a totally free program.\n\nHere are some key features of &quot;AnyPic Image Resizer Pro&quot;:\n\nAutomatic, Fast, Easy to Use:\nÃ‚Â· Convert hundreds of images at a time with just a few mouse clicks.\nÃ‚Â· Convert images with super high speed, support multi-core processing.\nÃ‚Â· Both amateur and professional photographers can deal with digital photos easily.\n\nResize Image for Any Use:\nÃ‚Â· Resizing image for any different use, such as for Web, e-mail, photo printing, Facebook, MySpace, mobile phone, etc.\nÃ‚Â· Three compression choices are provided to meet your demand of image quality.\n\nSupport Hundreds Formats:\nÃ‚Â· Convert between many different image file formats.\nÃ‚Â· It supports the most popular image formats: BMP, JPEG, TIFF, RAW, PNG, GIF, TGA, and PSD, and almost all image formats.\n\nBatch Conversion:\nÃ‚Â· Convert thousands of files at once in batch mode.\nÃ‚Â· Convert multiple image files from different formats to desired format in one time with a few mouse clicks.\n\nOutput Images with Highest Quality:\nÃ‚Â· Do not damage the accuracy and quality of original image.\nÃ‚Â· Retain Color Profile, EXIF, IPTC, GPS information.\n\nWatermark for Image Copyright Protection:\nÃ‚Â· Add image watermark.\nÃ‚Â· Add text watermark to image, the font can be edited, and the outline effect can be added.\nÃ‚Â· Fully control the parameters of watermark such as position, size and rotation, etc.\nÃ‚Â· Position and size of watermark adapts to different sizes of images automatically.\n\nAdjust Image Effects in Batch:\nÃ‚Â· Adjust image brightness, contrast and saturation in batch to make your images look more special.\nÃ‚Â· Shows preview of new image as the setting is adjusted.\nÃ‚Â· Provide some parameters adjustment for each format.\nÃ‚Â· Rotate images.\n\nTime-Saving Profile:\nÃ‚Â· Save operations that you usually use as profiles and bring convenience with you in the future.\nÃ‚Â· Preset a wide range of commonly used profile, such as for Web, blog, e-mail, photo printing, Facebook, MySpace, mobile phone, etc.\n\nRequirements:\n\nÃ‚Â· Pentium\nÃ‚Â· 133 MHz\nÃ‚Â· 128MB RAM\n\nLimitations:\n\nÃ‚Â· Watermark on the output\nÃ‚Â· Nag screen\n\n\n\n","torrent":{"xt":"urn:btih:561e8480e2390f3580d43278533722ae7ab93fd3","amp;dn":"AnyPic+Image+Resizer+Pro+1.2.6+Build+2898+registered+version%7Bfie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561e8480e2390f3580d43278533722ae7ab93fd3","infoHashBuffer":{"type":"Buffer","data":[86,30,132,128,226,57,15,53,128,212,50,120,83,55,34,174,122,185,63,211]},"announce":[],"urlList":[]}}