{"title":"Toxiants and Other Natural Toxicants ","uid":5801853,"size":52520975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:565948e63523ee41b5784007635bc9732e249fca&amp;dn=Toxiants+and+Other+Natural+Toxicants+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"philmccrevice","files":1,"time":1283289667,"description":"Toxic plants and other natural toxicants have a variety of roles in the fields of human health, medical research and the production of safe food and also represent an economic problem in terms of animal health and crop production. Estimates of economic impact on livestock have ranged in the millions of dollars in countries such as Australia and the United States. This book brings together applied and fundamental research from botanists, chemists, biochemists, agricultural scientists, veterinarians and physicians and advice from regulatory bodies. It consists of more than 100 edited papers from the Fifth International Symposium on Poisonous Plants, held in Texas in May 1997. All aspects of poisonous plants, mycotoxicoses and herbal intoxications are covered. Their adverse effects are described, such as fatalities, reduced or failed reproduction, fetotoxicity, spontaneous abortions, deformities, reduced productivity and organ-specific toxicity. Methods of detection, isolation and identification of the chemical compounds responsible are included. The biochemistry of the plant-associated toxins and elucidation of their mechanism of action is investigated, including the protocols for management or eradication, immunization programs, behaviour modification, withholding periods for metabolic detoxification, regulatory advice concerning human usage of natural products and advice concerning toxin-residue in agricultural produce. The development of non-toxic strains of plants for use as fodder is also discussed. This book is essential reading for toxicologists concerned with animal and human health, food industry regulators and plant scientists","torrent":{"xt":"urn:btih:565948e63523ee41b5784007635bc9732e249fca","amp;dn":"Toxiants+and+Other+Natural+Toxicants+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"565948e63523ee41b5784007635bc9732e249fca","infoHashBuffer":{"type":"Buffer","data":[86,89,72,230,53,35,238,65,181,120,64,7,99,91,201,115,46,36,159,202]},"announce":[],"urlList":[]}}