{"title":"Wess Mongomery - Complete Live in Paris CD 2 of 2 (1965) [Jazz][","uid":5785904,"size":118400147,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:569c2d3e5553e8fe22ef143ee5e388c9b8b2feb7&amp;dn=Wess+Mongomery+-+Complete+Live+in+Paris+CD+2+of+2+%281965%29+%5BJazz%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"schon55","files":10,"time":1282625321,"description":"Wess Mongomery - Complete Live in Paris CD 2 of 2 \nOriginal Release Date: December 2, 2003 \nAudio CD: April 5, 2004 \nFormat: Import, Live, Original recording remastered \nLabel: Definitive Spain \nQuality: CBR 320 kbps\n\nNow I know what it feels like to discover an unknown Renoir work, although to be fair a friend from the West Coast turned me on to this. Released this year, Wes in Paris - Live - in 1965, is a treasure chest. Recorded right in the middle of his 'change-over' period, Wes is so appreciative of this Paris venue and audience that he gives them his best, ever.  A 2 Disc set with outrageous sound, this one completes a trilogy of Live Wes that includes &quot;Smokin' At The Half Note&quot;, &quot;Full House&quot;, and now this INCREDIBLE performance.  The personnel are: Harold Mabern, piano; Arthur Harper, bass; Jimmy Lovelace, drums and a special treat - Johnny Griffin on 3 tracks, including the showstopping &quot;Full House&quot; track (listen to the audience and Wes' audible response to this kind of appreciation, whilst he was being skewered for 'selling out' in his own country).  The groove laid down is a little more &quot;classic&quot; jazz, and maybe a bit less &quot;groove-oriented&quot; than Wynton Kelly's Trio, but it matters not one bit.  It's more Wes, and Live no less! Wait until word gets around about this ~ douglas negley\n\nWes is admittedly more &quot;aggressive&quot; in his playing on this occasion, partly due to his band mates and the nature and length of the program.  Unlike the grooving, always &quot;in the pocket,&quot; rhythm section of &quot;Smokin' at the Half Note&quot; (Kelly, Chambers, Cobb), the Harold Mabern-led rhythm section gives the music a forward edge, or emotive quality, suggestive of Coltrane and McCoy.  The result is often music based on tension and release rather than melodic inventiveness - leading to some purely &quot;physical&quot; playing and grandstanding on the parts of Mabern and tenor saxophonist Johnny Griffin (the two ballads opening the second disk are my favorite moments of the concert). \n\nThe audio is acceptable - and thankfully the balance favors Wes' guitar, which sounds as &quot;fat&quot; and consistent as ever.  But I suspect this recording won't wear as well with me and other non-guitarists as his meetings with Wynton Kelley, Milt Jackson, and Jimmy Smith, not to mention the classic Riverside studio albums.  If there were more of Wes on record, I'd give this one 4 stars.  Pick it up only if you have &quot;Smokin',&quot; &quot;Full House,&quot; and &quot;The Incredible Artistry.&quot; ~ Samuel Chell\n\nPersonnel:\nWes Montgomery (guitar)\nHarold Mabern (piano)\nArthur Harper (bass)\nJimmy Lovelace (drums)\nJohnny Griffin (tenor sax on CD2 #3-5)\n\nWess Mongomery - Complete Live in Paris CD 1 of 2 \n1  Four on Six\n2  Twisted Blues\n3  Impressions\n4  To When\n5  Jingles\n\nWess Mongomery - Complete Live in Paris CD 2 of 2 \n1  The Girl Next Door\n2  Here's That Rainy Day\n3  Round About Midnight\n4  Full House\n5  Blue and Boogie/West Coast Blues\n\nsuzzo","torrent":{"xt":"urn:btih:569c2d3e5553e8fe22ef143ee5e388c9b8b2feb7","amp;dn":"Wess+Mongomery+-+Complete+Live+in+Paris+CD+2+of+2+%281965%29+%5BJazz%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569c2d3e5553e8fe22ef143ee5e388c9b8b2feb7","infoHashBuffer":{"type":"Buffer","data":[86,156,45,62,85,83,232,254,34,239,20,62,229,227,136,201,184,178,254,183]},"announce":[],"urlList":[]}}