{"title":"Democracy Now - 10 jun 2011","uid":6459960,"size":453134492,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:57de9b403943c4866a9cc753de3690ee574f025c&amp;dn=Democracy+Now+-+10+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1307724790,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 10, 2011\n\n- NSA Whistleblower Thomas Drake Reaches Plea Deal in Setback for Admin Crackdown\n- NATO, Gaddafi Forces Launch New Attacks\n- U.N. Human Rights Panel Hears Allegations of Gaddafi Crimes\n- Panetta Expects Iraq Request for Prolonged Occupation\n- Gates Chides NATO on Military Spending\n- Syrian Forces Move on Restive Town\n- Alabama OKs Harshest Anti-Immigrant Law in U.S.\n- Manning Supporter Subpoenaed in WikiLeaks Case\n- Gingrich Staffers Resign En Masse\n\n\nSpecial reports\n\n- As Japan Nuclear Crisis Worsens Citizen-led Radiation Monitors Pressure Govt to Increase Evacuations\n\n    Almost three months after the earthquake and tsunami that triggered a nuclear disaster in Japan, new radiation \\&quot;hot spots\\&quot; may require the evacuation of more areas further from the damaged Fukushima Daiichi nuclear power facility. Japan\\'s Nuclear and Industrial Safety Agency recently admitted for the first time that full nuclear meltdowns occurred at three of the plant\\'s reactors, and more than doubled its estimate for the amount of radiation that leaked from the plant in the first week of the disaster in March. \\&quot;What they failed to mention is that they discharged and equally large amount into the ocean,\\&quot; says our guest Robert Alvarez, former senior policy adviser to the U.S. Secretary of Energy. \\&quot;As [the radiation] goes up the food chain, it accumulates. By the time it reaches people who consume the food, the levels are higher than originally when they entered the environment.\\&quot; We also go to Tokyo to speak with Aileen Mioko Smith, Executive Director of the group Green Action. She says citizens leading their own monitoring efforts and are calling for additional evacuations, especially for young children and pregnant women.\n\n\n- Dale Mahridge\\'s Chronicles of Widely Ignored U.S. Working Poor Inspire Music of Bruce Springsteen\n\nDale Maharidge, a Pulitzer Prize-winning journalist and author, inspired Bruce Springsteen to write the songs \\&quot;Youngstown\\&quot; and \\&quot;The New Timer\\&quot; with his first book, \\&quot;Journey to Nowhere: The Saga of the New Underclass.\\&quot; Maharidge\\'s most recent book, \\&quot;Someplace Like America: Tales from the New Great Depression,\\&quot; is a reported retrospective on his 30 years of covering the working poor and chronically unemployed. He and photographer Michael Williamson traveled more than half a million miles around the United States, reporting the story of how worker\\'s lives have gotten steadily worse. We speak to Maharidge about his work and how it came to inspire some of Springsteen\\'s most notable socially conscious songs.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:57de9b403943c4866a9cc753de3690ee574f025c","amp;dn":"Democracy+Now+-+10+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57de9b403943c4866a9cc753de3690ee574f025c","infoHashBuffer":{"type":"Buffer","data":[87,222,155,64,57,67,196,134,106,156,199,83,222,54,144,238,87,79,2,92]},"announce":[],"urlList":[]}}