{"title":"Fugazi - The Argument (2001) [FLAC] politux","uid":5773480,"size":294593915,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:594058d7d17bd3fab02e3ef15bd2f17cecd73603&amp;dn=Fugazi+-+The+Argument+%282001%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"politux","files":-1,"time":1282192175,"description":"Its unfortunate that a band so forward looking as Fugazi has been criticized over and over for not remaking &quot;Waiting Room&quot; or &quot;Repeater.&quot; Some have called them sellouts, regardless of the bands integrity and class, while others consider them elitists, &quot;guiding&quot; the Washington, D.C., scene. This could not be further from the truth. As the film and soundtrack to Instrument proved, this is a band that is only concerned with musical growth, with each album improving on its predecessor. But no album they have put together has the jump ahead that The Argument has. Being both ear-shattering and spine-tingling at once, this is Fugazi at their &quot;musical&quot; best. Incorporating melody with texture and their signature angular approach, the band has raised the bar for themselves and others once again. The first &quot;full&quot; track, &quot;Cashout&quot; (an anti-gentrification anthem), is classic stuff, with a subtle guitar line exploding into a screaming chorus, but this time there is less of an emphasis on the screaming and more on the gentle melody of the verse. Slower tracks like &quot;The Kill&quot; and &quot;Life and Limb&quot; touch on strange new territory. Gentle with sense of swagger, these songs lack none of the power that the band is known for, while the two-drum assault of &quot;Ex-Spectator&quot; (courtesy of Brendan Canty and second drummer Jerry Busher) has just as much potency on disc as it does live. And the final song, &quot;Argument,&quot; with its rolling guitar lines, dreamy breakdown, and vocals that build from gentle to screaming, may be the best closer on a Fugazi record since &quot;Promises.&quot; Listeners may be surprised to hear strings open up the record, or piano guiding the brilliant &quot;Strangelight,&quot; but this is the album that proves once and for all that Fugazi has become a purely musical force.\n\nFifteen years in and Fugazi is still progressing. It makes one wonder what they're capable of in the future.\n\nSource: CD\nReleased: 2001\nLabel: Dischord\nGenre: Rock\nStyle: Post Hardcore\nQuality: FLAC\n\nTracks:\n\n  1. Untitled\n  2. Cashout\n  3. Full Disclosure\n  4. Epic Problem\n  5. Life and Limb\n  6. The Kill\n  7. Strangelight\n  8. Oh\n  9. Ex-Spectator\n  10. Nightshop\n  11. Argument","torrent":{"xt":"urn:btih:594058d7d17bd3fab02e3ef15bd2f17cecd73603","amp;dn":"Fugazi+-+The+Argument+%282001%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594058d7d17bd3fab02e3ef15bd2f17cecd73603","infoHashBuffer":{"type":"Buffer","data":[89,64,88,215,209,123,211,250,176,46,62,241,91,210,241,124,236,215,54,3]},"announce":[],"urlList":[]}}