{"title":"Billy Ray Cyrus - Back To Tennessee (2nafish)","uid":5792800,"size":186486788,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5be09df7d76da2bd9a880ce5035e9ab440d6e2b6&amp;dn=Billy+Ray+Cyrus+-+Back+To+Tennessee+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282915392,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no CMT logo.\n\n\n&quot;Back to Tennessee&quot; is a country song by American singer-songwriter and actor Billy Ray Cyrus. It released as the second single from Cyrus' eleventh studio album of the same name on February 2, 2009 by Lyric Street Records. Cyrus drafted the song after learning that Hannah Montana: The Movie, a film he would star in, would be set in Tennessee. The song, developed with the aid of co-songwriters Tamara Dunn and Matthew Wilder, includes country rock  elements while describing Cyrus' longing to return to the South, where he grew up, after spending several years in Los Angeles. &quot;Back to Tennessee&quot; was featured in both Hannah Montana: The Movie and its soundtrack.\n\n&quot;Back to Tennessee&quot; was well received by critics, though some felt it took the album's message too literally. It was a moderate commercial achievement for Cyrus and charted within the top fifty of the Billboard magazine chart Hot Country Songs. The song's music video was directed by Declan Whitebloom and features scenes of Cyrus at a beach inter cut with clips of Hannah Montana: The Movie. The song was performed in several venues.\n\nThe music video for &quot;Back to Tennessee&quot; was directed by Declan Whitebloom and premiered on March 12, 2009 on CMT. It was partially shot in Malibu, California, where Cyrus wrote the song. Like the song, the video represents Cyrus' desire to return home. Cyrus explained,\n\n    &quot;When I see the video for 'Back to Tennessee,' there's a lot of emotion there. It's a combination between the Hannah Montana movie and going back to the actual spot where I wrote the song. I wrote the song in Malibu, and we went back to Malibu to film the video. I had never done a video exactly where I wrote the song. Then we take my little blue truck from the movie and travel back across the country. Again, it becomes a very articulate picture of what that song's about. It's everything a video is supposed to be.&quot;\n\nCyrus's &quot;little blue truck&quot; is the blue 1990 Ford Ranger that he drove in the film, which was transported to California to be used in the video. The video prominently features clips of Hannah Montana: The Movie, particularly the scene in which Cyrus performs &quot;Back to Tennessee&quot;. Cyrus's backup band in that performance includes part of Taylor Swift's band, Bucky Covington, and Marcel.  About the video as a whole, Cyrus said, &quot;I hope when people, you know, watch the video. I hope that they can feel what this song is about. I hope they can relate to that in their life and their world.&quot;\n\nThe video commences with the Hannah Montana: The Movie performance, in which Cyrus and his backup band perform atop a stage in a crowded barn. The video then switches to its principal setting, which features Cyrus on a beach at sunset. Cyrus is seen in a black T-shirt tossing rocks at the ocean and looking at a picture of a blond woman. The woman is portrayed by Melora Hardin, who plays Lorelai, Robby Ray's love interest in Hannah Montana: The Movie. As the video progresses, Cyrus is also seen with the blue Ford Ranger, either driving it or leaning against it while playing an acoustic guitar. The video also includes clips of Lorelai, Robby Ray, Miley Stewart, and Miley Stewart's love interest, Travis Body. The video ends with Cyrus, looking down, walking next to the seashore.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5be09df7d76da2bd9a880ce5035e9ab440d6e2b6","amp;dn":"Billy+Ray+Cyrus+-+Back+To+Tennessee+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be09df7d76da2bd9a880ce5035e9ab440d6e2b6","infoHashBuffer":{"type":"Buffer","data":[91,224,157,247,215,109,162,189,154,136,12,229,3,94,154,180,64,214,226,182]},"announce":[],"urlList":[]}}