{"title":"Christina Aguilera - You Lost Me  (2nafish)","uid":5777227,"size":92522500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5d7daee23ed71600c4627020de0e3f421cbd76c3&amp;dn=Christina+Aguilera+-+You+Lost+Me++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1282304414,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;You Lost Me&quot; is a song performed by American singer Christina Aguilera. The song was the second official single and third overall from her fourth studio album Bionic. Aguilera performed the song many times before the official release of the song. The song was released on June 29, 2010 in the United States.\n\nOn July 9, 2010 Aguilera had revealed the details about the video and said that &quot;the video strips back the theatrics she is known for using in her clips.&quot; In an interview with VH1  she said &quot;I love a big production and some of my elaborate makeup styles I totally get off on,&quot;. She added &quot;But this particular song... it was really important that I interpret the simplicity of the raw emotion that takes place within the song itself and not any sort of theatrics involved.&quot; About the video, she said: &quot;You have the torn, empty mattress, the burnt up pillow cases... in the chorus whenever I say 'It feels like our world is infected'...that's exactly what we wanted to embody in the vision of the song.&quot; She explained: &quot;I'm literally being torn. When I take my shirt off it's a moment where I'm saying 'I'm taking control of the situation, I'm shedding the skin.'&quot;\n\nThe video was released on July 22, 2010 on Aguilera's official Vevo account. The video was directed by Anthony Mandler. Anthony explained about the video: &quot;From the first keys of the opening of the track, we know that we are about to watch something that is going to move and transform us.&quot; He adds &quot;In the end, we've traveled through Christina's world. One that is physical, mental and spiritually charged. Nothing is what it seems. Everything is fractured and evolving, falling away... fragile,&quot;.\n\nMonica Herrera from Billboard explained the video and said &quot; 'You Lost Me' begins with an extreme close-up of a gun barrel while Aguilera sings, &quot;I am done, Smoking gun/We've lost it all, the love is gone.&quot; The newly strawberry-blonde star wanders through a deserted bedroom and lays down in the dirt, but like a vintage Hollywood vixen, she always remains impeccably glamorous -- even while mascara streams down her cheeks&quot;. And added &quot;Hopefully for Aguilera, &quot;You Lost Me&quot; will cast those doubts aside and remind everyone of what she does best.\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5d7daee23ed71600c4627020de0e3f421cbd76c3","amp;dn":"Christina+Aguilera+-+You+Lost+Me++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7daee23ed71600c4627020de0e3f421cbd76c3","infoHashBuffer":{"type":"Buffer","data":[93,125,174,226,62,215,22,0,196,98,112,32,222,14,63,66,28,189,118,195]},"announce":[],"urlList":[]}}