{"title":"Ernst Zundel - Feldzug gegen die Offenkundigkeit des Holocausts","uid":6389331,"size":891416414,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d926d703f1c1d818754848c2930a36df371ed85&amp;dn=Ernst+Zundel+-+Feldzug+gegen+die+Offenkundigkeit+des+Holocausts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Borzoi","files":1,"time":1305302690,"description":"\nFeldzug gegen die &quot;Offenkundigkeit&quot; des Holocausts - Der historische Mannheimer Zuendel-Prozess im Jahre 2005.\n\nIm trueben Kielwasser des 11. September 2001 wurde unter strengster Geheimhaltung die Entfuehrung eines weltbekannten Dissidenten eingefaedelt und durchzogen.  Dieses politische Verbrechen geschah unter Mitwirkung von Regierungsstellen der hoechsten Ebene - Botschaften, Konsulaten und Gerichten in drei Laendern auf zwei Kontinenten !! - die sich dazu hergaben, als Handlanger eines klammheimlichen Komplottes zu fungieren.\n\nDer Mann, den man hiermit fuer alle Zeit mundtot machen wollte, heisst Ernst Zuendel.  Er gehoert zu den weltweit tapfersten Kaempfern fuer die vielbedrohte Meinungsfreiheit in den strengst zensierten europaeischen Laendern, die gerne als &quot;Demokratie&quot; auftreten.\n\nNach zwei Jahren brutaler Half in kanadischen Kerkern brachte ein Charterflugzeug Zuendel insgeheim nach Deutschland, seine Heimat - die ihn mit Handschellen in Empfang nahm und dem Mannheimer Gefaengnis und seinen gerichtlichen Schergen uebergab.  Man verweigerte Zuendel eine rechtmaessige Verteidigung und verurteilte ihn nach einem erbitterten juristischen Kampf zu fuenfjaehrige Haft.\n\nWas Ernst Zuendel Jahrzehnten hindurch sprach und schreib, war weder in Kanada noch in den USA strafbar.  In Deutschland aber hat man die Verteidigung des Deutschen Volks zu Verbrechen erklaert.  &quot;Deutsche&quot; Gesetze verbieten bis zum heutigen Tag die Erforschung und Diskussion der juengsten Geschichte - und damit die Wiederherstellung der Volksehre.\n\nIn dieser Video kommen die Verteidigungs-Rechtsanwaelte Zuendels in Mannheim zu Wort und verschaffen brisante Einblicke in die rechtliche Lage der &quot;Bundesrepublik&quot; und ihren beruechtigen &quot;Volksverhetzungs-Paragraphen&quot;, der dazu dient, die Meinungsfreiheit in Deutschland brutal zu erdrosseln...\n\nEs dauert  1:55  mit Qualitaet von  A9 / V9 \n\nWahrheit hat keine Untersuchungangst !!\n\nUND\n\nWer den Krieg gewinnt.., schreibt auch die Geschichte !!\n\nNicht wahr ??\n","torrent":{"xt":"urn:btih:5d926d703f1c1d818754848c2930a36df371ed85","amp;dn":"Ernst+Zundel+-+Feldzug+gegen+die+Offenkundigkeit+des+Holocausts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d926d703f1c1d818754848c2930a36df371ed85","infoHashBuffer":{"type":"Buffer","data":[93,146,109,112,63,28,29,129,135,84,132,140,41,48,163,109,243,113,237,133]},"announce":[],"urlList":[]}}