{"title":"Tim Finn - Escapade (1983)","uid":5793766,"size":234550536,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5dc1880a50d8c797b193d0e0ff55a6e4443acca6&amp;dn=Tim+Finn+-+Escapade+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fireman63ed","files":-1,"time":1282957523,"description":"After the release of Split Enz 1982 album Time and Tide, Tim Finn decided to give the band a break after 10 years. Younger brother Neil Finn worked on some demos for the upcoming Split Enz album, while percussionist Noel Crombie released the single My Voice Keeps Changing On Me. It was Tim's intention to take the time to work some of the new songs that he wanted to release, but felt were not Enz material. On the radio documentary Enzology Tim says that he tried some of the songs out with the band (he names Fraction Too Much Friction), but it just wasn't working.\n\nWith a break from touring and some new songs in hand, Tim decided to work with musicians outside of the Enz stable. He grew quite attached to former Beach Boys drummer Ricky Fataar who along with his partner Mark Moffatt played and produced on the album.\n\nAlong with Ricky and Mark, Tim worked with music veteran Venetta Fields whose backing vocals provided a soulful feel to the album. On various songs he worked with Australian music heavy weights such as Wilbur Wilde and Joe Camilleri.\n\nWhen released the first single Fraction Too Much Friction was a huge hit in Australia and New Zealand, and the album took off from there. Tim himself did not expect this level of success. The idea was to experiment musically away from Split Enz, get it out of his system and then come back to begin the new album.\n\nIn spite of the success and the expectation to follow up with a tour, Tim felt an obligation to Split Enz, and after 5 gigs to support the album he went back to the studio with the band to begin work on the new album to be titled Conflicting Emotions.","torrent":{"xt":"urn:btih:5dc1880a50d8c797b193d0e0ff55a6e4443acca6","amp;dn":"Tim+Finn+-+Escapade+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dc1880a50d8c797b193d0e0ff55a6e4443acca6","infoHashBuffer":{"type":"Buffer","data":[93,193,136,10,80,216,199,151,177,147,208,224,255,85,166,228,68,58,204,166]},"announce":[],"urlList":[]}}