{"title":"Isobel Campbell and Mark Lanegan...Hawk(2010)[FLAC]","uid":5772855,"size":297093250,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e13b1d85e9ce5b3fb1ac5e2a8b035fba9157290&amp;dn=Isobel+Campbell+and+Mark+Lanegan...Hawk%282010%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":17,"time":1282167305,"description":"AUGUST 2010  cd VVR740601\n\n1. We Die and See Beauty Reign  \n2. You Won't Let Me Down Again  \n3. Snake Song  \n4. Come Undone  \n5. No Place to Fall  \n6. Get Behind Me  \n7. Time of the Season  \n8. Hawk  \n9. Sunrise  \n10. To Hell &amp; Back Again  \n11. Cool Water  \n12. Eyes of Green  \n13. Lately  \n\nIsobel Campbell has worn any number of hats over the course of her remarkable decade and a half in music, from her stint as cellist and vocalist with Scottish indie-pop faves Belle and Sebastian to her role as bandleader in the Gentle Waves to her work as duet partner, arranger and producer on a series of acclaimed albums with former Screaming Trees frontman Mark Lanegan.\nYet when it came to making her latest effort, a typically gorgeous collection of atmospheric roots tunes titled Hawk, Campbell says she felt most like she was wearing another hat entirely: that of movie director.\n\n&quot;Some of my favorite bands are all about four guys in a room playing together,&quot; says the singer, who produced the album herself in a variety of locations, including Los Angeles, Texas, Louisiana, Arizona, Denmark and her native Glasgow. &quot;But I guess things are a bit more complicated with me, where I kind of assemble these groups of players to execute the things I'm hearing in my head.&quot; Campbell laughs. &quot;The older I get the more I enjoy the behind-the-scenes work in the studio, putting in ridiculously stupid hours with my engineers. I just love how everyone pitches in together.&quot;\n\nOn Hawk--a word Campbell treasures for its symbolism and dual identities as both noun and verb--her co-conspirators include longtime partner Lanegan, who lends his distinctive blues-folk growl to eight of the album's 13 tracks; the young American singer Willy Mason; and former Smashing Pumpkins guitarist James Iha, who contributes a dizzying dustbowl solo to &quot;You Won't Me Let Down Again,&quot; one of a pair of tunes here co-written by Campbell and Jim McCulloch of the Soup Dragons.\n\n&quot;When I'm imagining these sounds, I almost feel like it's my responsibility to make sure they happen in the real world,&quot; she says. &quot;I don't think anyone else could do it in a way that seems right to me, you know? I'm sure when I get everyone together, they're all thinking, `Oh my God, what's she getting me to do?'&quot;\n\nBeyond Campbell's movie-like working method, Hawk bears out the singer's invocation of the film world with lovingly arranged songs that conjure up visual scenes out of pure sound: a hopped-up honky-tonk in the rollicking &quot;Get Behind Me,&quot; for example, or a lonely West Texas landscape in a bare-bones cover of &quot;No Place to Fall&quot; by the late Townes Van Zandt. In &quot;Come Undone,&quot; meanwhile, Campbell and Lanegan layer their haunting harmonies over a string-enhanced doo-wop groove straight out of some phantom high-school sock hop.\n\nThough their partnership dates back to 2006, when they released the Mercury Prize-nominated Ballad of the Broken Seas, Campbell says that her and Lanegan's artistic process has stayed largely the same over the intervening years. &quot;Mark doesn't really change too much,&quot; she explains with a knowing chuckle. &quot;When we're in the studio he always turns around to me and says, `I trust you to do all the heavy lifting.'&quot;\n\nStill, Campbell is quick to add, the two artists' relationship has definitely matured. &quot;We're very different singers, but we're both fans of each other's work,&quot; she explains. &quot;So when we first met we were quite enamored with each other. Not that we're not anymore. But I feel a lot more comfortable working with Mark.&quot; She laughs. &quot;I'll even ask him to try things I know he doesn't want to!&quot; \n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:5e13b1d85e9ce5b3fb1ac5e2a8b035fba9157290","amp;dn":"Isobel+Campbell+and+Mark+Lanegan...Hawk%282010%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e13b1d85e9ce5b3fb1ac5e2a8b035fba9157290","infoHashBuffer":{"type":"Buffer","data":[94,19,177,216,94,156,229,179,251,26,197,226,168,176,53,251,169,21,114,144]},"announce":[],"urlList":[]}}