{"title":"MOS Mash Up Mix Bass 2011 DOUBTofalex","uid":6372679,"size":396683856,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e7e49d383a464799723ee6c77d436ab7fde8797&amp;dn=MOS+Mash+Up+Mix+Bass+2011+DOUBTofalex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"doubtofalex","files":-1,"time":1304735469,"description":"Disc 1\nSub Focus - Rock It, Wretch 32 Feat. L - Traktor\nBreakage Feat. Jess Mills - Fighting Fire, Twin Atlantic - What Is Light? What Is Laughter? (What Is Light Vs Skrillex)\nEric Prydz -Niton, (The Reason) - Gyptian Hold You\nLoadstar - Link To The Past, Aquasky Feat. Spyda - Time Up\nTV Rock Feat. Rudy - In The Air, Example - Watch The Sun Come Up\nDanny Byrd Feat. Netsky - Tonight, Roger Sanchez &amp; Far East Movement Feat. Kanobby - 2Gether, Soul Rebels - The Revolution Will Not Be Televised\nJ Majik &amp; Wickaman Feat. Dee Freer- In Pieces, WTF?! &amp; Dead Prez - It's Bigger Than Hip Hop UK, Peter Gelderblom - Waiting 4\nBlame - Star, Lethal Bizzle - POW 2011\nNero - Me &amp; You, Sidney Samson Feat. Wizard Sleeve - Riverside (Lets Go!)\nNero - Innocence, Redlight Feat. Ms Dynamite - What You Talking About!?\nExample - Last Ones Standing, Kid Cudi Vs Crookers - Day 'N' Nite\nAfrojack Feat. Eva Simons - Take Over Control, Tim Berg - Seek Bromance\nDJ Fresh\tGold Dust - Fatboy Slim, Rockerfella - Skank\nSL2 - On A Ragga Tip, Wretch 32 Feat. Example - Unorthodox\nShy FX Feat. Kano, Donae'o &amp; Roses Gabor - Raver , The Ragga Twins - Wild Out\nDanny Byrd Feat. I-Kay - Ill Behaviour, Steve Aoki Feat. [[[zuper blahq]]] - I'm In The House\nJonny L - Back To Your Roots, Black Noise &amp; Wizard Sleeve\tHit - The Party\nDanny Byrd - We Can Have It All, Roots Manuva - Witness, J. Majik &amp; Wickaman - Crazy World\nLogistics - Together, Yasmin - Finish Line\nSub Focus Feat. Coco - Splash , Axwell, Ingrosso, Angello &amp; Laidback Luke Feat. Deborah Cox - Leave The World Behind\nFreestylers - Cracks, Alex Gaudino Feat. Crystal Waters - Destination Calabria\nJakwob - Here With Me, Emanuel, McCall &amp; Jamesie Feat. Rita Campbell - In This Silence\n\n\n\nDisc 2\nTiÃƒÂ«sto Vs Diplo Feat. Busta Rhymes - C`Mon (Catch `Em By Surprise), Lethal Bizzle &amp; Nick Bridges Feat. LucianaGo Go Go\nDJ Luck &amp; MC Neat - A Little Bit Of Luck, Mephisto Feat. Kurtis Blow - In the Name of Love\nNoisia - Split The Atom, TiÃƒÂ«sto Vs Diplo Feat. Busta Rhymes - C`Mon (Catch `Em By Surprise), Stretch &amp; Vern - I'm Alive 2010\nWideboys\tFlirt - Apollo 440 - A Deeper Dub, Hostage - Dub My Disco\nAquasky - You Know We Do It Big, Yasmin - On My Own, Robin S. - Show Me Love, Geode - Harmony Fedde Le Grand - Put Your Hands Up For Detroit\nDouble 99 - Ripgroove, MJ Cole Sincere, DJ Pied Piper &amp; The Masters Of Ceremonies - Do You Really Like It?\nIan Carey Feat. Snoop Dogg &amp; Bobby Anthony - Last Night, Lethal Bizzle Feat. Donae'o Go Hard\nD.O.N.S Feat. Technotronic - Pump Up The Jam, Steve Angello - KNAS\nKrafty Kuts - Let's Ride, Porno\tMusic Power\nAzzido Da Bass - Dooms Night, Sub Focus - Could This Be Real, Soho Spiv Feat. Daddy Freddy - Hands In The Air\nBenny Benassi Presents The Biz- Satisfaction, Don Diablo &amp; Example - Hooligans\nGinuwine Feat. Timbaland &amp; Missy Elliot - Get Involved, Freestylers Vs Wizard - Killa Sound\nExample - Won't Go Quietly, Freestylers &amp; Tenor Fly - Reality Check\nDADA Feat. Sandy Rivera &amp; Trix - Lollipop, ID - Once Again\nSkream - The Epic Last Song, Kariya - Let Me Love You For Tonight\nMicky Finn &amp; Aphrodite - Bad Ass, DJ Vadim Feat. Zion I - Got To Rock, High Contrast - Kiss Kiss Bang Bang Lightning Head - 2nd Line Stomp\nPendulum Vs Fresh Feat. $pyda &amp; Tenor Fly - Tarantula, A Skillz And Krafty Kuts Feat. Droop Capone - Peaches\nNoisia &amp; Spor - Falling Through, Slyde - Glitta, 2 Bit Thugs - Next To You\nRockwell\tFull Circle - Camille Jones Vs Fedde Le Grand - The Creeps, Nightstylers - Chase The Sun\nLung - Afterlife, Groove Mekanix - One (Your Name)\n\n-doubtofalex","torrent":{"xt":"urn:btih:5e7e49d383a464799723ee6c77d436ab7fde8797","amp;dn":"MOS+Mash+Up+Mix+Bass+2011+DOUBTofalex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7e49d383a464799723ee6c77d436ab7fde8797","infoHashBuffer":{"type":"Buffer","data":[94,126,73,211,131,164,100,121,151,35,238,108,119,212,54,171,127,222,135,151]},"announce":[],"urlList":[]}}