{"title":"Drive SnapShot v1.40.15667","uid":6489215,"size":2066669,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f26d0cca0499844ef83ffc8e1b620ae70f8a2c1&amp;dn=Drive+SnapShot+v1.40.15667+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AJ Blacklisted","files":5,"time":1308819620,"description":"\nEAT released new version of Drive Snapshot app for Windows OS. SnapShot is disk imaging software that enables the user to back up, restore and view backed up hard disk data, easily and safely.\n\n\nSnapshot Backup is aimed at the backup/disaster recovery market. There is little use for on the fly disk image creation, if you want to deploy hundreds or thousands of workstations. We think however, that the possibility to do on the fly backup is very important for the end user to regularly protect his data. At least, this was our reason to create Snapshot. No need to shut down and boot from floppy, no need to create network disks, and no need to wait half an hour for the backup process - we think that's nice. Snapshot View is a very easy and powerful method to explore disk images. This technique could be easily adapted to disk images created by other disk imaging programs.\n\n\nFeatures:\n\nCreate Disk Image Backups, While Running Windows\nContinue your work, while the Backup is in progress\nEasy Use and Restore of single Files or directories\nComplete Restore of a disk in case of Disaster\nCompatible with all Windows file systems (FAT16, FAT32, NTFS)\nCompatible with all Windows RAID Methods\nVery easy and comprehensive command line interface\n\n\n\n\nINSTALLATION NOTES:\n\n1. Unpack and install.\n2. Copy the included file to the installed folder.\nThat's all... Enjoy! ;-) \n\nJoin Us in DEVILARTS.INFO","torrent":{"xt":"urn:btih:5f26d0cca0499844ef83ffc8e1b620ae70f8a2c1","amp;dn":"Drive+SnapShot+v1.40.15667+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f26d0cca0499844ef83ffc8e1b620ae70f8a2c1","infoHashBuffer":{"type":"Buffer","data":[95,38,208,204,160,73,152,68,239,131,255,200,225,182,32,174,112,248,162,193]},"announce":[],"urlList":[]}}