{"title":"Kate Nash - Kiss That Grrrl (2nafish)","uid":5757150,"size":136597508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5f3c3e25c8c549e05421de07de3eb16a53430bfa&amp;dn=Kate+Nash+-+Kiss+That+Grrrl+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281603235,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\n&quot;Kiss That Grrrl&quot; is a song by English indie pop singer-songwriter Kate Nash, featured on her 2010 second album My Best Friend Is You. Written by Nash and produced by Bernard Butler, it was released as the second single from the album on 12 July 2010. \n\nThe track's music video was released June 4, 2010. The video evolves around Nash performing a dance, her backup dancers being two men (one of them Nash' boyfriend, The Cribs guitarist Ryan Jarman, and the other being her close friend Wesley Goode who also appeared in the videos for &quot;Pumpkin Soup&quot; and &quot;Do Wah Doo&quot;) that are hinted to be gay. During the video, Nash is seen wearing several risque outfits. Someone dressed in a tiger suit appears several times in the video, and it is rumored that Nash will hold a competition on her website for people to guess who is in the tiger suit.\n\nOn April 23, 2010, Nash explained to Spin magazine: &quot;Kiss That Grrrl is about being in a relationship and going out and drinking, then arguing. Maybe you're being a d--k to your girlfriend, or you're a bitch to your boyfriend, and you know you're being mean because you can get away with it. And it's also about being in love with someone and knowing that if they ever cheated on you, you'd die.&quot; She told Rolling Stone: &quot;These girl-group songs sound really joyous, but the lyrics are quite dark and heartbreaking.&quot; Nash also told Rolling Stone that the song was influenced by her recent obsession with the poetry of English confessional poet and punk blues musician Billy Childish.\n\nMy Best Friend Is You is the second album by English singer-songwriter Kate Nash, released in the United Kingdom on 19 April 2010 and elsewhere on 20 April. The album was originally going to be called Crayon Full Of Colour but changed its name due to similar song titles at the time. On 13 April 2010, Kate appeared on John Kennedy's XFM show Xposure, where they did a track-by-track interview playing the whole of the album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5f3c3e25c8c549e05421de07de3eb16a53430bfa","amp;dn":"Kate+Nash+-+Kiss+That+Grrrl+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3c3e25c8c549e05421de07de3eb16a53430bfa","infoHashBuffer":{"type":"Buffer","data":[95,60,62,37,200,197,73,224,84,33,222,7,222,62,177,106,83,67,11,250]},"announce":[],"urlList":[]}}