{"title":"Coast To Coast Am - 09-08-03 - Advanced Communications","uid":5786926,"size":30806290,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:60e6ac19d582c1cf84b5ffc2e15d35503b49e29b&amp;dn=Coast+To+Coast+Am+-+09-08-03+-+Advanced+Communications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":3,"time":1282677617,"description":"Advanced Communications\n\nDate:\n\t\n\n09-08-03\n\nHost:\n\t\n\nGeorge Noory\n\nGuests:\n\t\n\nJames Gilliland\n\nMonday night's guest, contactee James Gilliland lives on a ranch in Trout Lake, WA, that is a virtual magnet for unusual phenomena. He called the land a &quot;vortex&quot; that can alter the consciousness of those who visit. &quot;The veil between dimensions are so thin,&quot; on the ranch, and that may account for the many sightings of UFOs, orbs and energies there, he suggested.\n\n&quot;The universe is only as big as the mind that can perceive it,&quot; said Gilliland who has opened himself up to telepathic communications with ETs who have a benevolent agenda that is &quot;service oriented,&quot; he said. They are enabled with advanced technologies using frequencies to help the human race spiritually advance, he explained. The Greys however, known for their abductions, Gilliland blocks out. He said they bred emotions out of their race, and are now experimenting with humans to get them back.\n\nAn audio clip of a &quot;beamship&quot; which appeared over Portland State University was played on the show and Gilliland said that the eerie pulsing sounds correlated with the light of the craft growing dimmer or stronger. &quot;There's a vibrational continuum,&quot; he said, whereby beings can exist primarily as bodies of either energy, light, or consciousness and &quot;we have all three of those bodies within us.&quot; ","torrent":{"xt":"urn:btih:60e6ac19d582c1cf84b5ffc2e15d35503b49e29b","amp;dn":"Coast+To+Coast+Am+-+09-08-03+-+Advanced+Communications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60e6ac19d582c1cf84b5ffc2e15d35503b49e29b","infoHashBuffer":{"type":"Buffer","data":[96,230,172,25,213,130,193,207,132,181,255,194,225,93,53,80,59,73,226,155]},"announce":[],"urlList":[]}}