{"title":"Frank Marino-album","uid":5803472,"size":1504581393,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:611fdee3e55154f9ab1a1d1882f9688ddd0470da&amp;dn=Frank+Marino-album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"flitigalisa","files":172,"time":1283357965,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nFrank Marino (Francesco Antonio Marino), born November 20, 1954, in Montreal, is the guitarist and leader of Canadian hard rock band Mahogany Rush. Often compared to Jimi Hendrix, he is acknowledged as one of the best and most underrated guitarists of the 1970s\nAfter playing drums since he was five, around age 13-14 Marino started playing guitar. An often-repeated myth, propagated by Marino himself, is he was visited by an apparition of Jimi Hendrix after a bad LSD trip, a myth Marino now disavows on his personal website. His playing, however, is explicitly inspired by Hendrix (on the Gibson he is described as &quot;carrying Jimi's psychedelic torch), and Marino is notable for strong cover versions of Hendrix classics such as &quot;Purple Haze&quot;. He has been criticized by some as a Hendrix clone. Marino himself claims that he didn't consciously set out to imitate Hendrix's style at all: &quot;The whole style just came naturally. I didn't choose it; it chose me.&quot; \nMahogany Rush was moderately popular in the 1970s. Their records charted in Billboard, and they toured extensively, playing such venues as California Jam II (1978). Toward the end of the 1970s, the band began to be billed as &quot;Frank Marino and Mahogany Rush.&quot; Not much later, Mahogany Rush split up and in the early 1980s Marino released two solo albums on CBS. The band reformed and continued to perform throughout the 1980s and 1990s. In 1993, Marino retired from the music industry.\nMarino returned in 2001, inspired in part by a fansite, www.mahoganyrush.com: &quot;I always knew we had fans, I just didn't know I'd find half a million of them on the Web,&quot; he said in an interview with Guitar Player in 2005. He released Eye of the Storm, and went on tour again, playing more improvisational shows. is still active, recording and touring under his own name. He has also been involved in blues recordings with other artists as well, playing on tribute albums to Albert King and Stevie Ray Vaughan.\nBesides Jimi Hendrix, Marino acknowledged the influence of for instance Duane Allman, Johnny Winter, and Carlos Santana. He plays blues, heavy metal, and improvisational styles; one of his notable tricks is playing (live) a lick as if it were played backwards, with the help of only a volume pedal and a delay. His style has influenced many guitar players, including Zakk Wylde and Eric Gales. His tone is recognized by for instance Guitar Player, which called him a &quot;full-spectrum guitar god,&quot; alongside Jeff Beck, Eddie Van Halen, and The Edge. He is noted for complicated set-ups; according to Guitar Player, he has &quot;an entire pedalboard ... assigned to hold the expression pedals that control the parameters of the effects on another pedalboard.&quot; In the past, he has built his own Pre-amplifiers to achieve the right sound; he also uses Fender Twins. Marino is a devoted Gibson SG player and regularly uses four of them, two with the original PAF pickups and two with DiMarzio humbuckers.\n\nPlease SEED and enjoy, thanks........!\n","torrent":{"xt":"urn:btih:611fdee3e55154f9ab1a1d1882f9688ddd0470da","amp;dn":"Frank+Marino-album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611fdee3e55154f9ab1a1d1882f9688ddd0470da","infoHashBuffer":{"type":"Buffer","data":[97,31,222,227,229,81,84,249,171,26,29,24,130,249,104,141,221,4,112,218]},"announce":[],"urlList":[]}}