{"title":"Fall Out Boy-Headfirst Slide Into Cooperstown On A Bad Bet(Live)","uid":5823877,"size":142448644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:61830a9c2fa0a1c897e0bdccec1b3ac1dabe8a96&amp;dn=Fall+Out+Boy-Headfirst+Slide+Into+Cooperstown+On+A+Bad+Bet%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284183493,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFall Out Boy - Headfirst Slide Into Cooperstown On A Bad Bet (Live)(2nafish)\n\n\n&quot;Headfirst Slide into Cooperstown on a Bad Bet&quot; is Fall Out Boy's first digital single (third single in the UK from their fifth studio album Folie ÃƒÂ  Deux. It was released as part of the build up to the new album on iTunes on October 7, 2008.\n\nThe title of the song refers to former Major League Baseball player Pete Rose, known for sliding headfirst into bases. Rose agreed never to work in baseball again due to an accused betting scandal while managing the Cincinnati Reds and will likely be kept out of the Hall of Fame, located in Cooperstown, New York, because of it. The band originally intended to name-drop Rose in the song's title. They changed their minds because of concerns about the lawsuit brought against OutKast over their 1999 single &quot;Rosa Parks&quot; by the civil rights activist, who was name-dropped in the title.\n\nThis song was originally titled &quot;Does Your Husband Know?&quot;.\n\nFolie ÃƒÂ  Deux is the fifth studio album by American rock band Fall Out Boy. The album, which is the follow-up to their 2007 album Infinity on High, was first released on December 13, 2008. It should be noted that this was the last album Fall Out Boy recorded before hiatus in 2009. The album is certified platinum in Australia, gold in the United States and silver in the UK.\n\nThe critical reception to the album has been generally positive. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album has received an average score of 73, based on 21 reviews. NME  said &quot;the band have responded with their most stylistically hatstand-but-indisputably-best songs yet&quot; and compared it to genre watermarks like Green Day's American Idiot and My Chemical Romance's The Black Parade. Several critics also pointed out that Fall Out Boy sound more sophisticated, relaxed and comfortable than before, while they have managed to keep their winning tongue-in-cheek attitude.\n\nOn August 25, 2008, Decaydance Records released a mixtape titled Welcome to the New Administration on Pete Wentz's viral campaign, Citizens For Our Betterment. The mixtape contained several snippets of what seemed like new Fall Out Boy tracks. However none of the titles were confirmed for Folie ÃƒÂ  Deux. The mixtape included tracks such as &quot;ALPHAdog and OMEGAlomaniac,&quot; &quot;Lake Effect Kid,&quot; &quot;Catch Me if You Can/Proclamation of Emaciation&quot; which featured Travis McCoy from Gym Class Heroes. It also featured a song titled &quot;America's Sweethearts&quot;, which was eventually confirmed for the album but with alternate spelling, and now entitled &quot;America's Suitehearts.&quot;\n\nPete Wentz was also quoted on his blog stating that &quot;all songs that aren't snippets, most likely won't be on the next album including 'Catch Me if You Can/Proclamation of Emaciation',&quot; which eventually found its way onto the Gym Class Heroes' The Quilt. Wentz stated that Fall Out Boy fell in love with the track, so they remixed it, and re-wrote the chorus.\n\t\nOn September 13, 2008, on the band's website, the album cover artwork was revealed, with Luke Chueh credited as the designer claiming the band was great to work with and gave him full creative control.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:61830a9c2fa0a1c897e0bdccec1b3ac1dabe8a96","amp;dn":"Fall+Out+Boy-Headfirst+Slide+Into+Cooperstown+On+A+Bad+Bet%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61830a9c2fa0a1c897e0bdccec1b3ac1dabe8a96","infoHashBuffer":{"type":"Buffer","data":[97,131,10,156,47,160,161,200,151,224,189,204,236,27,58,193,218,190,138,150]},"announce":[],"urlList":[]}}