{"title":"Oh...tidak VCDRip","uid":6479590,"size":595821477,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61b510d3d286948997e796c3f2fdaa1c5dcd84d6&amp;dn=Oh...tidak+VCDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zaini711","files":-1,"time":1308452467,"description":"Production Co : Indie Picture Productions, StarVision\nDirector: Ardy Octaviand\nStar : Fathir Muchtar, Marsha Timothy, Marcella Lumowa\nGenre : Comedy | Drama\n \nimdb.com/title/tt1930424/\n\nPekerjaan dan penampilan adalah dua hal yang sangat penting dalam kehidupan Gilang (Fathir Muchtar). Karena dua hal itulah membuat Meisya (Marsha Timothy), pacar Gilang, merasa Gilang tidak serius dengan hubungan mereka. Meisya menganggap Gilang hanya memperdulikan dirinya sendiri saja alias narsis. Ketika Gilang sedang berusaha memperbaiki hubungannya dengan Meisya, Gilang dikejutkan dengan kedatangan keluarga besarnya yang membawa masalah. Ibunya (Marcella Loumowa) yang ingin bercerai dari Bapaknya (Djarwo Kuwat) karena Bapaknya dituduh ingin poligami dengan perempuan yang dikenalnya di karaoke. Pamannya yang mengidap kelainan jiwa semenjak ditinggal bibinya yang memilih jadi lesbian bersama mbok Ijah (Yulinda), pembantu mereka. Kakek (Sutrisna) dan neneknya (Djaety) yang sudah pisah ranjang. Kakeknya yang genit dan sok bergaya anak muda sementara Neneknya suka bicara sendiri dengan imaginary friendnya. Kehadiran mereka membuat banyak kekacauan pada kehidupan Gilang. Tidak mungkin bagi Gilang untuk mengenalkan keluarganya yang tidak normal pada Meisya yang lahir dari keluarga yang sangat konservatif. Gilang khawatir itu akan membuat Meisya takut berhubungan dengannya. Akhirnya demi menutupi keberadaan keluarganya, Gilang mulai menciptakan kebohongan pada Meisya demi menyelamatkan hubungan mereka. Berawal dari kebohongan satu akhirnya terciptalah kebohongan-kebohongan lainnya yang akhirnya justru mempersulit kehidupan Gilang dan juga mengacaukan hubungannya dengan Meisya.\n\n\nPlease donate or support by visiting the website. In event of Piratebay offline again, you can view latest download at my website\n\n     &lt;a href=&quot;\nHTTP://URSHOP.COM.MY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHTTP://URSHOP.COM.MY&lt;/a&gt;\n\t\t\n","torrent":{"xt":"urn:btih:61b510d3d286948997e796c3f2fdaa1c5dcd84d6","amp;dn":"Oh...tidak+VCDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61b510d3d286948997e796c3f2fdaa1c5dcd84d6","infoHashBuffer":{"type":"Buffer","data":[97,181,16,211,210,134,148,137,151,231,150,195,242,253,170,28,93,205,132,214]},"announce":[],"urlList":[]}}