{"title":"STALKER - Call Of Pripyat [pcgame-Multi5] [Tntvillage]","uid":5765813,"size":4309516288,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:62395f45e53cac1e20258802d5b05406e3387932&amp;dn=STALKER+-+Call+Of+Pripyat+%5Bpcgame-Multi5%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1281898757,"description":"STALKER - Call Of Pripyat [pcgame-Multi5] [Tntvillage]\n\nS.T.A.L.K.E.R. - Call Of Pripyat\n &lt;a href=&quot;\nhttp://a.imageshack.us/img826/7200/coz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://a.imageshack.us/img826/7200/coz.jpg&lt;/a&gt;\n\nSparatutto - 1 DVD5 - Multi5 (Inglese-Italiano-Francese-Spagnolo-Tedesco)\nData di uscita: 05 febbraio 2010\n\nOriginal release: \n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=219961&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=219961&lt;/a&gt;\n\n.::.Recensione.::.\n\nSterminati due sfortunati mercanti incontrati poco dopo l'arrivo sul campo il nostro equipaggiamento compie un balzo di qualitÃƒÂ  istantaneo. E' stato un incidente. Non ci crederÃƒÂ  nessuno. Ma non ÃƒÂ¨ detto che qualcuno debba saperlo e chi vive nella Zona sa benissimo a cosa puÃƒÂ² andare incontro. Il primo luogo sicuro sulla nostra strada ÃƒÂ¨ la Skadovsk, una nave in secca dove trova riparo una comunitÃƒÂ  che puÃƒÂ² fornirci la maggior parte dei servizi fondamentali e, forse, qualche informazione.\n &lt;a href=&quot;\nhttp://img837.imageshack.us/img837/4599/68959112.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img837.imageshack.us/img837/4599/68959112.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img713.imageshack.us/img713/6308/82890723.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img713.imageshack.us/img713/6308/82890723.jpg&lt;/a&gt;\n\nDesolazione affollata\nLa zona di partenza ÃƒÂ¨ una vasta palude che ospita giganteschi relitti arrugginiti e prima di arrivare a Pripyat dovremo attraversare la zona industriale, Jupiter, dove grossi edifici si susseguono a perdita d'occhio. Tre ampie mappe costituiscono la zona di gioco. Si tratta di aree vaste che contengono parecchie missioni geograficamente circoscritte alla mappa stessa. ÃƒË† quindi raro dover attraversare tratti troppo lunghi e incontrare fastidiosi caricamenti durante una quest. La Zona ÃƒÂ¨ densamente popolata e piena di rifugi, alleati occasionali, oggetti da vendere e punti di interesse che sono spesso caratterizzati da costruzioni piuttosto complesse e ben modellate. I ragazzi di GSC hanno inoltre migliorato il loro sistema di intelligenza artificiale A-Life. Gli Stalker si avventurano in cerca di manufatti e quando sono in coppia si coprono le spalle gli uni con gli altri. I compagni pattugliano le postazioni conquistate. Gli animali carnivori trascinano e mangiano i cadaveri. I lupi attaccano in gruppo e scappano quando soli per tornare alla carica una volta radunato il branco.\nIl tutto visibile a una distanza invidiabile che ci consente di fantasticare su quella luce che vaga tremolante a di la del monte e di rimanere abbagliati dalle sagome in chiaroscuro che un improvviso fulmine ha stampato sulla nostra retina. Purtroppo le guerre tra fazioni sono state eliminate ma gli abitanti della Zona hanno sempre qualche buon motivo per mettere mano alle armi. Un mondo terribile ma vivo e vivido ancora flagellato dalle emissioni. L'aria si appesantisce. Il cielo si tinge di tonalitÃƒÂ  innaturali. Gli abitanti della zona cominciano a correre mentre il pulviscolo radioattivo inizia a bruciare le cornee. Innegabilmente il panorama e il numero di persone che fugge intorno a noi riesce a magnificare l'esperienza delle emissioni in Call of Pripyat.\n &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/5237/99581804.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/5237/99581804.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img839.imageshack.us/img839/7590/71987960.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img839.imageshack.us/img839/7590/71987960.jpg&lt;/a&gt;\n\nStanchi della noiosa routine?\nLe missioni sono numerose e soprattutto offrono obiettivi variegati e sono piacevolmente condite da diverse scene di intermezzo. Sconsigliato quindi saltarle e correre verso l'epilogo appena ottenuto un buon equipaggiamento. Gli incarichi ripetitivi di Clear Sky sembrano infatti essere un ricordo, anche se ovviamente qualche quest di recupero ÃƒÂ¨ inevitabile. Diversi obiettivi possono essere raggiunti in modi differenti, per esempio informando il bersaglio di un omicidio o di un furto e tradendo ovviamente il datore di lavoro originario. Possiamo invece decidere di agire nel modo piÃƒÂ¹ onesto possibile anche se buona parte degli incarichi di onesto ha ben poco.\nIn certi frangenti Call of Pripyat si avvicina quasi ad un survival horror. Parecchie creature, due delle quali introdotte proprio in questo capitolo, non possono essere affrontate semplicemente sparando all'impazzata e quando ci si addentra nei cunicoli sotterranei la prudenza vale ancora piÃƒÂ¹ dell'equipaggiamento. In questi casi ÃƒÂ¨ fondamentale tenere sott'occhio l'indicatore sonoro per evitare di attirare attenzioni indesiderate ed ÃƒÂ¨ bene ricordare che attraversare un cespuglio o camminare nell'acqua sono azioni che causano parecchio rumore. Anche il segnalatore di radiazioni ÃƒÂ¨ vitale ma in Call of Pripyat ÃƒÂ¨ stato sostituito da un marker che cambia colore. La rilevazione quindi risulta meno precisa anche se l'indicatore sonoro dovrebbe essere piÃƒÂ¹ che sufficiente per calcolare il livello di rischio. Il segnale di radiazioni compare ora sulla destra, assieme ad altre icone che indicano lo stato dell'armatura, la condizione delle armi soggette a usura, l'ingombro dell'equipaggiamento e varie ed eventuali come il bisogno di cibo.\n &lt;a href=&quot;\nhttp://img713.imageshack.us/img713/5990/36635277.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img713.imageshack.us/img713/5990/36635277.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/3810/51950684.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/3810/51950684.jpg&lt;/a&gt;\n\nL'abito non fa il monaco, fa il soldato\nCall of Pripyat mette a nostra disposizione una vasta gamma di armi, granate e medicinali per consentirci di sopravvivere alla zona. Immancabile il PDA che segnala creature e punti di interesse nelle circostanze e in dotazione ci sono ovviamente torcia e binocolo. Non si tratta di semplici accessori ma di strumenti vitali per scorgere i nemici nel buio o a lunga distanza. Essere sorpresi da energumeni pesantemente armati o da mutanti con troppi denti in bocca non rientra nell'elenco delle esperienze piacevoli. Altrettanto importante il rilevatore che possiamo trovare in diverse varianti. Migliore ÃƒÂ¨ il modello migliore sarÃƒÂ  la rilevazione delle anomalie e della posizione dei manufatti che spesso vi si trovano all'interno.\nLa maggior parte delle armi ÃƒÂ¨ un'ereditÃƒÂ  diretta dei precedenti S.T.A.L.K.E.R. mentre le armature hanno subito qualche cambiamento. Ogni gear difensiva ha dei pro e dei contro in relazione al modello e al tessuto. Le differenze riguardano la protezione ambientale, lo spazio e la presenza di bonus come la rigenerazione. Inoltre le armature meno robuste, anche se dotate di molti bonus, hanno bisogno di vari upgrade prima di essere effettivamente efficaci. Ovviamente, una volta introdotta la possibilitÃƒÂ  di investire risorse per potenziare il nostro vestiario, i ragazzi della GSC Game World ci hanno anche dato la possibilitÃƒÂ  di riparlarle. Il modello di mira rispetta le leggi della balistica e sembra essere il medesimo di Clear Sky anche se pistole e mitragliatori sembrano lievemente piÃƒÂ¹ precise. Ogni proiettile ÃƒÂ¨ dotato di fisica credibile e i tiri sulla lunga distanza, soggetti alla legge di gravitÃƒÂ , sono tanto soddisfacenti quanto difficili.\n &lt;a href=&quot;\nhttp://img713.imageshack.us/img713/2928/57012873.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img713.imageshack.us/img713/2928/57012873.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img713.imageshack.us/img713/7714/82930303.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img713.imageshack.us/img713/7714/82930303.jpg&lt;/a&gt;\n\nNon bello, affascinante\nL'unica novitÃƒÂ  degna di nota riguarda il supporto DX 11 per chi ha acquistato una Radeon di ultima generazione e puÃƒÂ² godere cosi di modelli piÃƒÂ¹ morbidi e acqua piÃƒÂ¹ realistica. Tornano quindi le textures ultra definite di Clear Sky e purtroppo tornano anche le textures slavate che inficiano la resa visiva globale. Ma sono i ciuffi d'erba, piatti e granulosi, a rappresentare il punto piÃƒÂ¹ basso dell'engine e purtroppo ricoprono gran parte del territorio. I modelli dei personaggi invece si difendono ancora bene, soprattutto considerando la natura free roaming del gioco, ma sono anche tremendamente poco espressivi e praticamente privi di espressioni facciali. Al contrario i modelli di alcuni mutanti sono ormai troppo poveri e bruttarelli cavarsela all'alba del 2010.\nInsomma, ben poco ÃƒÂ¨ cambiato da Clear Sky e anche i difetti sono i medesimi, compreso un depth of field utile per dare profonditÃƒÂ  alla scena ma troppo marcato e talvolta fastidioso. Eppure in certi frangenti l'engine targato GSC lascia a bocca aperta. I lampi proiettano centinaia di ombre estremamente realistiche, i raggi di luce riempono l'aria e ogni momento della giornata ha la sua luminositÃƒÂ , la sua specifica atmosfera. Inoltre gli elementi di contorno contribuiscono a distrarci dagli elementi di scarsa qualitÃƒÂ . Enormi spaccature nel terreno emettono esalazioni che deformano l'aria, raffiche di vento spazzano la vegetazione, mostri d'acciaio alti decine di metri riempono lo sguardo e corvi animati splendidamente solcano il cielo. Il tutto ovviamente supportato dal consueto, ed estremamente vario, comparto sonoro. I campionamenti sono credibili e accompagnano contatori, rilevatori, detonazioni di una trentina di armi differenti, ringhi, versi animali, URLa ed esplosioni. Qualche fruscio di troppo forse ma ben celato da una colonna sonora di ottima fattura e contestualmente perfetta. Purtroppo, mentre i dialoghi piÃƒÂ¹ importanti sono doppiati in italiano, i commenti ambientali dei personaggi, almeno sulla nostra versione, sono rimasti in russo.\n\nVisit thelink:\n\nInstallazione\nMontate o masterizzate il file immagine.\nInstallate il gioco selezionando la lingua che desiderate.\nQuando il setup vi chiederÃƒÂ  il nick del giocatore e il serial number voi cliccate su Avanti.\nPrima di avviare il gioco aprite il driver vituale dove avete montato il file immagine, andate nella cartella Razor1911, copiate il file xrEngine e incollatelo nella directory di installazione del gioco (GameDir\\bin\\)\n\nRequisiti minimi di sistema:\nSistema Operativo: Windows XP/Vista/Windows 7\nCPU: Athlon 2200 o P4 2.0 GHz\nRAM: 512 MB RAM\nHard Disk: 5 GB di spazio libero\nScheda Video: 128 MB, GeForce 5700 o Radeon 9600\n\nRequisiti Consigliati:\nSistema Operativo: Windows Vista, Windows 7\nCPU:Intel Core 2 Duo E7400 o AMD 64 X2 5600+\nRAM:2 GB\nGPU: 512 MB RAM DirectX 9 o 10, GeForce 9800GTX or Radeon\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:62395f45e53cac1e20258802d5b05406e3387932","amp;dn":"STALKER+-+Call+Of+Pripyat+%5Bpcgame-Multi5%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62395f45e53cac1e20258802d5b05406e3387932","infoHashBuffer":{"type":"Buffer","data":[98,57,95,69,229,60,172,30,32,37,136,2,213,176,84,6,227,56,121,50]},"announce":[],"urlList":[]}}