{"title":"Corporate Avenger - Born Again","uid":6498165,"size":360606571,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62f5c901ca152189ddfe9aa3c4f98aa461f30bea&amp;dn=Corporate+Avenger+-+Born+Again&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"v1510nm45t3r","files":14,"time":1309155213,"description":"The idea for the band Corporate Avenger was born some time between 1995 and 1996 when brothers, Spike and Brad Xavier were on tour in the band Humble Gods. Years later, Spike met with Marco of 1605 Studio in Huntington Beach, California and recorded some songs. In 1999 these songs were released on Suburban Noize records as the 'Taxes are Stealing' EP. This EP featured the first song ever recorded by the group, 'Evolve', a song questioning the origins of the native peoples of the Americas.\n\nJudging by the cover of the 'Taxes are Stealing' EP, at this time the band consisted of eight members, including Pakelika of The Kottonmouth Kings, nameless members of 20 Dead Flower Children &amp; No Doubt. During this phase of the band's history, the group had an ever-changing line up and no two shows would be alike. Some times the band would show up to a location unannounced, play a few songs, and then leave.\n\nIn 2000 the group released another CD titled 'The New Testament'. This CD featured new songs as well as three songs from the previous EP. It also featured a new line up including the first appearance of vocalist Adawee the Wind. The sound on 'The New Testament', while still electronic in nature, is much more aggressive and not only pushes the band's views further but also pushes the envelope with songs such as 'The Bible is Bullshit', 'Jesus Christ Homosexual', and 'Enemy of the Gospel'. The CD was seen as a way to bridge the gap between the previous EP and the full length album they were working on at the time.\n\nIn July 2001, the band finally released its first full length album, Freedom Is a State of Mind, released on Suburban Noize Records via Koch Entertainment. The new album had songs from both previous releases, including a few remixes of some of the oldest songs, and several new songs that again evolved the bands sound and message. Songs like 'Christians Murdered Indians', 'FBI File', and 'Voting Doesn't Work' had a hard, aggressive rap sound with Adawee providing sung vocals (a stark change of pace from Spike's angry spoken word vocals).\n\n2005 saw the release of 'Born Again', Corporate Avenger's newest CD and newest line up. Spike and Adawee were still the core of the band, but this time around the music had taken on a more metal sound with songs like 'Jihad Schmihad' and 'Gay Muslims for Christ'. This album was not put out through Suburban Noize Records but rather through Massive Sound Records and sold via Merch.com, a first for the group. 'Born Again' also saw the departure of The Taxman, who claimed to leave the band to work on a solo record.\n\n\n\nTrack List:\n\n1. When I get to Heaven\n2. Jihad Schmihad\n3. Earth Song\n4. Gay Muslims for Christ\n5. Pigs in the Temple\n6. White Faces in the Black Hills\n7. Jesus Shit\n8. In the Alone\n9. America in Heaven (There's No)\n10. 9.12\n11. Nano Builder\n12. Boarding Schools\n13. Every Moment is a Gift","torrent":{"xt":"urn:btih:62f5c901ca152189ddfe9aa3c4f98aa461f30bea","amp;dn":"Corporate+Avenger+-+Born+Again","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f5c901ca152189ddfe9aa3c4f98aa461f30bea","infoHashBuffer":{"type":"Buffer","data":[98,245,201,1,202,21,33,137,221,254,154,163,196,249,138,164,97,243,11,234]},"announce":[],"urlList":[]}}