{"title":"Darker My Love-Alive As You Are-2010-RTB","uid":6494301,"size":68454521,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:63ce6358a56a55217a5643dd3b375ae5f36aef6e&amp;dn=Darker+My+Love-Alive+As+You+Are-2010-RTB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"soupucia","files":-1,"time":1308961596,"description":"ARTIST: Darker My Love\nTITLE: Alive As You Are\nLABEL: Dangerbird Records\nGENRE: Indie\nBITRATE: 249kbps avg\nPLAYTIME: 0h 35m total\nRELEASE DATE: 2010-08-17\nRIP DATE: 2011-06-19\n\nTrack List\n----------\n1.  Backseat                         3:15\n2.  Split Minute                     2:55\n3.  18th Street Shuffle              4:17\n4.  New America                      3:41\n5.  Rain Party                       3:33\n6.  Maple Day Getaway                2:32\n7.  Trail The Line                   3:03\n8.  June Bloom                       4:31\n9.  Dear Author                      2:51\n10. A Lovely Game                    2:34\n11. Cry On Me Woman                  2:33\n\nRelease Notes:\n\n\nFor a band whose allegiances lie with the post-shoegaze/noise scene yet contain\nmembers who've played with the disparate likes of The Distillers and The Fall\namongst others, it would take a braver man than I to predict exactly whereabouts\nLos Angeles five-piece Darker My Love are headed next. Having ditched several\ndrummers, along with their previous sound - one-time Brian Jonestown associate\nDan Allaire currently resides behind the kit - the 2010 model of Darker My Love\nis all but a reminder in name-only of the one that set pulses racing in 2008 on\nsecond album 2.\n\nGranted, one wouldn't have wished for a watered down xerox of its predecessor,\nbut the West Coast psychedelia on a Nashville vacation of Alive As You Are could\nalmost be a different band entirely. When Tim Presley sings &quot;Act like you were\nborn again in your own time&quot; on the album's mid-point 'Maple Day Getaway' he\ncould almost be writing his and Darker My Love's updated autobiography.\nCertainly anyone expecting a repeat of the gargantuan riffs and soaring melodies\nof 'Summer Is Here' and 'Talking Words' will be disappointed here, although once\nthe initial shock subsides, there are still a handful of treasures in Alive As\nYou Are to suggest the instinctive chameleon within the band hasn't totally\ndampened their songwriting abilities.\n\nAt times Alive As You Are feels like a homage to the likes of The Byrds and The\nGrateful Dead, the opening 'Backseat' and reflective 'June Bloom' both sounding\nlike entrees at an arranged marriage ceremony between The Notorious Byrd\nBrothers and Anthem Of The Sun. The late Sixties vibe is omnipresent throughout,\n'Split Minute' taking its heed from the likes of ? And The Mysterians while the\nmawkish balladry of 'New America' offers a more Mersey-based flavour as Presley\nand bass player Rob Barbato harmonise intently &quot;Make sure you take what you need\nand more&quot;.\n\nOn the occasions when Alive As You Are comes to life, such as with the\naforementioned 'Maple Day Getaway', Led Zep-influenced 'Dear Author' or obtuse\nlove song 'Trail The Line', Darker My Love's subtle side ebbs and flows like a\nmodern day Teenage Fanclub, themselves initially derided for a shared love and\nclose musical proximity to The Byrds and Big Star among others. 'A Lovely Game'\nmeanwhile takes bar room blues back to its earthy roots, stomping away heartily,\nCanned Heat's 'On The Road Again' immediately springing to mind.\n\nEven some of the more melancholy pieces such as the Canyon-esque 'Rain Party'\nand ode to post-wedding day gloom 'Cry On Me Woman' (&quot;Since I've been married I\nhaven't felt the same&quot; opines a disillusioned Presley) have a more distinguished\n- humane even - side to them than anyone familiar with the full-throttle\nassaults of Darker My Love or 2 could have expected. Overall though, Alive As\nYou Are's sea change is perhaps just a little too severe to fully engage with in\none sitting, and despite the band's insistence this record represents a\nsignificant step forward, its retrogressive veneer casts something of a\nbewildering shadow. Lord knows what Mark E Smith and Brody Dalle would make of\nit all. File under 'frustrating'...\n","torrent":{"xt":"urn:btih:63ce6358a56a55217a5643dd3b375ae5f36aef6e","amp;dn":"Darker+My+Love-Alive+As+You+Are-2010-RTB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ce6358a56a55217a5643dd3b375ae5f36aef6e","infoHashBuffer":{"type":"Buffer","data":[99,206,99,88,165,106,85,33,122,86,67,221,59,55,90,229,243,106,239,110]},"announce":[],"urlList":[]}}