{"title":"Autosport Magazine UK 26/08/2010 60th Anniversary","uid":5795874,"size":283554105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:659fc967140c0a1f442839a1b4be55729b4e73a9&amp;dn=Autosport+Magazine+UK+26%2F08%2F2010+60th+Anniversary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1283039685,"description":"NEWS\n10 McLaren buoyant. Team says car will fly on classic Europe speedtracks Spa and Monza\n12 Pirelli: step by step. F1's new tyre maker can keep tweaking through 2011\n14 The 300th start... Barrichello gets set to celebrate F1 milestone at Spa\nl7 David Coulthard column\n18 Belgian GP preview.\n24 Fords take BTCC hit. Calls for more handicaps on 'alternative-fuelled turbo cars' (the Focus, in other words)\n26 Mortara back at Macau. Italian set to go for two wins in a row in Formula 3 classic\n28 VW could diversify. German manufacturer could combine World Rally and Dakar programmes\n\nREPORTS\n32 Rally Germany. Sebastien Loeb breaks more records in predictable win\n36 BTCC Silverstone. Fords dominate, but there's controversy over team orders\n40 Silverstone supports. Son of The Real Stig breaks his duck in Formula Renault\n42 IndyCar Sears Point. Will Power builds up points lead before oval races\n44 DTM/Euro F3 Zandvoort. Paffett gets a big hand as he heads British Merc one-two\n46 World of Sport. NASCAR; British Rally Championship; Japanese GT; American Le Mans Series\n48 LMS Hungaroring. Strakkatak! British LMP2 team wins overall with HPD\n\nFEATURES\n51 60th Anniversary Special\n\nSPORTS EXTRA\n299 Winter Cup expands. Formula Renault moves to six races for mini-series\n300 FPA's uncertain future. Palmer could axe series, build new car or carry on with the old faithfuls\n304 Reports. Mallory Park VSCC; Mandello Park CKMC; Shelsley Walsh hillclimb; Cadwell Park MSVR; Oulton Park AMOC; Brands Hatch BRSCC; Snetterton 2CV 24 Hours; Knockhill SMRC\n314 National Focus. Celebrating the 60th anniversary of Castle Combe\n\nREGULARS\n325 Photo Finish. Tiff Needell wins an AUTOSPORT contest, 1971\n326 Race of my life. Sir Stirling Moss, 1961 Monaco Grand Prix\n\nOCRd by Acrobat Pro 9.3.4\n\nA wonderful 60th anniversary special - I even bought myself a copy (well worth Ã‚Â£6)","torrent":{"xt":"urn:btih:659fc967140c0a1f442839a1b4be55729b4e73a9","amp;dn":"Autosport+Magazine+UK+26%2F08%2F2010+60th+Anniversary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"659fc967140c0a1f442839a1b4be55729b4e73a9","infoHashBuffer":{"type":"Buffer","data":[101,159,201,103,20,12,10,31,68,40,57,161,180,190,85,114,155,78,115,169]},"announce":[],"urlList":[]}}