{"title":"tomb raider anniversary direct play","uid":6391796,"size":2210830228,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:65fc210637db121dc2dec9354c70d9ee53bbdebc&amp;dn=tomb+raider+anniversary+direct+play&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":27,"time":1305333677,"description":"\n\n\nTomb Raider: Anniversary is the first game of the famous series, which does a total comeback to its origins. The story and the characters are all from the preceding games. It was conceived totally for the 10th anniversary of the Tomb Raider series, being in fact a remake of the first game, and using the graphical engine of the Tomb Raider: Legend.\n\nTomb Raider Anniversary\n\nIt was created much more for the fans, than the large audience which didn't play any of the games in the Tomb Raider series. This time, Lara Croft gets the look and maybe even the voice of Angelina Jolie, but that may be pure coincidence.\n\nIn the beginning Tomb Raider, was a huge success amongst gaming fans, but then Lara Croft was forgotten. Out of inspiration, Crystal Dynamics decided to return to origins and to put out a new sequel for the game, but with a twist: a remake of the original Tomb Raider.\n\nCrystal Dynamics decided that a clarification of the original story of Tomb Raider was due, because in the first version it was rather superficial to say the least. The story is the same: Lara must find the ancient relic called &quot;The Scion&quot;.\n\nIn the first level, the reconstruction of the ancient clock mechanism takes place in a cave this time, traversed by a series of interconnected tunnels. The simple mechanisms have been replaced with more sophisticated ones on the wall. The quest for the clock's cogs once again is a good reason for meeting a large variety of animals: bears, wolves, bats, and some surprises from the Jurassic.\n\nBeing a remake, it was normal that some things were left untouched. For example the access to Lara's inventory is the same as in the first edition. An easy to maneuver circle, contains everything you need, especially when you need fast access to the tools available.\n\nThe graphics is good, as was expected, but not some spectacular changes from Tomb Raider: Legend. The lights create a unique effect, the hot air, created by the scorching sun in Egypt, is brilliantly made; all that's missing is the distinctive music of Egypt.\nTRA poster thumbnail\n\nThe movements of the character are fluid, and Lara's ability to jump has been improved. The details in the game are better made and giving a more in-depth perspective of the environment.\nThe music is from the first edition, and so are the sound effects. There are areas that are dead silent, and that sometimes creates an unbearable tension which is also underlined by the careful choosing of the music in some key moments. Lara's voice is mainly unchanged, but the enemies sometime use sounds which don't appear in the previous versions.\n\nAll these make Tomb Raider: Anniversary Edition to present itself as a retold story, sending most of its fans to their childhood. If the story is told right, it can be listened to again and again, that's what Crystal Dynamics proved with Tomb Raider: Legend and knew how to exploit every time to the maximum the epic adventures of Lara Croft. Sometimes things never get old: so is the case with Tomb Raider: Anniversary.","torrent":{"xt":"urn:btih:65fc210637db121dc2dec9354c70d9ee53bbdebc","amp;dn":"tomb+raider+anniversary+direct+play","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65fc210637db121dc2dec9354c70d9ee53bbdebc","infoHashBuffer":{"type":"Buffer","data":[101,252,33,6,55,219,18,29,194,222,201,53,76,112,217,238,83,187,222,188]},"announce":[],"urlList":[]}}