{"title":"Brink [MULTI5][PAL][XBOX][sneak_shot]","uid":6378636,"size":7096104641,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:660fddbfdfc98eeb00973a08b696240e2d97b601&amp;dn=Brink+%5BMULTI5%5D%5BPAL%5D%5BXBOX%5D%5Bsneak_shot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sneak_shot","files":74,"time":1304949254,"description":"presenting s n e a k _ s h o t\n\n\n\n\nrelease date: 8-05-2011\n\n\ndiscription:\n\n\nBrink (stylised as BRINK) is an upcoming first-person shooter video game developed by Splash Damage for Microsoft Windows, PlayStation 3 and Xbox 360.\n\n\n\n\nIn Brink, two factions, Resistance and Security, battle in a once-utopian city called The Ark, a floating city above the waters of a flooded Earth.\n\n\n\nBrink has Steamworks integration, including Valve Anti-Cheat.[8] It runs on id Tech 4 and has a new rendering framework and promises improved support for multiple CPU cores.\n\n\nBrink is a first-person shooter with a focus on parkour-style movement. Online multiplayer servers hold up to 16 players. You can play cooperatively or competitively or against bots.\n\n\n\n\nYou can customize your character and buy items with experience points, which you earn by completing objectives.[1] The same experience points can be earned in both single-player and multiplayer.\n\n\n\n\nSplash Damage developed the SMART (Smooth Movement Across Random Terrain) System.[9] By noting a player's position and predicting what he is trying to do, it lets players navigate complex environments without equally complex input.\n\n\n\n\nThere are four character classes: the soldier, the medic, the engineer, and the operative. [10] The Soldier resupplies teammates and uses explosives to destroy important targets. The Engineer buffs their teammates' weapons and builds stationary turrets. The Medic heals fallen teammates and buffs their teammates' health. The Operative interrogates fallen opponents to get intel on enemy locations, performs acts of sabotage, and disguises himself as the enemy. Bethesda also claims 102 quadrillion total unique characters when factoring in minor variations.\n\n\n\n\nThe Squad Commander system gives players context-sensitive missions. A variety of factors -- where the player is, how good he is, his overall mission progress, etc. -- determine what the missions will be. During play both online and off-, the player can defend one of his faction's command posts or capture an enemy's command post.\n\n\n\n\nAn Objective Wheel shows the main objective in yellow and will show a checkpoint which the player will need to go to to achieve that primary goal. There are also secondary goals. Each player has one in his/her inventory and will, on certain missions, be timed to achieve the goal that must be completed.\n\n\nseed comment n enjoy !!!...","torrent":{"xt":"urn:btih:660fddbfdfc98eeb00973a08b696240e2d97b601","amp;dn":"Brink+%5BMULTI5%5D%5BPAL%5D%5BXBOX%5D%5Bsneak_shot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"660fddbfdfc98eeb00973a08b696240e2d97b601","infoHashBuffer":{"type":"Buffer","data":[102,15,221,191,223,201,142,235,0,151,58,8,182,150,36,14,45,151,182,1]},"announce":[],"urlList":[]}}