{"title":"Doble Vision","uid":6336761,"size":734032106,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66d19ef0e96344ff49fe7565e32e1b3de423839c&amp;dn=Doble+Vision&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Black1000","files":2,"time":1303499975,"description":"Doble Vision.2002\n\nDuraciÃƒÂ³n: 113 min.\n\nReparto: Tony Leung Ka-fai (Detective Huang Huo-tu), David Morse (Agente Kevin Richter), Rene Liu (Ching-fang), Dai Li-ren (Detective Li Feng-po), Yang Kuei-mei (La coronel).\n\nGÃƒÂ©nero: Thriller.\n\nSinopsis\n Taipei, la bulliciosa capital de TaiwÃƒÂ¡n, es una ciudad en la que la parafernalia de alta tecnologÃƒÂ­a de la vida moderna se completa con creencias que se remontan cuatro mil aÃƒÂ±os en la historia china. Es un lugar donde se considera a los fantasmas tan reales como los rascacielos y en la que un oficial de policÃƒÂ­a con problemas se enfrenta a un demonio tan oscuro que amenaza no sÃƒÂ³lo su vida sino tambiÃƒÂ©n su propia alma. El gran detective Huang Huotu (Tony Leung Ka-fai) se estÃƒÂ¡ desmoronando. Tres horribles asesinatos sacuden el departamento. Las vÃƒÂ­ctimas no estÃƒÂ¡n relacionadas, pero el coronel (Yang Kwei-mei) encuentra un misterioso fango negro en sus cerebro, junto con la evidencia de que todos han muerto en un estado alucinÃƒÂ³geno. Claramente hay un asesino en serie en libertad, pero es el primero en la historia de TaiwÃƒÂ¡n. El FBI manda a su mejor experto, Kevin Richter (David Morse). Encuentran un patrÃƒÂ³n en los asesinatos en un oscuro y antiguo diagrama taoÃƒÂ­sta. Ã‚Â¿EstÃƒÂ¡n buscando a un astuto asesino o a un espÃƒÂ­ritu airado? Un rastro de pruebas cada vez mÃƒÂ¡s sangriento les conduce en ambas direcciones.","torrent":{"xt":"urn:btih:66d19ef0e96344ff49fe7565e32e1b3de423839c","amp;dn":"Doble+Vision","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66d19ef0e96344ff49fe7565e32e1b3de423839c","infoHashBuffer":{"type":"Buffer","data":[102,209,158,240,233,99,68,255,73,254,117,101,227,46,27,61,228,35,131,156]},"announce":[],"urlList":[]}}