{"title":"Coast To Coast Am - 09-06-10 - New Jersey Cryptids &amp; Govt. Track","uid":5818731,"size":55491493,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:66d31c08caa907f59c60088a471c1bcfea293130&amp;dn=Coast+To+Coast+Am+-+09-06-10+-+New+Jersey+Cryptids+%26+Govt.+Track&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1283966264,"description":"Date: 09-06-10 \nHost: George Noory \nGuests: Loren Coleman, Craig Hulet  \nIn the first half, cryptozoologist Loren Coleman talked about his latest work on the Monsters of New Jersey including the Jersey Devil. The lore of the Jersey Devil goes back to 1735, when a Mrs. Leeds was having her 13th baby, and made a remark like 'the devil can have this baby.' The baby was reported to have a forked tail and could talk right away. It said some unkind words to the mother and then flew up the chimney and went off into the New Jersey Pine Barrens, he recounted. Over the years people have reported seeing a devil-like creature with horns and wings. In 1909, over a hundred people in the Pine Barrens area described seeing a creature like a flying horse or winged lion. In more recent years, what's called the Jersey Devil, is now described as more of a feral human/Bigfoot creature, Coleman pointed out. \n\nThere have been numerous reports of Bigfoot-type creatures in New Jersey dating back to the 1800s. Coleman believes that Bigfoot is a flesh and blood creature, not a paranormal manifestation, and that it could be related to the paranthropus breed of hominids, thought to be extinct. He also discussed sightings/reports of a giant bird or Thunderbird in the New Jersey area that made a sound like &quot;woo-woo-woo&quot; and was said in one instance in 1975 to cause a bush to be sucked up just by the power of its wings' flapping. \n\n\nIn the show's latter half, foreign policy analyst Craig B. Hulet discussed new rulings by the US government that infringe on people's privacy under the guise of the &quot;War on Terror.&quot; In a recent incident, law enforcement placed a GPS tracking device on a person's vehicle, without a warrant. The court ruled that this was legal because the person's home wasn't gated off from the public, he reported. In another case, a woman was arrested and convicted for videotaping police making an arrest of her neighbor, he detailed. We're seeing that &quot;more and more courts are ruling in favor of violations of our fundamental rights,&quot; especially our right to privacy, said Hulet. \n\nBody scans at airports, and other locations are actually being kept on file, when initially people were told this wouldn't be done, he noted, adding that such scans are even being done through vans on the streets. &quot;Once a government has been given a certain amount of power, it always seeks more,&quot; he cautioned. Unmanned drones are now being employed for surveillance on the US southern border, and Hulet suggested that it's just a matter of time before such drones are flying over major American cities. In the post 9-11 world, Americans have increasingly traded their liberty for security, he lamented. \n\nWebsite(s): \n-lorencoleman.com\n-cryptomundo.com\n-craigbhulet.com\nBook(s): \n-Monsters of New Jersey\n-Cryptozoology A to Z\n-The Copycat Effect\n-The Hydra of Carnage","torrent":{"xt":"urn:btih:66d31c08caa907f59c60088a471c1bcfea293130","amp;dn":"Coast+To+Coast+Am+-+09-06-10+-+New+Jersey+Cryptids+%26+Govt.+Track","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66d31c08caa907f59c60088a471c1bcfea293130","infoHashBuffer":{"type":"Buffer","data":[102,211,28,8,202,169,7,245,156,96,8,138,71,28,27,207,234,41,49,48]},"announce":[],"urlList":[]}}