{"title":"Robert Jordan - Het Rad des Tijds 7 - Een kroon met zwaarden TBS","uid":6464545,"size":900379753,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:68cda325bdc599031ecd2a13fb7a699a2bac7c5b&amp;dn=Robert+Jordan+-+Het+Rad+des+Tijds+7+-+Een+kroon+met+zwaarden+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1307915250,"description":"Audioboek - Robert Jordan - Het Rad des Tijds Boek 7 - EEN KROON VAN ZWAARDEN\n\n\nBeschrijving\n 'Het Rad des Tijds' is onbetwist de meest aansprekende fantasiecyclus van de afgelopen decennia. In dit ambitieuze epos verhaalt Robert Jordan van een profetie die lang geleden is gedaan, van een eeuw die lang geleden is voorspeld, de eeuw die nu is wedergekomen op het Rad des Tijds, alles wat was, wat is en wat zal zijn dreigt nu onder de Schaduw verloren te gaan. Want zo staat het geschreven....\n \n\n\n\nRecensie(s)\nNBD|Biblion recensie\n Vierduizend jaar geleden werd het uiterste Kwaad (de 'Duistere') verslagen tijdens het 'breken' van de wereld. Oude voorspellingen zeggen dat drie mensen het mystieke patroon van de wereld en het Rad des Tijds zullen herschikken. Het einde van de eeuw nadert en de voorspellingen beginnen in vervulling te gaan. Rhand Altor, de 'Herrezen Draak' (met de geest van Lews, de originele 'Draak', in zich), probeert de volkeren samen te brengen voor de laatste strijd tegen het kwaad en trekt ten strijde tegen Illian. Ook de Aes Sedai komen in actie en nieuwe groeperingen komen erbij. Maar de Duistere intrigeert achter dit alles. Rhand wordt koning van de wereld, maar zal zijn embleem, de nieuwe 'kroon van zwaarden', volstaan om de naderende storm tegen te houden? Wordt vervolgd... Vlot leesbaar fantasy-epos met levendig getekende personages en andere schepsels over de voortdurende strijd tussen goed en kwaad in een semi-middeleeuwse magische wereld. De overvloed van personages en complexiteit van de plots maken een normale synopsis onmogelijk. Deel 7 van de tot nu toe 11-delige serie 'Het rad des tijds', voorzien van uitgebreide (en nuttige) appendix. Kennis van de vorige delen is gewenst. Kleine druk.\n \n(Biblion recensie, Redactie) \n\nTBS","torrent":{"xt":"urn:btih:68cda325bdc599031ecd2a13fb7a699a2bac7c5b","amp;dn":"Robert+Jordan+-+Het+Rad+des+Tijds+7+-+Een+kroon+met+zwaarden+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cda325bdc599031ecd2a13fb7a699a2bac7c5b","infoHashBuffer":{"type":"Buffer","data":[104,205,163,37,189,197,153,3,30,205,42,19,251,122,105,154,43,172,124,91]},"announce":[],"urlList":[]}}