{"title":"STARGATE.SG-1.S06E20-22.SWESUB. -Lindoff.ISO","uid":5798804,"size":2282819584,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:68d9f5dc77915f4c932ad08ed5c2878770adb25c&amp;dn=STARGATE.SG-1.S06E20-22.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1283129868,"description":"Season 6, Episode 20: Memento\n\nOn a shakedown cruise of the Prometheus, the ship's hyperdrive regulator becomes \n\nirreparably damaged. A nearby planet was listed on the cartouche of addresses \n\nfound on Abydos and thus may have a stargate. After a short jump towards the \n\nplanet, the naquadria reactor overloads and must be jettisoned. After the reactor \n\nexplodes above the planet causing damage, the fate of SG-1 and the crew of the \n\nPrometheus is in the hands of a once Goa'uld-controlled world that they're off to \n\na rough start with.\n\t\n\nSeason 6, Episode 21: Prophecy\n\nOn a routine mission, SG-1 encounters a civilization desperate to be freed from \n\nthe clutches of a Goa'uld. While on the planet, Jonas falls ill and is suspended \n\nfrom active duty. His mysterious illness is diagnosed as a brain tumor but gives \n\nhim the unbelievable ability to glimpse the future, a future where O'Neill and \n\nSG-1 are walking into a trap!\n\t\n\nSeason 6, Episode 22: Full Circle\n\nWith Anubis heading to Abydos looking for a valuable artifact known as the eye of \n\nRa, ascended Daniel Jackson contacts Colonel O'Neill and the rest of SG-1 to have \n\nthem go to Abydos and find the eye before Anubis. With the help of Daniel, Jonas \n\nand Carter find a secret chamber where the eye is kept but not before O'Neill, \n\nTeal'c, Skaara, and a group of defenders are overrun and trapped inside the \n\npyramid housing the stargate. But Daniel also finds a tablet, written in ancient, \n\nsuggesting that there is an Ancient city, lost for thousands of years, that give \n\nEarth weapons with which to defeat Anubis. But the only way to get the tablet back \n\nto Earth for further translation and for the search for the lost city may be \n\nDaniel breaking the high rule of ascension and to destroy Anubis. If he doesn't, \n\nAbydos will be destroyed.\n\n\n\nSista avsnittet av sÃƒÂ¤song 6.","torrent":{"xt":"urn:btih:68d9f5dc77915f4c932ad08ed5c2878770adb25c","amp;dn":"STARGATE.SG-1.S06E20-22.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68d9f5dc77915f4c932ad08ed5c2878770adb25c","infoHashBuffer":{"type":"Buffer","data":[104,217,245,220,119,145,95,76,147,42,208,142,213,194,135,135,112,173,178,92]},"announce":[],"urlList":[]}}