{"title":"East-Tec Eraser 2011 9.9.87.100 Portable ","uid":6493536,"size":10758058,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:69c4b740b2260c2bb3759200c3124193bb07fa74&amp;dn=East-Tec+Eraser+2011+9.9.87.100+Portable+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1308981856,"description":"East-Tec Eraser 2011 9.9.87.100 Portable \n\nEast-Tec Eraser 2011 protects your privacy, identity and confidential information and removes all evidence of your computer and online activity. Eraser exceeds U.S. Department of Defense standards for the permanent erasure of digital information when erasing your Internet history, Web pages, pictures, unwanted cookies, chatroom conversations, confidential documents you want to get rid of or files deleted in the past.\n\nKey Features and Benefits:\n* Destroy all evidence of your online activities: Clean Web Sites, pictures, movies, video clips, sounds, e-mail messages, chat room conversation history, AutoComplete, etc.\n* Destroy sensitive data from your computer: Clean traces of the documents and pictures you've recently accessed, and make sure that the files you are deleting are really gone\n* Remove cookies placed on your computer by Web sites. Keep only the cookies you approve\n* Supports the most popular Web Browsers: Internet Explorer, Mozilla Firefox, America Online, MSN Explorer, Opera, Netscape Navigator, etc.\n* Supports all types of popular programs such as Messenger, Email, News, Player and P2P Programs\n* Very secure erasing: meets and exceeds the U.S. Department of Defense standards for the permanent erasure of digital information\n\n\nHome Page - http://www.east-tec.com\n\n","torrent":{"xt":"urn:btih:69c4b740b2260c2bb3759200c3124193bb07fa74","amp;dn":"East-Tec+Eraser+2011+9.9.87.100+Portable+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69c4b740b2260c2bb3759200c3124193bb07fa74","infoHashBuffer":{"type":"Buffer","data":[105,196,183,64,178,38,12,43,179,117,146,0,195,18,65,147,187,7,250,116]},"announce":[],"urlList":[]}}