{"title":"Soul Miners Daughter - The Sacred and Profane","uid":5792406,"size":67635594,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6a93ec8fb2e7b7bd597671498920d00f6d2b0246&amp;dn=Soul+Miners+Daughter+-+The+Sacred+and+Profane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mr.Pilkington","files":15,"time":1282901668,"description":"Soul Miners Daughter is a fantastic, but not widely known band out of Atlanta, Georgia. The band was created around 1996, and started off as the duo of Jennifer Nettles and Cory Jones, who met through a high school performing arts troupe. After they had procured a backup band they released The Sacred and the Profane and in 1998, Hallelujah, both of which sold well. Eventually the two records resulted in over 20,000 sales.\n\nThe sound of the band is a mixture of soul, blues, country, and folk, and Nettles and Jones manage to create fantastic harmonies. The feel of the albums is nicely varied. Punchy, soulful, a cappella, are all styles of music evident on both albums and in fact, they are both self released. The feel is very down to earth, and while you can tell the band is not big, the feel of the music doesn't suffer from it, and in fact the lack of expense in the music helps it. Anyone who likes music from the likes of Sarah McLachlan or Blue Rodeo will definitely appreciate this band.\n\nSadly, Soul Miners Daughter was disbanded at the height of their popularity due to reported creative differences between Jones and Nettles. However, Jennifer Nettles has formed the Jennifer Nettles Band which includes every member of the original band except Jones.\n\nTracks:\n1.  With Me\n2.  Tried Hard Enough\n3.  See Thru Me\n4.  Good For You\n5.  Rhapsody\n6.  The Beautiful Song\n7.  3 Stones Left\n8.  Blues For Angel\n9.  The Shade Of The Hand Of Fear\n10. She\n11. Steamroller Blues\n12. Bodies\n13. She (Live) Bonus\n\n\nTracks 1-12 encoded at 192kbps, live track 13 encoded at 96kbps","torrent":{"xt":"urn:btih:6a93ec8fb2e7b7bd597671498920d00f6d2b0246","amp;dn":"Soul+Miners+Daughter+-+The+Sacred+and+Profane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a93ec8fb2e7b7bd597671498920d00f6d2b0246","infoHashBuffer":{"type":"Buffer","data":[106,147,236,143,178,231,183,189,89,118,113,73,137,32,208,15,109,43,2,70]},"announce":[],"urlList":[]}}