{"title":"Endhiran(2010) - Bluray-Rip - 1/2DVDr - XviD - AC3 - 5.1 -[Raj14","uid":6375350,"size":2347592466,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c3b56cb3f5f34637d04ae5264bfca3a9d898ca0&amp;dn=Endhiran%282010%29+-+Bluray-Rip+-+1%2F2DVDr+-+XviD+-+AC3+-+5.1+-%5BRaj14&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"raj1402","files":1,"time":1304839703,"description":"Endhiran(2010) - Bluray-Rip - 1/2DVDr - XviD - AC3 - 5.1 -[Raj1402]\n\n\nDirected by     S. Shankar\nProduced by     Kalanithi Maran,W. Hansraj Saxena\nWritten by      S. Shankar,Sujatha Rangarajan,Madhan Karky\nScreenplay by   S. Shankar\nStory by        S. Shankar\nStarring        Rajinikanth,Aishwarya Rai,Danny Denzongpa\nMusic by        A. R. Rahman\nCinematography  R. Rathnavelu\nEditing by      Anthony\nStudio          Sun Pictures\nDistributed by  Sun Pictures,Gemini Film Circuit,Ayngaran International\n                Eros International, B4U Network\nRelease date(s) October 1, 2010 (Worldwide)\nRunning time    165 minutes\nCountry         India\nLanguage        Tamil\nBudget          Indian Rupee 132 crore\nGross revenue   Indian Rupee 375 crore\n\nSource................[ BD -50 DDR                   ]\nWaterMarked...........[ NO                           ]\nFormat................[ Matroska                     ]\nRipper................[ Raj1402                      ]\nRelease Date..........[ 08/05/2011                   ]\nRuntime...............[ 02:56:59                     ]\nResolution............[ 720x304                      ]\nDisplay aspect ratio..[ 2.35:1                       ]\nFrame Rate............[ 24 FPS                       ]\nDisks.................[ 1/2DVD-5                     ]\nSize..................[ 2.25GB                       ]\nColorimetry...........[ 4:2:0                        ]\nScan type.............[ Progressive                  ]\n\nVideo Codec...........[ XviD                         ]\nVideo Bitrate.........[ 1316Kbps                     ]\nAudio Codec...........[ AC3                          ]\nAudio Bitrate.........[ 448kbps                      ]\nChannel(s)............[ 6 channels                   ]\nChannel positions.....[ Front: L C R, Side: L R, LFE ]\nSampling rate.........[ 48.0 KHz                     ]\nResolution............[ 16 bits                      ]\nAudio Language........[ Tamil                        ]\nSubtitles.............[ ESubs                        ]\nContainer.............[ AVI                          ]\n\nThanks to Mike Khan for Bluray Source ...!\n!.. The Exclusive Encode... !\n  Enjoy    !!!\n\n\nDr. Vaseegaran (Rajinikanth), a professor specialized in robotics, creates a sophisticated android robot in his own likeness after a decade of intensive original research. He intends to present it to the Indian Army. His mother (Revathi Sankaran) suggests naming it Chitti Babu.\n\nAt the International Robotic Conference in India, Vaseegaran introduces Chitti (also played by Rajinikanth) to the delegates. In the meantime, it is revealed that Vaseegaran's mentor, Dr. Bohra (Danny Denzongpa) is preoccupied in a botched research project to create a similar superintelligent android robot. Meanwhile, Chitti endears himself to Vaseegaran's girlfriend, Sana (Aishwarya Rai) and helps her cheat in her medical school exams. When they are caught, Sana lies to the investigators that she does not know Chitti; thus Chitti learns that humans may choose to lie for self-preservation.\n\nVaseegaran prepares Chitti for a panel evaluation by the Artificial Intelligence Research and Development Institute (AIRD), which is headed by Dr. Bohra. The panel enquires whether Chitti's build conforms to the Three Laws of Robotics of Isaac Asimov. Vaseegaran replies in the negative. During evaluation, Chitti almost stabs Vaseegaran at Bohra's command. Bohra convinces the evaluation committee that Chitti could not be relied upon in the battlefield because he could be easily manipulated to turn against his handlers.\n\nVaseegaran decides to modify Chitti's neural schema to allow him to understand human behaviour and emotions. Later Chitti successfully applies his text book knowledge of symphysiotomy to handle the complicated childbirth of Latha (Devadarshini), Sana's friend. The procedure is covered live by the media. Dr. Bohra arrives to congratulate Dr. Vaseegaran on the achievement. He also lets Chitti pass the AIRD evaluation.\n\nSoon, Chitti begins to see Sana as its romantic interest and makes advances. This triggers a confrontation between Vaseegaran and Chitti. Sana tries to explain to Chitti that she can love him only as a friend and asks him to forget her. Chitti later deliberately fails in an evaluation conducted by the Indian Army. Vaseegaran chops Chitti into pieces and throws it away in a landfill site.\n\nBohra retrieves Chitti's parts from the junkyard and reassembles the android. He gives Chitti a new appearance, and embeds a &quot;red chip&quot; inside Chitti, thereby converting him into a ruthless terminator. Chitti gatecrashes Vaseegaran and Sana's wedding, then kidnaps and imprisons Sana. Calling himself &quot;Version 2.0&quot;, Chitti begins to create replicas and kills Dr. Bohra. Soon Chitti's army of robots cause mayhem in the city, and take over AIRD. Vaseegaran undertakes the task of stopping Chitti. Disguised as one of the robots, he successfully infiltrates the AIRD headquarters. He instructs the police to cut the power supply in the entire city. When Chitti and his army are about to run out of power, they find an alternate solution: they seize vehicles on the road and use the batteries to recharge themselves.\n\nChitti finds Vaseegaran, but as Chitti is about to kill him, the police force strikes AIRD. The robots assemble themselves into sphere, snake, tower, and drill bit formations to defend themselves. One of the robots is immobilized by a grenade explosion, and is taken into custody by Vaseegaran. He uploads a computer worm into Chitti's network which temporarily brings down the robot army. Chitti identifies the source of the worm and sends a &quot;self-destruct&quot; command to the robot. The robots assemble in the shape of a giant robot and chase Vaseegaran's armoured bus. Vaseegaran uses the data he had backed up from the destroyed robot to de-magnetise the robot army, collapsing the giant formation. Chitti is pulled into the bus by a huge magnetic wall, allowing Vaseegaran access to Chitti's internal control panel, through which he instructs all the other robots to self-destruct. He then removes the red chip thus calming down Chitti.\n\nIn a court hearing, the jury rules capital punishment for Vaseegaran, citing the large number of casualties and damages to public property caused by the robot army. Chitti, explaining to the court that the law allows it to be treated as material evidence, if not as a witness, explains that it was Dr. Bohra who caused Chitti's deviant behaviour. He shows the court, using his eyes as 3D projectors, the video footage of Dr. Bohra installing the red chip inside him. The court decides to drop all charges against Vaseegaran, while concluding that Chitti should be dismantled in order to avoid further mishaps of the same kind in future. Back at the lab, an emotional Vaseegaran tells Chitti to dismantle itself. While taking off its parts one by one, Chitti apologizes to Sana and Vaseegaran for the problems it caused.\n\nTwenty years later, in 2030, students in a science museum are escorted by a guide towards a showcase that has Chitti's body parts arranged. The guide tells the students that Chitti was the most advanced humanoid robot ever created, but it was dismantled due to &quot;certain reasons&quot;. A curious student (Shriya Sharma) asks why, to which Chitti's head responds, &quot;I started to think&quot;.\n\nHigh Speed Server Seeding,\nHappy Downloading!!![","torrent":{"xt":"urn:btih:6c3b56cb3f5f34637d04ae5264bfca3a9d898ca0","amp;dn":"Endhiran%282010%29+-+Bluray-Rip+-+1%2F2DVDr+-+XviD+-+AC3+-+5.1+-%5BRaj14","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c3b56cb3f5f34637d04ae5264bfca3a9d898ca0","infoHashBuffer":{"type":"Buffer","data":[108,59,86,203,63,95,52,99,125,4,174,82,100,191,202,58,157,137,140,160]},"announce":[],"urlList":[]}}