{"title":"Blink 182 - Reading &amp; Leeds Festival 2010 [DeZ]","uid":5801798,"size":172701510,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6c853e037bda832524b2d86fb4eb9b102a78a0f1&amp;dn=Blink+182+-+Reading+%26+Leeds+Festival+2010+%5BDeZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dcardo62","files":-1,"time":1283287879,"description":"Arguably one of the most influential groups of the nineties, pop punk pioneers Blink 182 formed in San Diego in 1992 with front man Tom DeLonge, bassist/vocalist Mark Hoppus, and drummer Scott Raynor making up the trio. They achieved their first taste of mainstream success with 1997's Dude Ranch which featured their fast paced teen anthem Dammit. Touring in 1998 saw drummer Raynor depart the group, replaced by new member Travis Barker. Further success beckoned when they released their smash hit Enema of The State in 1999, full of their signature tunes Adam's Song, All The Small Things and What's My Age Again. These hits made them MTV favourites and led to their cameo in the teen comedy American Pie.\n\nWith millions of record sales under their belt and headline tours worldwide, Blink 182 surprisingly announced an indefinite hiatus in 2005, with Tom DeLonge citing the need to spend more time with his family. Mark Hoppus and Travis Barker went on to make music with a new band, +44 and DeLonge recorded and toured with his new outfit Angels &amp; Airwaves.\n\nA series of events including the sudden death of their longtime producer Jerry Finn and a near fatal plane crash involving drummer Barker reunited the band in 2008, the threesome declaring at the 2009 Grammys that they were back for good. Embarking on their sixth album and now a European Tour, Blink 182 will headline the rockcentric Reading and Leeds festivals with their radio friendly pop-punk repertoire front and centre on the Main Stage.\n\n*Setlist not available, hopefully sombody can add it to the comments and I'll add it to the description*\n\nSource: BBC iPlayer\nVideo Format: .FLV (Play with VLC or WMP Classic)\nAudio: 2ch stereo\nSize: 164MB\nLength: 28:18","torrent":{"xt":"urn:btih:6c853e037bda832524b2d86fb4eb9b102a78a0f1","amp;dn":"Blink+182+-+Reading+%26+Leeds+Festival+2010+%5BDeZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c853e037bda832524b2d86fb4eb9b102a78a0f1","infoHashBuffer":{"type":"Buffer","data":[108,133,62,3,123,218,131,37,36,178,216,111,180,235,155,16,42,120,160,241]},"announce":[],"urlList":[]}}