{"title":"Hitler Mannerheim 1942 Conversation","uid":5797542,"size":9544729,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6e46318f455eb60619bb796edd735dc413176c24&amp;dn=Hitler+Mannerheim+1942+Conversation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Djofullinn","files":2,"time":1283121341,"description":"In the world's only recording in which Adolf Hitler speaks privately, taken in 1942, he has a &quot;conversation&quot; with the Finnish military commander, Marshal Carl Gustav Mannerheim, on progress on the war front -- its victories, and its setbacks.\n\nHitler's voice modulation and use of the language on the tape is quite different from the intensity of his public speeches of agitation -- in which he seems to be in a trance -- which were rehearsed to the last detail right down to the intonation of the sentences.\n\nThe recording by the Finnish Broadcasting Company (Yleisradio) was made secretly on June 4, 1942, at Marshal Mannerheim's 75th birthday party.\n\nTo everyone's surprise Hitler showed up himself to congratulate Mannerheim in the special train at Immola station near Imatra where the celebration was held.\n\nAfter the official speeches, the two leaders continued their conversation in the adjacent salon wagon.\n\nFor security reasons the train where the celebrations were held was moved to the forested area of Immola, a small station that was easy to guard, which was nevertheless as close as possible to the command headquarters in Mikkeli.\n\nHitler's visit to Finland was short, lasting only about six hours.\n\nThe unique recording of Hitler speaking off-guard was made by Yleisradio [Finnish National Radio] engineer Thor Damen, who had been ordered to record the official birthday speeches and Mannerheim's responses.\n\n&quot;Hitler never allowed himself to be photographed or recorded in private situations&quot;, says Lasse Vihonen, head of the Yleisradio archives.\n\n&quot;This recording was made in secret. When Hitler and Mannerheim went into the salon wagon for coffee, Damen placed his microphone on the hat rack. The cords came through the window, and the tape recorders themselves were in the next carriage&quot;, Vihonen explains.\n\nThe recording contains about five minutes of Hitler's official speech and Mannerheim's response. After that 11 minutes of their conversation came on tape.\n\nThe recording was suddenly cut off. Hitler's security men spotted the cords coming out of the window. They raised a fuss, threatening Damen with a gesture suggesting cutting of the throat.\n &lt;a href=&quot;\nhttp://www.fpp.co.uk/Hitler/docs/Mannerheim/recording_040642.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fpp.co.uk/Hitler/docs/Mannerheim/recording_040642.html&lt;/a&gt;\n\nEnglish translation included.","torrent":{"xt":"urn:btih:6e46318f455eb60619bb796edd735dc413176c24","amp;dn":"Hitler+Mannerheim+1942+Conversation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e46318f455eb60619bb796edd735dc413176c24","infoHashBuffer":{"type":"Buffer","data":[110,70,49,143,69,94,182,6,25,187,121,110,221,115,93,196,19,23,108,36]},"announce":[],"urlList":[]}}