{"title":"Rachid Taha - Made In Medina (2000)@flac","uid":5801702,"size":510714426,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ed4079581ee8025df700747cc1d6cefb968fd95&amp;dn=Rachid+Taha+-+Made+In+Medina+%282000%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alekow1","files":26,"time":1283282735,"description":"\nRachid Taha is not the first artist to blend Arab and Western musical styles, but he is certainly one of the most innovative. \nBorn in Algeria, but residing in France since age ten, Taha fronted a highly political punk band in his teens, then made his mark as an equally radical DJ before launching a solo career. \nMade in Medina is the latest in his string of crossover creations. Recorded on three continents and four countries (U.S., U.K., France, and Morocco), utilizing musicians from equally far flung locales, and overseen by long-time producer Steve Hillage, the album is brimming with the exotic and the familiar. \nWith lyrics in English, French, and, at one point, Berber, the sleeve notes provide English translations and explain the songs' core message and musical roots. \nLike a sumptuous banquet, Medina is a rich mix of dishes, one that will tempt even the most jaded palette. Inevitably, it will be branded world music, a label guaranteed to scare off much of Taha's prospective audience. \nThere's crunching punk numbers, as hardcore as any anarcho-punk band's, but sliced with techno beats, sure to appeal to Prodigy  fans. Spanish-flavored numbers are perfect for the salsa crowd, Afro-pop with a syncopated beat are sure to capture reggae fans, and there's even a space rock number for the ambient/prog rockers. With lyrical themes that run the gambit from alienation to the spiritual, Taha's appeal across genres is evident. \nAnd while it may sound like a shopping list for an international emporium, in fact, Medina has an extremely coherent sound, built on prominent, danceable rhythms, strong melodies, and powerful vocals, all shot through with a Middle Eastern flavor. \nA truly world sound. (AMG)\n\n\n\n\n\nAfter reinterpreting Arab classics on Diwan, Rachid Taha returns with a stunning collection of original compositions that owes as much to rock as to his Algerian rai roots, connecting the dots between Europe and the Maghreb. \nHere he again teams with producer Steve Hillage (Gong, System 7), whose guitar work and arrangements provide the muscular frameworks for Taha's songs and emotive voice. Rachid's new direction has all the power of rock, as on &quot;Foqt Foqt,&quot; which maintains an insistent riff while retaining the delicacy and polyrhythms characterizing North African music. \n&quot;Ala Jalkoum&quot; offers a duet with Afrobeat superstar Femi Kuti while &quot;Verite&quot; and &quot;Ho Cherie Cherie&quot; could have come from a Peter Gabriel album. \nMade in Medina is a massive, but still natural, step forward that establishes Taha as the most visionary Algerian singer today. (Amazon)\n\n\n\n\n\n01 - Barra Barra\n02 - Foqt Foqt\n03 - Medina (Album Version)\n04 - Ala Jalkoum\n05 - Aie Aie Aie\n06 - Hey Anta\n07 - Qalantiqa\n08 - En Retard\n09 - Verite\n10 - Ho Cherie Cherie\n11 - Garab\n\n\n\n\nPersonnel includes: \nRachid Taha (vocals); Steve Hillag (guitar, programming); Jeff Raines (guitar); Mahmoud Serour, Bob Loveday (violin); Geoff Richardson (viola); Helen Liebmann (cello); Jean-Max Mery, Rich Vogel (keyboards); Robert Mercurio (bass); Stanton Moore, Abdel Abrit (drums); B'net Marrakesh, Hakim Hamadouche (percussion, background vocals); Hossam Ramzy, Hassan Lachal, Magid Serour (percussion).\n\n\nRecorded at Milo, The Garden, A-Wave, London, England; American Sector, New Orleans, Louisiana; Studio De Belleville, Paris, France\n\n\nLabel: Barclay\nOriginal Release Date: November 7, 2000\nCatalogue: 543 995-2\n\n\n\n\nCompression Level: 5\nCovers Included (400dpi)\n\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:6ed4079581ee8025df700747cc1d6cefb968fd95","amp;dn":"Rachid+Taha+-+Made+In+Medina+%282000%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ed4079581ee8025df700747cc1d6cefb968fd95","infoHashBuffer":{"type":"Buffer","data":[110,212,7,149,129,238,128,37,223,112,7,71,204,29,108,239,185,104,253,149]},"announce":[],"urlList":[]}}