{"title":"Democracy Now - 05 may 2011","uid":6369086,"size":452741591,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6f12571003c9ab2008042002c14841f9df4b1ecb&amp;dn=Democracy+Now+-+05+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1304612713,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 05, 2011\n\n- Obama: U.S. Won't Release Bin Laden Photos\n- Pakistan Claims It Warned CIA of bin Laden Compound\n- American Indian Groups Seek U.S. Apology for Labeling Bin Laden &quot;Geronimo&quot;\n- Gaddafi Forces Attack Aid Ship\n- ICC Prosecutor Unveils Plan for Libya Warrants\n- Obama Admin to Propose Lower Corporate Tax Rate\n- U.S. House OKs Anti-Abortion Bill\n- Illinois Drops Out of &quot;Secure Communities&quot; Program\n- Palestinian Factions Sign Unity Deal in Egypt\n- Syria Extends Crackdown to Damascus Suburb\n- Ashcroft Hired as Blackwater &quot;Ethics&quot; Director\n\n\nSpecial reports\n\n- Pakistani Military Faces Scrutiny As Unfolding Evidence Suggests Direct Role in Harboring bin Laden\n\nNumerous questions have been raised on how Osama bin Laden could have been living in the Pakistani city of Abbottabad just down the street from Pakistan's premier military academy. CIA Director Leon Panetta has reportedly said Pakistan was either &quot;knowledgeable or incompetent&quot; when it came to bin Laden's whereabouts. Some evidence has emerged to indicate that the Pakistani military may have had a direct role in harboring bin Laden. Meanwhile, the Pakistani government is claiming it warned U.S. intelligence two years ago about the compound where bin Laden was killed. We go to Pakistan to speak with Graeme Smith, an award-winning foreign correspondent for The Globe and Mail newspaper in Canada. He was in Abbottabad yesterday investigating the mystery behind the bin Laden compound.\n\n\n- Physicians Urge Obama Admin to Pressure Mideast Ally Bahrain to End Repression of Doctors, Patients\n\nThe Gulf nation of Bahrain has announced that 47 medical workers who treated pro-democracy protesters during the nation's popular uprising will be tried before a military court on charges of acting against the state. Some could face the death penalty for providing medical assistance to protesters. Human rights groups say the arrests are part of a campaign of intimidation that runs directly counter to the Geneva Convention, which guarantees medical care to people wounded in conflict. We speak with Richard Sollom of Physicians for Human Rights. He recently traveled to Bahrain to document the situation there, and is the co-author of a new report, &quot;Do No Harm: A Call for Bahrain to End Systematic Attacks on Doctors and Patients.&quot;\n\n\n- Freed U.S. Hiker Sara Shourd Won't Return to Iran for Espionage Trial Alongside Jailed FiancÃƒÂ©, Friend\n\nMonths after her release from an Iranian prison, U.S. citizen Sarah Shourd has announced she will not return to Tehran next week to face espionage charges. Shourd was jailed for 14 months after she and friends, Josh Fattal and Shane Bauer, were detained by Iranian forces on July 31, 2009, for allegedly hiking across the Iraqi border into Iran. The trial for Bauer-who is now Shourd's fiancÃƒÂ©-and Fattal begins May 11. Shourd had planned to return to Iran, but has cancelled her trip because she is suffering from post-traumatic stress disorder.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6f12571003c9ab2008042002c14841f9df4b1ecb","amp;dn":"Democracy+Now+-+05+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f12571003c9ab2008042002c14841f9df4b1ecb","infoHashBuffer":{"type":"Buffer","data":[111,18,87,16,3,201,171,32,8,4,32,2,193,72,65,249,223,75,30,203]},"announce":[],"urlList":[]}}