{"title":"DE VLIEGENIERSTER VAN KAZBEK(2010) DVDR NL Sub NLT-RELEASE (divx","uid":5816395,"size":911678699,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f26e346130f20ed9cd65f251a19c0c9dcc03609&amp;dn=DE+VLIEGENIERSTER+VAN+KAZBEK%282010%29+DVDR+NL+Sub+NLT-RELEASE+%28divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"luiehond69","files":6,"time":1283856863,"description":"DE VLIEGENIERSTER VAN KAZBEK(2010) DVDR NL Sub NLT-RELEASE (divx)\n\nDe Vliegenierster van Kazbek speelt zich af tegen de achtergrond van de Tweede Wereldoorlog.\n Op het eiland Texel woont de dromerige Marie. De komst van een groep Georgische soldaten, waaronder een muzikant en een filmoperateur, \nzorgt voor veranderingen. Goga en zijn vrienden brengen op het grauwe Noordzee-eiland kleur, leven en liefde in het bestaan van Marie.\n Aangespoord door de heldin van de Sovjet-filmmusical 'De Vliegenierster van Kazbek', die de GeorgiÃƒÂ«rs met zich meezeulen, \nen bij iedere gelegenheid die zich voordoet bekijken, neemt Marie haar lot in eigen handen. \nTemidden van de chaos van hun vrijheidstrijd ontworstelt zij zich aan de beklemmende werkelijkheid door te leren vertrouwen op haar fantasie.\n==============================================================================================================================================\nOn the island Texel, Marie dreams about mountains; she collects postcards of mountains all over the world. \nShe would love to do something else with her life, but as the only girls in a big poor family in wartime, Marie has no choice: she must marry Paul. \nThe extreme religious and narrow minded population at the island expects her to behave. \nThe arrival of a group of Georgian soldiers brings color, life en love in Marie's life at the colorless Nordsea island. \nWith their music and film, but especially with their inventive and unusual surviving strategies and their radically different vision on life, \nthis isolated group foreigners help Marie to find herself. \nFor the first time in her life, Marie falls in love. Unfortunately, her love for soldier Goga from Kazbek and the friendship with the other soldiers, \nis not accepted by her family and the other people on the island. \nExhorted by the female hero in the Soviet musical 'The Aviatrix of Kazbek', the only film the Georgians carry with them and show as much as possible, \nMarie takes destiny in her own hands. When the Georgians eventually come in insurrection against the Germans, Marie chooses their side. \nShe finds a unsuspected inner strength during the atrocious aftermath of this resistance, \ninnumerable Georgians get killed, and Goga becomes a prisoner of war.\n\n\nGEGEVENS:\nAlternatieve titel:The Aviatrix of Kazbek\nCategorie: Drama\nKwaliteit: DVDR\nTaal: Nederlands  Georgische  Duits\nSub: Nederlands ingebakken \nland van herkomst : Nederland, BelgiÃƒÂ« \njaar: 2010\nGrote: 869 MB\ntijdsduur: 1.39.27\nbestand: Divx\nvideo codec: XVID\nbitrate: 1193 Kbps\nafmetinge: 720 X 400\ngeluidsindeling:AC3 448 kbps\n\ninfo:\nimdb:http://www.imdb.com/title/tt1234540/\nmoviemeter:http://www.moviemeter.nl/film/50444\n-----------------------------------------------------------------------------------ENJOY THE MOVIE :D  NO SEEDS LET ME KNOW  ","torrent":{"xt":"urn:btih:6f26e346130f20ed9cd65f251a19c0c9dcc03609","amp;dn":"DE+VLIEGENIERSTER+VAN+KAZBEK%282010%29+DVDR+NL+Sub+NLT-RELEASE+%28divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f26e346130f20ed9cd65f251a19c0c9dcc03609","infoHashBuffer":{"type":"Buffer","data":[111,38,227,70,19,15,32,237,156,214,95,37,26,25,192,201,220,192,54,9]},"announce":[],"urlList":[]}}