{"title":"Jig A Pix - Wild (DSi Enchanced) (EU)(m6) (NL)","uid":5815209,"size":33626946,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:6fe062b82bea9de9eb728444ecee0f9ee8daf266&amp;dn=Jig+A+Pix+-+Wild+%28DSi+Enchanced%29+%28EU%29%28m6%29+%28NL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1283793855,"description":"Jiga Pix: Wild World brengt leuke puzzel-actie naar jouw Nintendo DS! En dat mag je in dit geval heel letterlijk nemen; Jiga Pix: Wild World bevat tachtig leuke puzzels met prachtige afbeeldingen van de natuur.\n\nIn Jiga Pix: Wild World krijg je puzzels met afbeeldingen van de bodem van de oceaan, uitgestrekte vlaktes van Afrika en ondoordringbare tropische jungles voor je kiezen. Natuurlijk zijn ook de dieren, zoals reptielen, apen, vogels, insecten en katachtigen op de gevoelige plaat vast gelegd.\n\nJiga Pix: Wild World bevat single- en multiplayer opties. Je kunt de puzzelstukjes gemakkelijk met de stylus op het touchscreen van Nintendo DS op hun plek leggen. De puzzels variÃƒÂ«ren van heel gemakkelijk tot ongelooflijk ingewikkeld. Op deze manier kan elke puzzelaar er op zijn eigen manier plezier uit halen.\n\nVoor de Nintendo DSi bevat Jiga Pix: Wild World extra mogelijkheden. Je kunt je zelfgemaakte foto's tot puzzels omtoveren. Dat gaat ongetwijfeld voor leuke breinbrekers zorgen!\n\nIedereen kan puzzelen met Jiga Pix: Wild World op de Nintendo DS!\n","torrent":{"xt":"urn:btih:6fe062b82bea9de9eb728444ecee0f9ee8daf266","amp;dn":"Jig+A+Pix+-+Wild+%28DSi+Enchanced%29+%28EU%29%28m6%29+%28NL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fe062b82bea9de9eb728444ecee0f9ee8daf266","infoHashBuffer":{"type":"Buffer","data":[111,224,98,184,43,234,157,233,235,114,132,68,236,238,15,158,232,218,242,102]},"announce":[],"urlList":[]}}