{"title":"Coast To Coast Am - 09-05-10 - Mysterious &amp; Unusual Accounts","uid":5815499,"size":55564955,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:719a3fbb28df4af11c6a748420bd8912c6de758c&amp;dn=Coast+To+Coast+Am+-+09-05-10+-+Mysterious+%26+Unusual+Accounts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1283806279,"description":"Date:  \t09-05-10\n\n\nHost: \tGeorge Noory\n\n\nGuests: \tJoye Pugh, Jerome Corsi, Lionel Fanthorpe\n\nIn the second half of the show, author Lionel Fanthorpe recounted stories of the mysterious and the unusual, including favorites such as the moving coffins of Barbados and Spring Heeled Jack. He also talked about psychic premonitions such as when in 1909 a man called Claude Sawyer, traveling on the SS Waratah, had a terrifying vision of a sword and blood dripping from a hand. He believed the vision represented a terrible fate that was going to overtake the ship and so he got off at the port of Durban. The ship subsequently disappeared and was lost at sea, with 211 passengers and crew aboard.\n\nFanthorpe also shared incidents of &quot;time slips.&quot; One such incident took place at Wroxham Broad in Norfolk, England. In 1603, two friends were swimming together but suddenly found themselves on dry land, dressed as Roman officers in a large amphitheater-- curiously they were not disturbed to find themselves shifted and temporarily forgot their previous circumstance, he detailed.\nProphecy &amp; Pineal Gland\n\nIn the second hour, Dr. Joye Pugh shared her ideas about biblical prophecy, and how prophecies are perceived. Calling the pineal gland &quot;the seat of the soul,&quot; she suggested that this small cone-like structure can function like a transmitter and receiver and may be connected with the ability to make prophecies. Yet, this gland can be manipulated by negative or Satanic forces, she warned, &quot;allowing something from another dimension to step into you.&quot;\nEconomic Outlook\n\nFirst hour guest, author Jerome Corsi offered commentary on current events and the economy. He reported that there are currently over 800 banks on the FDIC's &quot;problem list,&quot; and more than half of these banks could fail, which would negatively impact small communities. He also expressed concern that the US government may force people with 401K and IRAs to invest part of their funds in the Treasury debt.\nWebsite(s):\n\n    * drjoye.com\n    * gilfordsecurities.com\n    * lionel-fanthorpe.com\n","torrent":{"xt":"urn:btih:719a3fbb28df4af11c6a748420bd8912c6de758c","amp;dn":"Coast+To+Coast+Am+-+09-05-10+-+Mysterious+%26+Unusual+Accounts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"719a3fbb28df4af11c6a748420bd8912c6de758c","infoHashBuffer":{"type":"Buffer","data":[113,154,63,187,40,223,74,241,28,106,116,132,32,189,137,18,198,222,117,140]},"announce":[],"urlList":[]}}