{"title":"Korn - Live &amp; Rare (2006) WMA320","uid":6334802,"size":156914089,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71b1cff4793ba7ee903d94757e2d5fd171f1d738&amp;dn=Korn+-+Live+%26+Rare+%282006%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1303422333,"description":"While not the greatest live and/or rare compilation ever made, it is slightly better than many are giving it credit for. Rare doesn't necessarily mean stuff you can't get anymore/anywhere else/out of print whatever. Just because its on the soundtrack to some crappy movie doesn't mean its not rare. Its just the idea that its a couple of rare things on one Korn cd instead of buying all this other stuff. Like a crappy soundtrack you're never going to listen to again but only bought for one song. Me, I'd rather just buy this. And the Earache my eye is an extended version.. not the same one that appears on Follow The Leader. Let's get that one straight right now. The live stuff is incredible (especially the live version of Another Brick In The Wall that destroys the album version) except for two things. Firstly, the edited version of Right Now (while musically phenomenal) is unnecessary and makes them sound weak hearing JD say 'shut up, shut up I'll bust you up' and then 'I know I hate you' at the end instead of what he actually says. For anyone who knows the actual song.. ya that ruins it quite a bit and just comes across lame. I can ignore this one flaw on an otherwise pretty good album. The other thing is they didn't need to put the cover of Metallica's One on here. I guess its cool that its on it's own track instead of at the end of another but.. once you've heard this cover a few times there's not much too it anyway. A couple of minor things that separate this good compilation from being great. And yeah they really could have put more on here but it is what it is (and doesn't suck). If you're a completist needing rare tracks and don't already have whatever soundtrack Proud is off of or if you wanna hear some good live music (where Korn is usually best anyway) its worth picking up (and skipping over Right Now). You never know, if enough people buy this cd maybe they will release more rare Korn\n\nby Ed &quot;Geekezoid&quot;\n\nTRACKLIST:\n\n01 - Did My Time (Live).wma                                           \n02 - Blind (Live).wma                                                 \n03 - Falling Away From Me (Live).wma                                  \n04 - Right Now (Live).wma                                             \n05 - Got The Life (Live).wma                                          \n06 - Here To Stay (Live).wma                                          \n07 - Freak On A Leash (Live).wma                                      \n08 - Another Brick In The Wall (Parts 1, 2, 3).wma                    \n09 - One (Live Cover On Metallica).wma                                \n10 - My Gift To You (Live).wma                                        \n11 - A.D.I.D.A.S. (Live).wma                                          \n12 - Earache My Eye (Cover On Cheech And Chong).wma                   \n13 - Proud (Soundtrack).wma  \n\nWMA 320Kbps 44100Hz STEREO\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!      ","torrent":{"xt":"urn:btih:71b1cff4793ba7ee903d94757e2d5fd171f1d738","amp;dn":"Korn+-+Live+%26+Rare+%282006%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71b1cff4793ba7ee903d94757e2d5fd171f1d738","infoHashBuffer":{"type":"Buffer","data":[113,177,207,244,121,59,167,238,144,61,148,117,126,45,95,209,113,241,215,56]},"announce":[],"urlList":[]}}