{"title":"NLSA.Nova.v2.2c.WinALL.Regged-BLiZZARD","uid":6497895,"size":19056184,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71b5d92454d432beb2db74f32d84fcae53132444&amp;dn=NLSA.Nova.v2.2c.WinALL.Regged-BLiZZARD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1309140882,"description":"NLSA Nova v2.2c\n\nNova for Windows has become the most popular Windows-based satellite tracking program in the world. In use by NASA, the U.S. Air Force, industry, and thousands of amateur radio operators, Nova sets the standard for excellence. Nova includes realistic maps that are shaded to show vegetation, topography, and ocean bathymetry. Satellite positions are shown with accompanying ground tracks, orbital paths, and star background.\n\nNova for Windows includes:\n\nFast, accurate real-time tracking information for an unlimited number of of Earth-orbiting satellites.\nFull-color 3-D maps.\nBuilt-in autotracking for turning az/el antennas.\nControl antennas with the computer joystick\nSuper-simple updates of Keplerian Elements... AMSAT or NASA 2-line format.\nOne-click updating of Keplerian elements via the internet (HTTP &amp; FTP). Can be completely automated for regularly scheduled updates.\nAutomatic time setting via the internet\nEasy-to-use frequency display.\nCapture maps and save them to disk, or e-mail to someone else\nAutomatic sound alarms for satellite AOS, TCA, and LOS.\nInformation-rich graphics + text satellite tracking screens.\nAlso tracks the Moon, Sun, planets, cosmic noise sources, and cold sky. Displays the star background, too\nContext-sensitive online Help available at all times. You can preview the entire Help file if you want to.\nExceptional speed and accuracy using James Miller's Plan-13 or T.S. Kelso's adaptation of SGP4/SDP4 tracking algorithms.\nFull implementation of Escobal's fast rise-set algorithm for nearly-instant AOS/LOS calculations.\nComplete listing capability for printed output of future passes, mutual windows, two-satellite mutual visibility, satellite eclipses.\nSophisticated fully-editable or automatic &quot;Script Tracking&quot; for scheduling future passes of multiple satellites. Nova for Windows can priority-autotrack dozens of satellites.\nHere are links to Nova for Windows' User's Manual and Help file\nQuick-Tips shows how easy it is to get started with Nova for Windows (Adobe Acrobat format).\nIf you like to write your own programs, NfW's DDE specifications are here. Here are code examples for DDE using Visual Basic, Delphi, Perl, and C++*.\n\n\n* Visual Basic DDE example by Dave Lamont (Uni-Trac), Perl example by Richard Cantzler (Univ. of Illinois), C++ DDE example by Rick Ruhl (Creative Services Software).\n\n\n\nHome Page - http://www.nlsa.com/\n\n","torrent":{"xt":"urn:btih:71b5d92454d432beb2db74f32d84fcae53132444","amp;dn":"NLSA.Nova.v2.2c.WinALL.Regged-BLiZZARD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71b5d92454d432beb2db74f32d84fcae53132444","infoHashBuffer":{"type":"Buffer","data":[113,181,217,36,84,212,50,190,178,219,116,243,45,132,252,174,83,19,36,68]},"announce":[],"urlList":[]}}