{"title":"Country House Revealed  (BBC 2011 - Complete)","uid":6494680,"size":3699706693,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:721c2b6916056d94e26abf8a38dc64a34453f633&amp;dn=Country+House+Revealed++%28BBC+2011+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":7,"time":1309016913,"description":"Country House Revealed all 6 parts BBC (2011)\n\nSpanning the architectural history of the country house from the disarming Elizabethan charm of South Wraxall, the classical rigour of Kinross in Scotland, the majesty and ingenuity of Hawksmoor's Easton Neston, the Palladian sweep of Wentworth Woodhouse, with over 300 rooms and frontage of 600 feet, the imperial exuberance of Clandeboye, through to the ebullient vitality of Lutyens' Marshcourt, the stories of these houses tell the story of our nation. All are the are buildings of the greatest architectural interest, each with a fascinating human story to tell, and all remain private homes that are closed to the public. But their owners have opened their doors and allowed Dan Cruickshank to roam the corridors and rummage in the cellars as he teases out the story of each house - who built them, the generations who lived in them, and the families who lost them. Along the way he has uncovered tales of excess and profligacy, tragedy, comedy, power and ambition. And as these intriguing narratives take shape, Dan shows how the story of each house is inseparable from the social and economic history of Britain. Each one is built as a wave of economic development crests, or crumbles. Each one's architecture and design is thus expressive of the aims, strengths and frailties of those who built them. Together they plot the psychological, economic and social route map of our country's ruling class in a rich new telling of our island story.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:721c2b6916056d94e26abf8a38dc64a34453f633","amp;dn":"Country+House+Revealed++%28BBC+2011+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"721c2b6916056d94e26abf8a38dc64a34453f633","infoHashBuffer":{"type":"Buffer","data":[114,28,43,105,22,5,109,148,226,106,191,138,56,220,100,163,68,83,246,51]},"announce":[],"urlList":[]}}