{"title":"Hazmat Modine","uid":5782159,"size":120818047,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:727bc6471816437db1f53ad3fd4dad6d838fef5d&amp;dn=Hazmat+Modine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bLast00","files":16,"time":1282462879,"description":"It's a fairly good bet you won't hear another record like Bahamut  any time soon -- because there isn't one. Hazmat Modine tap into the deepest veins of raw, unpolluted prewar blues and ancient jazz, then whip them up in a blender, tossing in strains of Caribbean calypso and ska, Eastern European klezmer and Balkan brass, Middle Eastern mystery, and more than a few unidentifiable elements that just somehow fit. The result is music that sounds at once ageless and primeval, authentically indigenous and inexplicably otherworldly, familiar and unlike anything else. Hazmat Modine revolve around the vision of Wade Schuman, a virtuoso on the diatonic and chromatic harmonicas and a variety of guitars who then mixes and matches his machines to a variety of other instruments till he arrives at that place his head has been visiting. Those instruments include the commonplace (drums, trumpets), the unexpected (Hawaiian steel guitar, lots of tubas), and those you're just not going to find down at the local music shop (cimbalom, zamponia, claviola). With that arsenal and sympathetic players at hand, Schuman  invents. Sometimes, as in &quot;Lost Fox Train,&quot; he's on his own, unreeling a thrilling solo harmonica piece that nudges the instrument out past the town limits. Alone again on &quot;Ugly Rug,&quot; it's just Schuman and his lute guitar. For &quot;It Calls Me&quot; (on which Schuman's usually rough-hewn vocals slide up the scale and recall the late Alan &quot;Blind Owl&quot; Wilson of Canned Heat), &quot;Everybody Loves You,&quot; and &quot;Man Trouble,&quot; he brings in the legendary Tuvan throat singers Huun-Huur-Tu, whose amphibian warblings may or may not have met up with tuba and Hawaiian steel guitar before, but probably never within the same song. If all of this sounds a bit deliberate and precious, the relieving news is that it's not. Hazmat Modine are unconventional in every sense, but theirs is listener-friendly music, nothing that requires a degree in ethnomusicology to enjoy. Many other bands, from Dan Hicks &amp; His Hot Licks to the Cheap Suit Serenaders, and from the Jim Kweskin Jug Band to Squirrel Nut Zippers, have mined forgotten caves of Americana before, but Hazmat Modine's widened the playing field here, taking the resurrection international on this stunning debut. ","torrent":{"xt":"urn:btih:727bc6471816437db1f53ad3fd4dad6d838fef5d","amp;dn":"Hazmat+Modine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"727bc6471816437db1f53ad3fd4dad6d838fef5d","infoHashBuffer":{"type":"Buffer","data":[114,123,198,71,24,22,67,125,177,245,58,211,253,77,173,109,131,143,239,93]},"announce":[],"urlList":[]}}