{"title":"Madden 11 [NTSC] [PS2]","uid":5775402,"size":1439727742,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7286ab976795b3094f50fc91d0f013fcb9ed286b&amp;dn=Madden+11+%5BNTSC%5D+%5BPS2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CivicScootin","files":-1,"time":1282248372,"description":"Madden 2011\n\nSYSTEM: PS2\nREGION: USA [NTSC]\nESR PATCH: NO\nWORKS ON HDLOADER: NOT TESTED\n\n\nDescription:\nMadden NFL 11 is the 22nd annual release in video gaming's longest-running and best-selling sports series. With a number of refined features, the 2010-released game aims to make play more accessible and efficient, without sacrificing the depth and flexibility valued by hardcore gridiron strategists. The new &quot;GameFlow&quot; system puts gamers in the position of the quarterback, suggesting suitable play-calls that can be quickly selected through a streamlined interface. By making it easier for gamers to immediately locate and select the most commonly called plays in each situation, the system can reduce the real time a full four quarters of football  takes, however, virtual coaches still have the option to pull up over 350 pre-designed plays, or to create their own. Following a trend in recent Madden games and other EA Sports titles, the default control schemes in NFL 11 rely more heavily on the two analog sticks, instead of multiple button-press sequences. Madden NFL 11 features all the contemporary arenas, teams, and players of the real-life league, including cover-athlete Drew Brees, quarterback and MVP of the Super Bowl 44-winning New Orleans Saints. The voices of Gus Johnson and Cris Collinsworth provide play-by-play and color commentary.\n\nEnjoy &amp; please help seed","torrent":{"xt":"urn:btih:7286ab976795b3094f50fc91d0f013fcb9ed286b","amp;dn":"Madden+11+%5BNTSC%5D+%5BPS2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7286ab976795b3094f50fc91d0f013fcb9ed286b","infoHashBuffer":{"type":"Buffer","data":[114,134,171,151,103,149,179,9,79,80,252,145,208,240,19,252,185,237,40,107]},"announce":[],"urlList":[]}}