{"title":"Potiche.2011.FRENCH.DVDRiP.XViD-FiCTiON.avi","uid":6461940,"size":518297964,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7336c3b1378c1a1381cdf17e7137feac7d7851c5&amp;dn=Potiche.2011.FRENCH.DVDRiP.XViD-FiCTiON.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"greggie85","files":1,"time":1307803852,"description":"Based on a French play, Potiche (aka. Trophy Wife) is set in 1977. Suzanne Pujol (Catherine Deneuve), a 'trophy housewife', finds out she must step up to manage her tyrannical husband Robert's (Fabrice Luchini) umbrella factory after the workers go on strike and take him hostage. To everyone's surprise, Suzanne proves herself to be a very competent leader of action. Her adult son and daughter also start to take more interest in the workings of the factory. Things get complex, however, when she bumps into her old flame and local politician, Maurice Babin (GÃƒÂ©rard Depardieu), and her husband returns to take back his job.\n\nDirected by FranÃƒÂ§ois Ozon (Swimming Pool), this is a well-done, entertaining and visually attractive satire. A mixture of pastel and hot colors permeate throughout the film, along with bell-bottoms, retro hairstyles, design patterns, and clothing. The colorful umbrellas in the film are perhaps a good reminder of Deneuve's older, famous film, The Umbrellas of Cherbourg. The colorful, playful, comedic tone of this film remains consistent, yet there are just enough complexities in the plot to keep the film from getting dull. ","torrent":{"xt":"urn:btih:7336c3b1378c1a1381cdf17e7137feac7d7851c5","amp;dn":"Potiche.2011.FRENCH.DVDRiP.XViD-FiCTiON.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7336c3b1378c1a1381cdf17e7137feac7d7851c5","infoHashBuffer":{"type":"Buffer","data":[115,54,195,177,55,140,26,19,129,205,241,126,113,55,254,172,125,120,81,197]},"announce":[],"urlList":[]}}