{"title":"Sudoku Master [Esp]","uid":5820919,"size":16797977,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:735391ccb115beb419525c663e9d9cbb1170af0e&amp;dn=Sudoku+Master+%5BEsp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":3,"time":1284043314,"description":"El pasatiempo numÃƒÂ©rico, conocido como Sudoku, se ha hecho hueco entre toda la poblaciÃƒÂ³n. NiÃƒÂ±os, jÃƒÂ³venes y mayores, parecen haber caido rendidos ante este pasatiempo que requiere de grandes dosis de paciencia. Parece ser que una vez lo pruebas, no puedes parar de hacer Sudokus. Primero en papel, ya sea en periÃƒÂ³dicos o libros de pasatiempo. Y ahora llega a nuestra Nintendo DS. Sudoku Master te permite realizar un entretenido pasatiempo sin necesidad de papel y bolÃƒÂ­grafo. Mediante la pantalla tÃƒÂ¡ctil podremos resolver este adictivo y divertido pasatiempo, con gran rapidez y facilidad. Tocas la casilla a rellenar y sobre la tÃƒÂ¡ctil escribes la cifra o bien la seleccionas del cuadro numÃƒÂ©rico. \n-Jugabilidad: \nComo la mayorÃƒÂ­a sabrÃƒÂ¡, las reglas del juego son sencillas. Contamos con una matriz de 9x9 a rellenar, con nÃƒÂºmeros del 1 al 9. Lo ÃƒÂºnico que no debemos olvidar es que no pueden repetirse ni los subcuadros de 3x3 ni en cada fila o columna. \nSudoku Master ofrece divertido sistema que te premia con estrellas si juegas bien. Si ganas muchas estrellas, podrÃƒÂ¡s hacer una prueba para demostrar tus habilidades. Ã‚Â¡Si la pasas, ganarÃƒÂ¡s un premio especial y accederÃƒÂ¡s a nuevos sudokus! \nComo ya comentÃƒÂ©, contamos con 400 puzzles divididos en cuatro niveles de dificultad (prÃƒÂ¡ctica, fÃƒÂ¡cil, normal y difÃƒÂ­cil), la diferencia radicaba en la cantidad de nÃƒÂºmeros dados de origen. AdemÃƒÂ¡s aparece un Modo de PrÃƒÂ¡ctica con diez Sudokus, que nos permite familiarizarnos con el juego, ya que nos marcarÃƒÂ¡ en rojo los nÃƒÂºmeros mal situados. Cuenta tambiÃƒÂ©n con un mini tutorial que nos explicarÃƒÂ¡ los controles a utilizar asÃƒÂ­ como las normas. \nY por si esto fuera poco, existe el Modo Contrareloj, en el que pondremos a prueba nuestra destreza a la par que la rapidez para llevar a cabo el rompecabezas ya que tendremos un tiempo lÃƒÂ­mite. En este modo contamos con cuatro pruebas diferentes que aumentan su complejidad a medida que avanzamos. \nA la hora de guardar partida, podremos hacerlo cuando queramos, incluso si estÃƒÂ¡ a medio hacer, pero sÃƒÂ³lo podremos guardar uno. Si empezamos uno nuevo se borran los avances del anterior. \nEn cuanto a la forma de escribir, podremos hacerlo de forma manual o con un teclado situado en la tÃƒÂ¡ctil. El sistema es sencillo, seleccionamos el recuadro a rellenar y a continuaciÃƒÂ³n usamos un mÃƒÂ©todo u otro. Tened cuidado la forma manual, pues el reconocimiento de escritura no parece estar muy pulido y puede dar errores. TambiÃƒÂ©n contamos con la opciÃƒÂ³n de realizar anotaciones en pequeÃƒÂ±o si queremos barajar posibilidades. \nContamos con numerosas opciones, desde botones para deshacer y rehacer, pasando por indicarnos con un doble toque la posiciÃƒÂ³n del resto de nÃƒÂºmeros iguales al marcado, hasta resaltarse las nueve cifras iguales que hemos conseguido colocar bien. \n-GrÃƒÂ¡ficos y Sonidos: \nAl encontrarnos ante un pasatiempo, no cabe esperar un apartado grÃƒÂ¡fico espectacular. Se limita a cumplir con lo que necesita este juego. Durante el juego todo se mantiene idÃƒÂ©ntico, sÃƒÂ³lo cambia el fondo de pantalla en alguna ocasiÃƒÂ³n. \nPuede resultar incÃƒÂ³modo para la vista la combinaciÃƒÂ³n de colores elegida, habrÃƒÂ­a ido mejor posiblemente unos colores mÃƒÂ¡s claros. \nPor lo que no podemos esperar gran cosa del sonido. La banda sonora se limita a tres temas que duran toda la partida. Son melodÃƒÂ­as tranquilas y agradables para el oÃƒÂ­do. Pero no pasarÃƒÂ¡ nada si quitamos el volumen. Los efectos los justos para cada acciÃƒÂ³n ejecutada. \n-Conclusiones: \nSudoku Master cumple como un tÃƒÂ­tulo de pasatiempos, cuenta con numerosos puzzles y da facilidades de control. PodrÃƒÂ­a haberse completado con otros juegos para que resultase mÃƒÂ¡s completo. Es un juego recomendable para los grandes aficcionados, pues podrÃƒÂ¡n jugar en cualquier momento y lugar con plena comodidad. \n-Lo mejor: \n- Puzzles seleccionados por los creadores del sudoku. \n- 400 Sudokus diferentes entre si. \n- Un modo contrareloj. \n- Tutoriales exhaustivos para novatos. \n-Lo peor: \n- Puede resultar incompleto. \n- Escasas opciones.\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:735391ccb115beb419525c663e9d9cbb1170af0e","amp;dn":"Sudoku+Master+%5BEsp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"735391ccb115beb419525c663e9d9cbb1170af0e","infoHashBuffer":{"type":"Buffer","data":[115,83,145,204,177,21,190,180,25,82,92,102,62,157,156,187,17,112,175,14]},"announce":[],"urlList":[]}}