{"title":"Home Alone 2(1992)DVDRip.AC3(ENG)-DROCK","uid":6393129,"size":731876427,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7471f068689a8ffe8443704c54d4fa1e40e0660e&amp;dn=Home+Alone+2%281992%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1305420150,"description":"John Hughes and Chris Columbus repeat their best-selling formula from the first Home Alone film with this sequel. Once again Kevin McCallister's (Macaulay Culkin) family leave him behind, only now he gets on a flight to New York instead of going with his family to Miami. Kevin manages to hail a cab and is delivered to the doorsteps of the Plaza Hotel, where, using his father's credit card, he rents out a suite and has the time of his life -- although a smarmy hotel clerk (Tim Curry) and bellboy (Rob Schneider) eye him with suspicion. But ingenious Kevin keeps them at bay, using the same tomfoolery he applied to his uncle in the first picture. He takes time out from his consumer debauch to chat with a friendly old toy-store magnate (Eddie Bracken) and pontificate to a homeless Pigeon Lady (Brenda Fricker) on the meaning of Christmas. But then he runs into his old enemies Harry (Joe Pesci) and Marv (Daniel Stern).When he finds out that they plan on robbing the old man's toy store on Christmas Eve, he mans the battle stations once again, complete with electric prods, flames of fire, and sundry blunt instruments. \n\nRipped with Handbrake.\n\nLength: 2 Hours\n\nFile Type: MP4","torrent":{"xt":"urn:btih:7471f068689a8ffe8443704c54d4fa1e40e0660e","amp;dn":"Home+Alone+2%281992%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7471f068689a8ffe8443704c54d4fa1e40e0660e","infoHashBuffer":{"type":"Buffer","data":[116,113,240,104,104,154,143,254,132,67,112,76,84,212,250,30,64,224,102,14]},"announce":[],"urlList":[]}}