{"title":"The Happening(2008)DVDRip.AC3(ENG)-DROCK","uid":6389386,"size":733415336,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76affc3a14638ab3027121c971f9d93934fde280&amp;dn=The+Happening%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1305304518,"description":"Lady in the Water director M. Night Shyamalan puts PG-13 suspense on pause to tell this grim apocalyptic tale about a family fleeing a natural disaster that poses a grave threat to the whole of humanity. Philadelphia high-school science teacher Elliot Moore (Mark Wahlberg) is discussing the disappearance of the bees with his students when the staff is summoned to the theater and briefed about a mysterious event that is currently unfolding in New York City. According to reports, citizens in the vicinity of Central Park have suddenly and inexplicably begun seizing up just before killing themselves by whatever means are at their disposal. As the phenomena begins to spread and talk of terrorism fills the airwaves, Elliot, his wife, Alma (Zooey Deschanel), their friend Julian (John Leguizamo), and his daughter, Jess (Ashlyn Sanchez), board a train bound for the presumed safety of the country. When the train screeches to a halt before arriving at its final destination, however, the frightened passengers are forced to fend for themselves as each consecutive news report paints an increasingly grim picture of the situation in more urbanized areas. Theories abound on what could be causing the unexplainable rash of suicides, but the only thing that everyone seems to agree on is that it's some kind of airborne contagion that is carried in the wind. It would appear that humankind's reign on planet Earth has come to an end, but perhaps if this small band of survivors can find a safe place to lie low until this all blows over, all hope for survival of the species might not be lost just yet. \n\nRipped with Handbrake.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:76affc3a14638ab3027121c971f9d93934fde280","amp;dn":"The+Happening%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76affc3a14638ab3027121c971f9d93934fde280","infoHashBuffer":{"type":"Buffer","data":[118,175,252,58,20,99,138,179,2,113,33,201,113,249,217,57,52,253,226,128]},"announce":[],"urlList":[]}}