{"title":"J-ski, Roddie Rod - I be on that","uid":5764061,"size":9255385,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:774284260a81c52563478fd930fe807b4c9a334f&amp;dn=J-ski%2C+Roddie+Rod+-+I+be+on+that&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"macongaganja","files":1,"time":1281819811,"description":"SEED PLEASE \nFOLLOW US ON TWITTER\nSEED SEED SEED \n\npeer\n    A peer is another computer on the internet that you connect to and transfer data. Generally a peer does not have the complete file, otherwise it would be called a seed. Some people also refer to peers as leeches, to distinguish them from those generous folks who have completed their download and continue to leave the client running and act as a seed.\n\nseed\n    A computer that has a complete copy of a certain torrent. Once your client finishes downloading, it will remain open until you click the Finish button (or otherwise close it.) This is known as being a seed or seeding. You can also start a BT client with a complete file, and once BT has checked the file it will connect and seed the file to others. Generally, it\\\\\\'s considered good manners to continue seeding a file after you have finished downloading, to help out others. Also, when a new torrent is posted to a tracker, someone must seed it in order for it to be available to others. Remember, the tracker doesn\\\\\\'t know anything of the actual contents of a file, so it\\\\\\'s important to follow through and seed a file if you upload the torrent to a tracker.\n\nreseed\n    When there are zero seeds for a given torrent (and not enough peers to have a distributed copy), then eventually all the peers will get stuck with an incomplete file, since no one in the swarm has the missing pieces. When this happens, someone with a complete file (a seed) must connect to the swarm so that those missing pieces can be transferred. This is called reseeding. Usually a request for a reseed comes with an implicit promise that the requester will leave his or her client open for some time period after finishing (to add longevity to the torrent) in return for the kind soul reseeding the file.","torrent":{"xt":"urn:btih:774284260a81c52563478fd930fe807b4c9a334f","amp;dn":"J-ski%2C+Roddie+Rod+-+I+be+on+that","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"774284260a81c52563478fd930fe807b4c9a334f","infoHashBuffer":{"type":"Buffer","data":[119,66,132,38,10,129,197,37,99,71,143,217,48,254,128,123,76,154,51,79]},"announce":[],"urlList":[]}}