{"title":"Democracy Now - 19 apr 2011","uid":6331000,"size":442387543,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:792226fc087609406bd14ff2f9a3e71056f5bbcb&amp;dn=Democracy+Now+-+19+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1303284422,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 19, 2011\n\n- E.U. Considers Sending Ground Troops into Libya\n- Tear Gas Grenades Thrown into Home of Bahraini Activist\n- Exposed: Link Between British Oil Firms and Invasion of Iraq\n- WikiLeaks: U.S. Tried to Stymie U.N. Probe of Israeli War Crimes in Gaza\n- Michigan City Takeover Plan Criticized as Attack on Democracy\n- U.S. Firms Shipped Millions of Jobs Overseas in 2000s\n- Income for Nation's Wealthy Soars as Tax Rate Falls\n- Ex-General Linked to Abu Ghraib Abuses Considers Senate Run\n- 21 Arrested at Interior Department Sit-In\n- Obama to Climate Activists: &quot;Push the Envelope&quot;\n- Obama Admin &amp; Power Companies Aim to Block Global Warming Lawsuit\n\n\nSpecial reports\n\n- Syria Lifts Emergency Law as Protesters Come Under Fire in Syrian City of Homs\n\nSyrian police reportedly opened fire and used tear gas today on thousands of anti-government protesters who occupied a key square in the Syrian city of Homs. More than 10,000 protesters gathered there Monday after funerals for an estimated 25 activists killed over the weekend. They demanded the immediate lifting of Syria's longstanding emergency laws, the release of political prisoners, and the immediate resignation of President Bashar al-Assad. Meanwhile, newly released diplomatic cables from the online whistleblower WikiLeaks show the United States has secretly financed Syrian opposition groups and activities since at least 2005. We speak with Bassam Haddad, director of the Middle East Studies Program at George Mason University.\n\n\n- Former Libyan Diplomat on His Defection and Call for Intensification of NATO Operations\n\nNATO intervention in Libya has been ongoing for four weeks, and the country appears locked in a military stalemate. We are joined by Ibrahim Dabbashi, the Libyan deputy ambassador to the United Nations who defected after Gaddafi's crackdown on pro-democracy protesters and now represents the Transitional National Council of Libya. &quot;[Gaddafi] is leaving,&quot; says Dabbashi, &quot;but how long he will stay in power, this is the question... If the operations of NATO intensify with the coming back of the U.S., I think it will take only some weeks. But if it continues at the same level as it is now, I think it will take some months.&quot;\n\n\n- Phyllis Bennis: U.K. Sends Troops into Libya as International Coalition Expands Mission to Include Regime Change\n\nAs NATO continues its campaign against Colonel Muammar Gaddafi's forces and to their attacks on Libyan civilians, Great Britain announced today it will send military officers to advise rebels fighters. &quot;This is exactly the kind of escalation that many of us warned against on the evening that the U.N. first passed its no-fly zone resolution,&quot; says Phyllis Bennis, fellow at the Institute for Policy Studies, who opposes U.N. intervention in Libya. &quot;What we're seeing is a clear commitment on the part of NATO and the U.S. for regime change-exactly what the U.N. resolution was not designed to do.&quot;\n\n\n- As Radiation Continues to Leak from Japan Nuke Plant, Owners of Vermont Yankee Plant Sue to Stay Open\n\nWorkers at the crippled Fukushima Daiichi nuclear power facility in Japan have started to pump radioactive water from a leaking reactor into a makeshift storage area-an effort they say is a crucial step toward easing the nuclear crisis. The Tokyo Electric Power Company says it will take six to nine months to achieve a &quot;cold shutdown.&quot; Meanwhile in the United States, the owners of the Vermont Yankee nuclear power plant have filed a federal lawsuit on Monday against a state law that gives the Vermont state legislature veto power over operation of the reactor when its current license expires next March. We speak with longtime nuclear expert Arnie Gundersen in Burlington, Vermont.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:792226fc087609406bd14ff2f9a3e71056f5bbcb","amp;dn":"Democracy+Now+-+19+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792226fc087609406bd14ff2f9a3e71056f5bbcb","infoHashBuffer":{"type":"Buffer","data":[121,34,38,252,8,118,9,64,107,209,79,242,249,163,231,16,86,245,187,203]},"announce":[],"urlList":[]}}