{"title":"Coast To Coast Am - 08-10-10 - Crop Circles &amp; Energy Points","uid":5758087,"size":55580167,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7ab981e3cd362c27f8942823d40b051685897448&amp;dn=Coast+To+Coast+Am+-+08-10-10+-+Crop+Circles+%26+Energy+Points&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1281634629,"description":"ate:\n 08-10-10\n \nHost:\n George Noory\n \nGuests:\n David Wilcock, Nick Pope \n \n\n\nIntuitive researcher, lecturer and filmmaker David Wilcock discussed his recent research on crop circles and energy vortexes. According to the work of Ivan Sanderson, there are 12 points (or 'Vile Vortices') around the Earth where ships and planes disappear, not just the Bermuda Triangle. Storms tend to begin in these areas, which also exhibit gravitational anomalies and magnetic fluctuations. These points, via particles and vibration, affect the geometric shape of the continents and the atmosphere, Wilcock detailed. \n\nThis past July he traveled to England to observe crop circles first hand, including one formation that was octahedral in shape. While agreeing that some circles are human-made, he noted that researchers have found the soil under crop circles to have drier, looser consistency than the soil near by. Crystals have also been found in the crop circle soil, which could only grow at temperature levels that would normally be much too hot for the plants to survive, he said. &quot;The reason why these crystals are forming and the soil gets so dry is that the technology that makes these circles involves drawing water up out of the ground,&quot; Wilcock suggested. \n\nHe connected the patterns of crop circles with the geometric processes of the Earth's vortexes. Further, some of the crop circles' symbolic messages have related to DNA change and soul evolution, as well as the downfall of the New World Order, he said. For more on Wilcock's work, check out hisvideo channel, which includes his lecture 2012 Event Horizon. \n\nWinston Churchill &amp; UFOs\nFirst hour guest, UFO expert Nick Pope reacted to the news that Winston Churchill covered up a UFO event because he feared mass panic in the UK. The incident, said to occur during WWII, was revealed as part of Britain's continuing release of formerly classified UFO files. However, Pope pointed out that this report was more of an allegation, and there was little documentation to back it up. For more, see Linda Moulton Howe's Earthfiles article. \n\n\nWebsite(s):\n-divinecosmos.com\n-nickpope.net\nBook(s):\n-The Reincarnation of Edgar Cayce\n-The Uninvited: An Expose of the Alien Abduction Phenomenon\n-Open Skies, Closed Minds","torrent":{"xt":"urn:btih:7ab981e3cd362c27f8942823d40b051685897448","amp;dn":"Coast+To+Coast+Am+-+08-10-10+-+Crop+Circles+%26+Energy+Points","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ab981e3cd362c27f8942823d40b051685897448","infoHashBuffer":{"type":"Buffer","data":[122,185,129,227,205,54,44,39,248,148,40,35,212,11,5,22,133,137,116,72]},"announce":[],"urlList":[]}}