{"title":"Coast To Coast Am - 08-22-10 - ET Contactees","uid":5785388,"size":56758482,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7bb32f94b28a2e9a5f113ab0bccc7de60e857b33&amp;dn=Coast+To+Coast+Am+-+08-22-10+-+ET+Contactees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1282595586,"description":"Date:\n\t\n\n08-22-10\n\nHost:\n\t\n\nGeorge Knapp\n\nGuests:\n\t\n\nFarah Yurdozu, David Huggins, Peter Robbins\n\nGeorge Knapp welcomed paranormal researcher Farah Yurdozu for a discussion on Turkish Ufology and contactee stories. David Huggins, who claims to have fathered many ET children, joined the conversation in the latter half of the show to share his remarkable story. Yurdozu observed that the Middle East is an area where the concept of non-human entities is &quot;considered something very normal and natural.&quot; She explained that this is due to the rich history of the region, which dates back to the dawn of mankind and includes many traditions of these types of beings. To that end, she said that, in contemporary times, the Turkish government, media, and military are &quot;extremely open&quot; about the UFO phenomenon to the point that she declared, &quot;we don't have a UFO related cover-up in Turkey.&quot;\n\nYurdozu pointed out a number of parallels between alien abduction accounts and tales of the jinn from her native country. &quot;Jinns like to play with human children,&quot; she recounted, noting that it is said that the jinn would abduct children from their bed at night, take them someplace else, and return them in the morning. &quot;As we know, in modern times, alien abduction starts when the person was a child,&quot; she observed. Additionally, Yurdozu said that tradition states that jinn had relationships with humans and created offspring. &quot;Still today, there are many Turkish men and women that claim that they have children from jinns,&quot; she revealed. Similar to American accounts of people who allege to have ET hybrid children, these Turkish stories include the detail that the human parent is not allowed to see their offspring.\n\nHuggins detailed his story of ET contact which, he claims, saw him father a plethora of hybrid entities. He said that his experiences began when he was eight years old and took on a sexual nature when he turned seventeen. From there, he had numerous, intimate encounters with a female being that he called 'Crescent.' Ultimately, the agenda behind these meetings was revealed when Crescent came to him and exclaimed that their baby was dying. A perplexed Huggins demanded to see the child and, after an emotional exchange with Crescent's handler, he was presented with the dying child. Upon touching the baby, a feeling of static electricity passed between the two and it began coming back to life. At that point, Huggins was taken to a place filled with these babies and was instructed to touch them all and save them. While he acknowledged that his story sounded unbelievable, Huggins mused that &quot;I don't believe it happened, I know it happened.&quot;\nThe 509th-UFO Connection\n\nDuring the first hour, investigator Peter Robbins talked about the connection linking Roswell, the Hill abduction case and the 'incident at Exeter.' He marveled that all of these events have one key component in common: the local presence of the 509th Bomber Division, America's first nuclear strike force. While it is well-known that the 509th was stationed in Roswell in 1947, Robbins revealed that when the division was shifted to Pease AFB in New Hampshire in 1958, anomalous events appear to have followed it to that state. To that end, he pointed to the Hill abduction case, which happened in 1961, as well as the infamous 1965 Incident at Exeter, both of which occurred in New Hampshire after the 509th had arrived. Robbins will be making a presentation on this research at the Exeter UFO Festival in Exeter, New Hampshire on September 4th.\nWebsite(s):\n# farahyurdozu.com\n# intermetu.com\nBook(s):\n# Love in an Alien Purgatory\n# Left at East Gate\n","torrent":{"xt":"urn:btih:7bb32f94b28a2e9a5f113ab0bccc7de60e857b33","amp;dn":"Coast+To+Coast+Am+-+08-22-10+-+ET+Contactees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bb32f94b28a2e9a5f113ab0bccc7de60e857b33","infoHashBuffer":{"type":"Buffer","data":[123,179,47,148,178,138,46,154,95,17,58,176,188,204,125,230,14,133,123,51]},"announce":[],"urlList":[]}}