{"title":"Democracy Now - 24 jun 2011","uid":6492401,"size":447154555,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7d8488e86016fd4c825aabae1c8f7f690dcb1c4b&amp;dn=Democracy+Now+-+24+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1308934728,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 24, 2011\n\n- Dozens Killed in Baghdad Bombings in the Worse Attack in Months\n- Obama Meets Soldiers, Touts Afghan War Plan\n- Mullen Acknowledges Doubts on Afghan Withdrawal\n- Pentagon: &quot;No Rush to Exits&quot; in Afghanistan\n- Clinton Acknowledges U.S. Talks With Taliban\n- Senate Proposal Would Mandate Military Detention for Terror Suspects\n- U.S. to Tap Strategic Oil Reserve\n- GOP Pulls Out of National Debt Talks\n- Relatives of Mexico Drug War Victims Demand Presidential Apology\n- U.S. Warns Peace Activists Not to Join Gaza Flotilla\n- Pulitzer-Winning Reporter Reveals Undocumented Status\n- Al Gore: Obama Has &quot;Failed&quot; To Tackle Global Warming\n- New Jersey Assembly Curbs Wages, Benefits of Public Workers\n- Thousands of Nurses Rally for Financial Tax on Wall Street\n- Mothers of Jailed Hikers to Resume Fast Ahead of Iran Trial\n\n\nSpecial reports\n\n- New ExposÃƒÂ© Reveals Nuclear Regulatory Commission Colluded With Industry to Weaken Safety Standards\n\nThree U.S. Senators have called for a Congressional probe on safety issues at the nation's aging nuclear plants following a pair of new exposÃƒÂ©s. In a special series called &quot;Aging Nukes,&quot; the Associated Press revealed that the U.S. Nuclear Regulatory Commission and the nuclear power industry have been working in tandem to weaken safety standards to keep aging reactors within the rules. Just last year, the NRC weakened the safety margin for acceptable radiation damage to reactor vessels. The AP report also revealed radioactive tritium has leaked from 48 of the 65 U.S. commercial nuclear power sites, often into groundwater from corroded, buried piping. Leaks from at least 37 of those facilities contained concentrations exceeding the federal drinking water standard - sometimes at hundreds of times the limit. We speak with AP investigative journalist Jeff Donn.\n\n\n- Haiti: Leaked Cables Expose U.S. Suppression of Min. Wage, Election Doubts and Elite's Private Army\n\nDrawing on almost 2,000 classified U.S. diplomatic cables on Haiti released by WikiLeaks, a partnership between The Nation magazine and the Haitian weekly, Haiti LibertÃƒÂ©, exposes new details on how Fruit of the Loom, Hanes and Levi's worked with the United States to block an increase in the minimum wage in the hemisphere's poorest nation; how business owners and members of the country's elite used Haiti's police force as their own private army after the 2004 U.S.-backed coup that ousted President Jean-Bertrand Aristide, and how the United States, the European Union and the United Nations supported Haiti's recent presidential and parliamentary elections, despite concerns over the exclusion of Haiti's largest opposition party - Lavalas - the party of Aristide. We speak with the reports' authors, longtime Haiti correspondent Dan Coughlin and HaÃƒÂ¯ti LibertÃƒÂ© editor, Kim Ives.\n\n\n- Leaked WikiLeaks Cable: 2005 Democracy Now! Report on Haiti Killings Irked U.S. Embassy\n\nDemocracy Now! is mentioned in a U.S. diplomatic cable released by WikiLeaks that cites our 2005 report on a deadly raid in the poor neighborhood of CitÃƒÂ© Soleil by United Nations forces. &quot;You accurately reported on what was going on and the embassy was alarmed by it,&quot; says our guest, longtime Haiti correspondent Dan Coughlin. &quot;What they were upset about is there wasn't PR push back on Democracy Now! by the U.N.&quot; Another cable shows U.S. Secretary of State Hillary Clinton called embassies around the world to tell them to &quot;get the narrative right&quot; with editors and fight negative portrayals of U.S. deployment in Haiti after the 2010 earthquake.\n\n\n- Feeding Resistance: Food Not Bombs Members Arrested in Orlando For Serving Meals Without a Permit\n\nThe City of Orlando - the home of Disney World in Florida - is being sued in court today over a city law that has effectively made it illegal for any group to feed more than 25 people at a time in downtown parks without a permit. It also limits groups to no more than two permits per park, per year. The group Food Not Bombs has refused to obey the new law-saying food is a right, not a privilege-and has continued to serve free meals to the poor and homeless. However, over the past month more than 20 members of the organization have been arrested. Keith McHenry, who helped found Food Not Bombs over 30 years ago, was arrested Wednesday and remains in jail. We speak with Benjamin Markeson, an activist involved with Food Not Bombs for several years who was arrested earlier this month; and the group's attorney, Shayan Elahi.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7d8488e86016fd4c825aabae1c8f7f690dcb1c4b","amp;dn":"Democracy+Now+-+24+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d8488e86016fd4c825aabae1c8f7f690dcb1c4b","infoHashBuffer":{"type":"Buffer","data":[125,132,136,232,96,22,253,76,130,90,171,174,28,143,127,105,13,203,28,75]},"announce":[],"urlList":[]}}