{"title":"Katy Perry - Teenage Dream (Xvid-2nafish)","uid":5810495,"size":81613866,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7dcc695a5ae1350a94ef8b2e5649db0ae6906ae7&amp;dn=Katy+Perry+-+Teenage+Dream+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283607072,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:54\n\n[Video]\nResolution : 1280x720\nCodec : XviD MPEG-4 codec\nFPS : 30.00\nBitRate : 2464 Kbps\nQuality Factor : 0.09 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Teenage Dream&quot; is a song by American recording artist Katy Perry. It is the second single from her second mainstream studio album of the same name. Perry and Bonnie McKee wrote many songs with a youthful theme in mind, but they were rejected by producers Benny Blanco and Dr. Luke. Blanco showed them The Teenagers's single &quot;Homecoming&quot;, and McKee imagined &quot;Teenage Dream&quot; as a throwback song to the euphoric feelings of being in love as a teenager. They met with Max Martin in Perry's hometown of Santa Barbara, California  and started writing the track, which Perry later described as a pure moment for her. After Perry recorded her vocals, McKee presented her idea and the chorus was rewritten. Perry also described the song as reminiscent of her youth while contemplating her future marriage to boyfriend Russell Brand.\n\n&quot;Teenage Dream&quot; is a midtempo pop song with a retro sound. Perry starts singing in a high voice and her vocals grow stronger as the song progresses. Lyrically it talks about being with a lover that makes one feel young again. Critics gave mixed reviews to &quot;Teenage Dream&quot;. While some reviewers praised it for its mature feel, others criticized it for not being as catchy as her previous singles. &quot;Teenage Dream&quot; has topped the charts in New Zealand and Ireland as well reaching the top-ten in Australia, Canada and the United States, and has charted in Belgium, Sweden and the Netherlands. A music video for the single, filmed in various locations of Santa Barbara, premiered on August 10, 2010. Perry performed the song at the 2010 Teen Choice Awards.\n\nThe music video for &quot;Teenage Dream&quot; was filmed in Santa Barbara in July 2010, and was directed by Yoann Lemoine. Perry planned the concept along with the songwriters during the sessions. Pictures from the shoot feature Perry kneeling in the sand looking at a man (played by Josh Kloss) wearing speedos, while others show her kissing the man in a hotel pool. She commented about the filming on her Twitter, saying, &quot;That's a wrap for Teenage Dream! So gorgeous [...] In my hometown. I got to cast all my friends in the new music vid for Teenage Dream = amazing insanity.&quot; Perry was interviewed online viawhere she talked about the music video. She said,\n\n    &quot;It is gonna be completely different from 'California Gurls.' With 'Teenage Dream' you'll see a very raw, almost vulnerable [side] ... I had to wear so many less layers of makeup. I had to make out with a boy which was very traumatizing, I was kind of mean to him. I would be the one to call cut because I was like, 'oh I cant [sic] do this!' I feel so horrible. But I know it's a job. [Russell and me] understand what our work is.&quot;\n\nA lyric video with pictures was uploaded to Perry'saccount on July 26, 2010. A 30-second snippet was released on August 5, 2010. The clip showed Perry in a montage through locations of Santa Barbara, including riding a late 1960s white BMW BMW New Class convertible, kissing her love interest and dancing on the beach with her friends. James Dinh of MTV said the teaser resonated with the song's feel-good melody. The video premiered on MTV on August 10, 2010 at 8:00pm ET. Its UK premiere was at 10:45pm on ITV2.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7dcc695a5ae1350a94ef8b2e5649db0ae6906ae7","amp;dn":"Katy+Perry+-+Teenage+Dream+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dcc695a5ae1350a94ef8b2e5649db0ae6906ae7","infoHashBuffer":{"type":"Buffer","data":[125,204,105,90,90,225,53,10,148,239,139,46,86,73,219,10,230,144,106,231]},"announce":[],"urlList":[]}}