{"title":"Have Large Files? Want 2 make them Smaller! SPLIT them! GSPLIT","uid":6314551,"size":1541744,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7ef04f1f7bb8e4bc5e577945e2f42d2c2970d0d9&amp;dn=Have+Large+Files%3F+Want+2+make+them+Smaller%21+SPLIT+them%21+GSPLIT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YouCanTrustMe","files":1,"time":1302656182,"description":"Gsplit *FILE SPLITTER * Great for splitting WPA wordlist dictionary files!\n\nThis program is awesome for splitting large text files! \n\nLike wordlist or dictionary files for cracking WiFi networks. \n\nI use aircrack, and large dictionary files can take days to get through. Splitting up the files to a smaller size is very practical. \n\nGsplit is fast. I split a 9.87GB wordlist up into 100 smaller files 102mb each, only took 7 mins. \n\n**   *   **   *   **   *   **   *   **   *   **   *   **   *   **   *   **   *   \n\nIntroducing GSplit\n\nWelcome to GSplit! This application is a free reliable file splitter that lets you split your large files (like Self-Extracting archives, Zip archives, disk images, multimedia, music, video, backup, image, archive, log, large text, document files...) into a set of smaller files called pieces.\n\nThese pieces are easier to:\n* Copy to any removable media disks. \n* Distribute over the Internet, networks. \n* Send by email (forget attached file size restrictions imposed by some ISP, pop3,   \n   SMTP and other e-mail servers). \n* Archive to CD, DVD, USB Flash drive and strick, Zip disk, and any other \n   storage device. \n* Upload to host accounts, file delivery services, online file hosting sites... that \n   have restrictions on file sizes. \n* Share with friends, colleagues or other users through networks and the Internet. \nexchange using Instant Messaging clients or Instant Messenger programs... \n\nWhy split files?\n* Send your files via email, instant messaging, and online hosting services \n   without size restriction. \n* Share files over the Internet easier and avoid large downloads which may \n   become truncated. \n* Transfer any file from a computer to another using any other removable storage \n   device. \n\nBackup large files on several CD, DVD or USB sticks.\n\nWhat can GSplit do?\n\nIn addition to the features of other standard file splitters, GSplit can:\n\n-Let you select from two basic file splitting options: disk spanned (split into a set of files varying in size auto-calculated by GSplit based on available free disk space and saved immediately to spannable removable disks) or blocked (split into a set of same sized split files). You may enter the size for each piece file, the number of pieces you want to obtain, or the number of lines/occurrences of pattern by piece. \n\u001f\n-Make pieces Self-Uniting: GSplit creates a small stand-alone executable file that will put all of the pieces back together. This executable provides your users with an intuitive Windows interface whose appearance can be customized according to your needs. Thus GSplit is not required in order to restore the split file. \n\n-Store file properties like file dates and attributes, and restore them contrary to batch files. \n\n-Perform fast checks (size, offset, CRC32) in order to detect file corruption and to give you the assurance that your files are successfully restored by your users. When a piece is corrupted, you are notified about it, so you just need to get a new copy of that piece, not the whole set. \n\n-Split very large files, bigger than 4 GB. \n\n-Customize piece files according to your needs (size, filenames, title, author...), leave additional space on disks, create pieces without tags or with custom headers (useful for text-based files like large server log or CSV files). \n\n-Support splitting multiple files back-to-back in one time. \n\n-Offer batch and command line options for automation or build environments. GSplit can work as a daemon. \n\n-Work in your own language: multilanguage support is available (English, French - \nFranÃƒÂ§ais, Italian, Chinese...) for GSplit, GUnite and Self-Uniting programs. See the translations currently available. \n\n-Split large text and similar files like large server logs and other CSV files by number of lines or occurrences of a specified pattern. Optionally insert headers into each piece file. \n\n-Show you elapsed and estimated times while splitting and uniting files. You can also pause/resume the splitting operation. \n\n-Keep settings into profiles and let you use these settings for different files, remember MRU files and folders, automatically try to find out the best splitting settings... \n\n-Integrate Windows Explorer to let you split your files directly from the context menu. \n\n-Work on all Windows versions, including Windows Vista. \n\n\nA portable edition of GSplit is also available with no required installation. Run the portable file splitter directly from any removable disk like a USB flash drive and thats all. Settings are also saved directly on the storage media, not on the computer.\nGSplit finally features an intuitive graphical user interface that makes operations easy and fast. It also provides you with a lot of customization optional options for pieces and Self-Uniting executable files... GSplit lets you split any file in a snap!\nGSplit is free!\n\nGSplit is a full freeware: the program has no advertisement, no restrictions, no nags. \nNo registration is required.\nYou can distribute, install and use it free of charge, even for commercial purposes.\n\n\nIF YOU ARE LOOKING FOR SOME WORDLIST TRY:\n\nCollection of Wordlist (Dictionaries) for cracking WiFi WPA/WPA2\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6283773/Collection_of_Wordlist_(Dictionaries)_for_cracking_WiFi_WPA_WPA2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6283773/Collection_of_Wordlist_(Dictionaries)_for_cracking_WiFi_WPA_WPA2&lt;/a&gt;\n\nCollection of Wordlist (Dictionaries) * V.2 NEW * for Cracking WPA\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6300469/Collection_of_Wordlist_(Dictionaries)___V.2_NEW____for_Cracking_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6300469/Collection_of_Wordlist_(Dictionaries)___V.2_NEW____for_Cracking_&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:7ef04f1f7bb8e4bc5e577945e2f42d2c2970d0d9","amp;dn":"Have+Large+Files%3F+Want+2+make+them+Smaller%21+SPLIT+them%21+GSPLIT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ef04f1f7bb8e4bc5e577945e2f42d2c2970d0d9","infoHashBuffer":{"type":"Buffer","data":[126,240,79,31,123,184,228,188,94,87,121,69,226,244,45,44,41,112,208,217]},"announce":[],"urlList":[]}}