{"title":"The Devil's Interval...Blood &amp; Honey(2006)[FLAC]","uid":6470496,"size":290398730,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f4dab9e2cc3d6a8f95daa2621b6a4ff45a07633&amp;dn=The+Devil%5C%27s+Interval...Blood+%26+Honey%282006%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"dickspic","files":18,"time":1308127262,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/dri300/i398/i39847p7g5n.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/dri300/i398/i39847p7g5n.jpg&lt;/a&gt;\n\n2006 CD Wild Goose 335 \n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n  1  Green Valley   \n  2  Silver Dagger   \n  3  Studying Economy   \n  4  The Leaves of Life   \n  5  The Well Below the Valley   \n  6  Two Crows   \n  7  The Bonfire Carol   \n  8  A May Carol   \n  9  Down Among the Dead Men   \n  10  The Cuckoo   \n  11  Long Lankin   \n  12  The Midsummer Carol   \n  13  Blow Me Jack \n\nFinally, after scouring the woodlands at night with a lantern, pacing my widower's walk with a high-powered looking glass and sending out an APB on the police shortwave band, the search is over. Hail the new a cappella folk harmony group, deftly dancing along in the tradition of the Copper Family, the Watersons, the Young Tradition and Swan Arcade. The Devil's Interval are two females and one male, so they're an inverted Young Tradition. There's a credit in the cd booklet: &quot;Special thanks to Doug Bailey for seeing our vision and agreeing to release it on his label&quot;. Well, if I was a record label impresario and these three stepped into my office and started warbling I would have gently shepherded them into the studio before they had finished the first verse of Silver Dagger. And I would have paid them in blueberry cheesecake and bound copies of the notebooks of Sabine Baring-Gould, because I know they like those things. \nAs well as singing in lush and lovely harmony (not everyone's cup of tea, I understand, but people who don't care for lush harmony are to be avoided) they get extra points for declining to raid the tempting warehouses of song belonging to Carthy, Collins and Bellamy, and instead excavating their own repertoire from less obvious sources (The Voice Of The People CD set on Topic is often mentioned in the booklet - well yes, it's not so awfully obscure, but fair play.) Some of the extra points deducted for choosing such a dodgy name. The Devil's Interval? Not so good. \nMuch as I enjoy this album, there is one thing nagging away: as one song succeeds another a certain sense of uniformity can begin to insinuate, so they must take a moment from their folkstering to consider the awful example of Steely Dan (not Steeleye Span). I realise that Steely Dan were not a folk group but they did do great harmony singing on their albums. Trouble was, it all sounded exactly and precisely the same, until however great it was it drove you completely mad. So Lauren, Emily and Jim may wish to study what the Young Tradition did on their last two albums - they threw in various solo pieces and duets, and in the long ballad Knight William on So Cheerfully Round they experimented by arranging each verse differently. \n\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/12/27/devils-interval/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/12/27/devils-interval/&lt;/a&gt;","torrent":{"xt":"urn:btih:7f4dab9e2cc3d6a8f95daa2621b6a4ff45a07633","amp;dn":"The+Devil%5C%27s+Interval...Blood+%26+Honey%282006%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f4dab9e2cc3d6a8f95daa2621b6a4ff45a07633","infoHashBuffer":{"type":"Buffer","data":[127,77,171,158,44,195,214,168,249,93,170,38,33,182,164,255,69,160,118,51]},"announce":[],"urlList":[]}}