{"title":"Maria Full of Grace (2004) NTSC DVD5 DD5.1 Multisubs --TBS","uid":6324967,"size":4581972922,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7f59e5fbdc0835a88f69a675f74944c917ce8112&amp;dn=Maria+Full+of+Grace+%282004%29+NTSC+DVD5+DD5.1+Multisubs+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1303077200,"description":"Maria Full of Grace (2004) NTSC DVD5 DD5.1 Multisubs\n\n\nNederlands:       \n\nVerenigde Staten\nDrama / Thriller\n101 minuten\n\ngeregisseerd door John Polson\nmet Sophie Traub, Jon Foster en Russell Crowe\n\nDrama over een energiek Colombiaans meisje dat als bolletjesslikker via de gevaarlijke wereld van de drugshandel aan haar tocht naar New York begint\n\nDe vrolijke, energieke 17-jarige Maria Alvarez woont met haar hele familie in een klein huisje op het platteland van Colombia. Ze werkt op een plantage waar ze de doornen van rozen moet verwijderen. Haar leven verandert drastisch wanneer ze een lucratief klusje als bolletjesslikker krijgt aangeboden: Maria moet in haar lichaam cocaÃƒÂ¯ne smokkelen naar Amerika. De opdracht is lang niet zo makkelijk als haar wordt voorgespiegeld en Maria komt terecht in de gevaarlijke en meedogenloze wereld van de drugshandel. Haar vastberadenheid en drang tot overleven zal haar moeten helpen naar een nieuw leven in New York.\n\nMet haar hoofdrol in het Amerikaans-Colombiaanse drama 'Maria Full of Grace' won Catalina Sandino Moreno op het Film Festival van Berlijn een zilveren beer. Ze werd gekozen uit meer dan 800 meisjes die voor de rol auditeerden. Daarnaast werd dit regiedebuut van Joshua Marston, die tevens het script schreef, op het Sundance Film Festival in 2004 bekroond met de publieksprijs. New Yorker Marshton raakte geÃƒÂ¯nspireerd door de levensverhalen van bevriende Colombianen, met name het verschil tussen het leven in hun thuisland en dat in een Amerikaanse metropool.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/22556&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/22556&lt;/a&gt;\n\nEnglish\nEnergetic drama about a Colombian girl as drug smugglers  through  the  dangerous world of drug trafficking to begin its journey to New York\n\nThe cheerful, energetic 17-year-old Maria Alvarez lives with her ??family in a small house in rural Colombia. She works on a plantation where they need to remove the thorns of roses. Her life changes dramatically when a lucrative job as drug smugglers offered: Mary in her body to smuggle cocaine to America. The task is not as easy as it is often misleading and Maria finds herself in the dangerous and ruthless world of drug trafficking. Her determination and drive to survive, must help her to a new life in New York.\n\nWith her ??starring role in the US-Colombian drama Maria Full of Grace Catalina Sandino Moreno won the Berlin Film Festival Silver Bear. She was chosen from more than 800 girls for the role were auditing. In addition, this directorial debut of Joshua Marston, who also wrote the script, at the Sundance Film Festival in 2004 won the audience award. New Yorker Marshton was inspired by the life stories of friendly Colombians, in particular the difference between living in their home country and that in an American metropolis. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0390221&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0390221&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nBeeldverhouding: 16:9\nFramerate      : 29,970 fps\nStandaard      : NTSC   \nAudio          : Spanish DD 5.1\nBron           : Retail\nOndertitels    : NL/English/French\nMenu           : Ja\nGenre          : Drama / Thriller\nCover          : Ja","torrent":{"xt":"urn:btih:7f59e5fbdc0835a88f69a675f74944c917ce8112","amp;dn":"Maria+Full+of+Grace+%282004%29+NTSC+DVD5+DD5.1+Multisubs+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f59e5fbdc0835a88f69a675f74944c917ce8112","infoHashBuffer":{"type":"Buffer","data":[127,89,229,251,220,8,53,168,143,105,166,117,247,73,68,201,23,206,129,18]},"announce":[],"urlList":[]}}