{"title":"Hot Tomorrows (Martin Brest, 1977)","uid":6327848,"size":1269436056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f6bebb9295ba41f354cbbfe9d61cb560a8100f0&amp;dn=Hot+Tomorrows+%28Martin+Brest%2C+1977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ingulphus","files":2,"time":1303175113,"description":"The story takes place in Los Angeles during a span of hours on Christmas Eve and Christmas morning.  Michael (Ken Lerner) and his childhood friend Louis (Ray Sharkey), who is visiting from the old neighborhood in the Bronx, are complete mooks; Michael is a budding writer in his early 20s with an obsession about age and dying (and Laurel &amp; Hardy), and Louis is somewhat of a clown, not too intelligent but full of beans.\n\nThey head out for a dismal night on the town and end up at the Paradise Ballroom, a faded, near-empty venue where the Mystic Knights of the Oingo Boingo are performing in tuxedos and deathly white makeup - Marie Elfman vamps the Marlene Dietrich song \\'Jonny\\' and Danny Elfman does a great version of \\'St. James Infirmary\\' a la Cab Calloway (see the Betty Boop cartoon \\'Snow White\\' to hear the original - it is DYNAMITE). Michael is entranced, Louis is restless and bored.\n\nAt the bar they run into likable expatriate Bronx-ite Tony (Victor Argo) and his best friend, a viciously drunk \\'little person\\' named Alberict (Herve Villechaise) who is a complaisant husband considerately staying out (and getting drunk) while his wife entertains her lover at home.  After hanging out with them, and after Louis is unsuccessful in picking up a shy young woman, they head out for some food but get sidetracked by the mortuary ad Michael hears on the radio and pay a visit to it for coffee (and a chance for Michael to further explore his curiosity about death).\n\nThey return to the Paradise just before it closes; Tony and a passed-out Alberict are still there.  Louis finally confronts Michael about his obsession, they have an argument, and Louis decides to leave on his own, offering to drop the sleeping Alberict home on his way.  I can't speak to what then ensues without spoiling it, but the ending is bizarre, touching and audacious (especially given the production budget).\n\nNot much of a plot, but it allows for a multitude of great moments and great performances, some stunning visuals and an oddly satisfying experience that has remained a pleasure throughout repeated viewings.\n\nThe beautiful black and white photography was by Jacques Haitkin (\\'A Nightmare on Elm Street\\'); the quality shifts from a subtle grain to an out-and-out old home movie quality when the images represent Michael\\'s memories, and the exposures are \\'hot\\' - bright lights tend to glow with a glorious aura, lending an other-world quality to the images, especially the musical numbers with Oingo Boingo.\n\nJazzy organ solos by Fats Waller are used throughout the soundtrack (they were also used by David Lynch in \\'Eraserhead\\' the following year) and add the right quirky touch, and the musical performances by Danny and Marie Elfman and Oingo Boingo are terrific.\n\nAside from dour Ken Lerner (brother of Michael) and bouncy Ray Sharkey, there are no well-known names (although Orson Welles does a wonderfully creepy/funny voice-over for a radio ad for a local mortuary), but the amateurs playing small roles are mesmerizing, with beautiful idiosyncrasies and manners - you KNOW these women in the few minutes they are on the screen, and Rose Marshall (Tante Ethel), who has no dialog, is especially believable and touching, as is the lady with the postcard.\n\nThis is from a DVD of unknown providence;  the video quality is about a 6 (out of 10), but it\\'s about the only way to see the film.","torrent":{"xt":"urn:btih:7f6bebb9295ba41f354cbbfe9d61cb560a8100f0","amp;dn":"Hot+Tomorrows+%28Martin+Brest%2C+1977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f6bebb9295ba41f354cbbfe9d61cb560a8100f0","infoHashBuffer":{"type":"Buffer","data":[127,107,235,185,41,91,164,31,53,76,187,254,157,97,203,86,10,129,0,240]},"announce":[],"urlList":[]}}