{"title":"Dave Brock (of Hawkwind) - Collection of Solo Projects (mp3)","uid":5796974,"size":737336590,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fd0e6debd4d4e0cf92195d111a0212ef70a98f6&amp;dn=Dave+Brock+%28of+Hawkwind%29+-+Collection+of+Solo+Projects+%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sh451","files":-1,"time":1283094288,"description":"Dave Brock (of Hawkwind) - Collection of Solo Projects (mp3)\n\nGathered, converted, tagged and uploaded by sparhawk451.\n\n\nThis is a very large (although, I'm sure, not entierly complete) discography of Dave Brock's solo career.\n\nThe man is the founding member as well as the main continuously creative and contributing member of Hawkwind.\n\nHawkwind should need no introduction. They have been playing their very own brand of european underground psychedelia since 1969, they are the progressive rock'n'roll band that defined SPACE ROCK, and they are still going.\n\n\nI've had to search the strangest places quite thoroughly to get ahold of these songs.\nThey're obviously not sold in record stores, or even commonly available for digital download or imports. They are not to be found on Spotify Premium, neither with Nokia:s &quot;Comes With Music&quot;. When I did find them, the song titles were not spelled right, and, imagine - the music had been mistaken by someone as &quot;general mainstream rock&quot;!\n\nKnow that mp3 downloading is NOT endorsed by Hawkwind for obvious reasons (they are not the millionaries that they fully deserve to be at this point). So if you enjoy this music, you should show them some respect by buying an album, going to a show or festival, or otherwise reward them for their hard work.\n","torrent":{"xt":"urn:btih:7fd0e6debd4d4e0cf92195d111a0212ef70a98f6","amp;dn":"Dave+Brock+%28of+Hawkwind%29+-+Collection+of+Solo+Projects+%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd0e6debd4d4e0cf92195d111a0212ef70a98f6","infoHashBuffer":{"type":"Buffer","data":[127,208,230,222,189,77,78,12,249,33,149,209,17,160,33,46,247,10,152,246]},"announce":[],"urlList":[]}}