{"title":"Night Court Season 1 - DVD Rips English Subtitles","uid":5776850,"size":2960189850,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8106790431e86888cad20ed7b3ab35fb4914110a&amp;dn=Night+Court+Season+1+-+DVD+Rips+English+Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1282294438,"description":"Night Court Typical Show Notes \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 958kbps \nDuration.............: 24:08.228\nResolution...........: 600*458 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 1 \n\n &lt;a href=&quot;\nhttp://bayimg.com/HaomdAAch&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HaomdAAch&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0086770/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0086770/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Night_Court&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Night_Court&lt;/a&gt;\n\nNight Court is an American television situation comedy that aired on NBC  from January 1984 until May 1992. The setting was the night shift of a Manhattan  court, presided over by the young, unorthodox Judge Harold T. &quot;Harry&quot; Stone (played by Harry Anderson). It was created by comedy writer Reinhold Weege, who had previously worked on Barney Miller in the 1970s and early 1980s.\n\n\nSeason 1 (1984)\nEp. \tNo. \tTitle \tDirector \tWriter(s) \tAirdate\n1 \t1 \t&quot;All You Need is Love&quot; \tJames Burrows \tReinhold Weege \tJanuary 4, 1984\nHarold T. Stone becomes a night court judge and settles a dispute involving a woman threatening her husband with gunfire. \n\n2 \t2 \t&quot;Santa Goes Downtown&quot; \tAsaad Kelada \tReinhold Weege \tJanuary 11, 1984\nThe season is merry as Harry deals with a man in a red suit charged with trespassing and tries to restore the faith of a pair of cynical teenage runaways. Michael J. Fox appears in this episode. \n\n3 \t3 \t&quot;The Former Harry Stone&quot; \tJay Sandrich \tTom Reeder \tJanuary 18, 1984\nLana learns that Harry has a criminal record when she tries to find out his age to settle a bet. \n\n4 \t4 \t&quot;Welcome Back, Momma&quot; \tJeff Melman \tReinhold Weege \tFebruary 1, 1984\nA woman who claims to be Harry's long lost mother and a beauty pageant operator appear before the court. \n\n5 \t5 \t&quot;The Eye of the Beholder&quot; \tJeff Melman \tLarry Balmagia \tFebruary 8, 1984\nThe others try to pull Bull out of the dumps when he's turned down by a charitable organization because his size and appearance are intimidating to others. \n\n6 \t6 \t&quot;Death Threat&quot; \tJay Sandrich \tBob Stevens \tFebruary 15, 1984\nThings are thrown into an uproar when Harry receives a threat via a rock thrown through the window and a bomb is discovered in the courtroom. \n\n7 \t7 \t&quot;Once in Love With Harry&quot; \tJay Sandrich \tReinhold Weege \tFebruary 22, 1984\nA hooker develops a crush on Harry and Dan loses a city council position to a dead man. \n\n8 \t8 \t&quot;Quadrangle of Love&quot; \tJeff Melman \tR.J. Colleary, February 29, 1984\nDan, Harry, and Bull all compete for the same pretty attorney. \n\n9 \t9 \t&quot;Wonder Drugs&quot; \tAsaad Kelada \tHoward Ostroff \tMarch 7, 1984\nLana disrupts the proceedings after taking a powerful cold medicine. \n\n10 \t10 \t&quot;Some Like It Hot&quot; \tJay Sandrich \tStu Kreisman, March 14, 1984\nA Russian (Yakov Smirnoff) that is charged with selling stolen property would rather burn down the courtroom and everyone in it than go to jail. \n\n11 \t11 \t&quot;Harry and the Rock Star&quot; \tJay Sandrich \tReinhold Weege \tMarch 21, 1984\nFans and reporters disrupt court proceedings when Harry dates a rock star, and tries to cope with a new court clerk. \n\n12 \t12 \t&quot;Bull's Baby&quot; \tJeff Melman \tBob Stevens \tMarch 28, 1984\nThe courtroom crew try to help Bull when a neighbor leaves her baby with him. \n\n13 \t13 \t&quot;Hi Honey, I'm Home&quot; \tGary Shimokawa \tTom Reeder \tMarch 31, 1984\nHarry has to settle the legal status of a woman who remarried after her first husband was mistakenly declared dead, and who wants her back. \n","torrent":{"xt":"urn:btih:8106790431e86888cad20ed7b3ab35fb4914110a","amp;dn":"Night+Court+Season+1+-+DVD+Rips+English+Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8106790431e86888cad20ed7b3ab35fb4914110a","infoHashBuffer":{"type":"Buffer","data":[129,6,121,4,49,232,104,136,202,210,14,215,179,171,53,251,73,20,17,10]},"announce":[],"urlList":[]}}