{"title":"George Thorogood - Who Do You Love? (2nafish)","uid":5794810,"size":135409668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:822c3b8113ba779a58fc1f2f27ca3eb4cd80aaed&amp;dn=George+Thorogood+-+Who+Do+You+Love%3F+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282956115,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Who Do You Love?&quot; is a song written and recorded in 1956 by Bo Diddley (real name Ellas McDaniel/Ellas Bates). The record features session player Jody Williams on lead guitar.\n\nThe title of the song, in which Bo Diddley speaks of wearing a cobra for a necktie and having a house built of rattlesnake hides with a chimney made of a human skull, is a punning reference to the African-American tradition of hoodoo folk magic. It was ranked #132 on Rolling Stone's list of The 500 Greatest Songs of All Time.\n\nGeorge Thorogood (born February 24, 1950) is a blues rock performer from Wilmington, Delaware, known for his hit song &quot;Bad to the Bone&quot; as well as for covers of blues standards such as Hank Williams' &quot;Move It On Over&quot; and John Lee Hooker's &quot;House Rent Boogie/One Bourbon, One Scotch, One Beer&quot;. Another favorite is a cover of Bo Diddley's &quot;Who Do You Love?&quot; George Thorogood and the Delaware Destroyers have released 16 studio albums, including five that have been certified Gold. The band is credited with the early success of Rounder Records.\n\nThorogood's demo, Better Than the Rest, was recorded in 1974 and released in 1979. In 1976 he recorded his debut album: George Thorogood &amp; The Destroyers with his band, The Destroyers (sometimes known as The Delaware Destroyers or simply GT and D) and issued the album in 1977. Thorogood released his next album titled Move It On Over in 1978 with The Destroyers, which included the Hank Williams remake &quot;Move It On Over&quot;. &quot;Please Set a Date&quot; and their remake of the Bo Diddley song &quot;Who Do You Love?&quot; both followed in 1979. In the late 1970s, Thorogood played on a team in Delaware in the Roberto Clemente League which was created in 1976. He was the second baseman and was chosen rookie of the year in the league. Soon after this achievement, The Destroyers forced him to quit playing the sport. In the 1970s, he and his band were based in Boston.\n\nGeorge and the Delaware Destroyers were friends with Jimmy Thackery and the Nighthawks. While touring in the 1970s, the Destroyers and the Nighthawks happened to be playing shows in Georgetown (DC) at venues across the street from each other. The Destroyers were engaged at The Cellar Door and the Nighthawks at Desperados. At midnight, by prior arrangement, while both bands played Elmore James' &quot;Madison Blues&quot; in the key of E, Thorogood and Thackery left their clubs, met in the middle of M Street, exchanged guitar cables and went on to play with the opposite band.\n\nMove It on Over is the second album by George Thorogood &amp; The Destroyers  released by Rounder Records in 1978. The album contains no original material. Its title track received major FM radio airplay when released, as did the Bo Diddley cover, &quot;Who Do You Love?&quot; Both can still be heard on the radio today.\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:822c3b8113ba779a58fc1f2f27ca3eb4cd80aaed","amp;dn":"George+Thorogood+-+Who+Do+You+Love%3F+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"822c3b8113ba779a58fc1f2f27ca3eb4cd80aaed","infoHashBuffer":{"type":"Buffer","data":[130,44,59,129,19,186,119,154,88,252,31,47,39,202,62,180,205,128,170,237]},"announce":[],"urlList":[]}}