{"title":"The Eagle [2011]RTB.NLSub.CBCS.SH@R","uid":6474163,"size":4660399896,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8456cc071de9f1d22b565da53f1f1d54cf3b8daf&amp;dn=The+Eagle+%5B2011%5DRTB.NLSub.CBCS.SH%40R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CBCS","files":-1,"time":1308256248,"description":"THIS IS A TEST&gt;THIS IS A TEST\n\nThe Eagle [2011]RTB.NLSub.CBCS.SH@R\n\nDit is een test.\t\n==================\n\nWij hebben deze film in DVD bestand omgezet.\n\nWij noemen dat een &quot;RTB&quot; film\n\nDeze Torrent-naam heeft de navolgende betekenis:\n\nThe Eagle  is de naam van de film\n\n[2011] is het jaar dat de film werd uitgebracht\n\nRTB staat voor 'Ready To Burn' \n\n1080p staat voor resolutie van de film\n\nBluRay staat voor BluRay\n\nNL.Sub staat voor Nederlandse ondertiteling\n\nCBCS.SH@R staat voor uploader\n\nDe bedoeling is dat, nadat je deze film hebt gedownload, het complete bestand kan 'slepen' naar je brandprogramma (bijvoorbeeld 'Nero'), waarna je de film op je eigen televisie kan zien met behulp van je DVD speler.\n\nWij willen graag weten wat jullie ervaring is bij het downloaden, het branden van de film en het zien van de film op jullie televisie (of computer) en of wij hier mee door moeten gaan.\n\nWe zitten wel in een testfase en daarom is je mening (liefst in het Nederlands) voor ons erg belangrijk.\n\nDus na het downloaden NIET afhaken maar zoveel mogelijk blijven 'seeden' zodat anderen dezelfde film sneller kunnen binnenhalen en hun commentaar kunnen geven.\nNa ongeveer 50 reacties (of 30 dagen na de upload) zullen wij bekijken of het zinvol is om hiermee door te gaan.\n\nOp dit moment is het (nog) niet mogelijk de film als zodanig nog beter te krijgen dan wat wij al hebben geupload als MP4 of AVI.\n\nIndien er al positieve reacties binnenkomen, zullen wij nog 3 films (Nederlands ondertiteld) op deze manier presenteren.\n\n\n\n\n\nThe Eagle (2011)\n\n114 min  -  Adventure | Drama   -  3 March 2011 (Netherlands)\n\nIn Roman-ruled Britain, a young Roman soldier endeavors to honor his father's memory by finding his lost legion's golden emblem.\n\nDirector: \nKevin Macdonald\n\n Writers: \nJeremy Brock (screenplay), Rosemary Sutcliff (novel)\n \nStars:\nChanning Tatum, Jamie Bell and Donald Sutherland\n\nStoryline\n\nIn 140 AD, twenty years after the unexplained disappearance of the entire Ninth Legion in the mountains of Scotland, young centurion Marcus Aquila (Tatum) arrives from Rome to solve the mystery and restore the reputation of his father, the commander of the Ninth. Accompanied only by his British slave Esca (Bell), Marcus sets out across Hadrian's Wall into the uncharted highlands of Caledonia - to confront its savage tribes, make peace with his father's memory, and retrieve the lost legion's golden emblem, the Eagle of the Ninth.\n\n","torrent":{"xt":"urn:btih:8456cc071de9f1d22b565da53f1f1d54cf3b8daf","amp;dn":"The+Eagle+%5B2011%5DRTB.NLSub.CBCS.SH%40R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8456cc071de9f1d22b565da53f1f1d54cf3b8daf","infoHashBuffer":{"type":"Buffer","data":[132,86,204,7,29,233,241,210,43,86,93,165,63,31,29,84,207,59,141,175]},"announce":[],"urlList":[]}}