{"title":"Our Man in Havana","uid":5768574,"size":1365085718,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:850042e41898feaf568904a90943fed6f0609e61&amp;dn=Our+Man+in+Havana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubusdemonoid","files":-1,"time":1282019162,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 60 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can\\'t continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nGraham Greene wrote this witty comedy inspired by Cold War paranoia. Jim Wormald (Alec Guiness) is an Englishman selling vacuum cleaners in Cuba on the cusp of the revolution. Hawthorne (Noel Coward), a British intelligence agent, is looking for information on Cuban affairs and recruits Jim to act as a spy. Jim has no experience in espionage and no useful knowledge to pass along, but Hawthorne is willing to pay for his services, and since Jim's daughter Milly (Jo Morrow) has expensive tastes, he can use the money. To keep Hawthorne happy (and his paychecks coming in), he turns in reports on the Cuban revolution that are copied from public documents, &quot;hires&quot; additional agents who don't exist, and presents blueprints of secret weapons that are actually schematics of his carpet sweepers. However, Hawthorne and associate &quot;C&quot; (Ralph Richardson) think that Jim is doing splendid work and encourage him to continue; meanwhile, Capt. Segura (Ernie Kovacs), the elegantly corrupt chief of police, has been fooled by Jim's charade into believing he's a real spy -- and has also become attracted to Milly. Our Man in Havana also features Burl Ives and Maureen O'Hara in supporting roles.\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;","torrent":{"xt":"urn:btih:850042e41898feaf568904a90943fed6f0609e61","amp;dn":"Our+Man+in+Havana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"850042e41898feaf568904a90943fed6f0609e61","infoHashBuffer":{"type":"Buffer","data":[133,0,66,228,24,152,254,175,86,137,4,169,9,67,254,214,240,96,158,97]},"announce":[],"urlList":[]}}