{"title":"A Century of War 6 of 6 Cold War (Reload)","uid":6471229,"size":4077644637,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85803cf08c278e6c8faaca29c22bc9f1c9c45489&amp;dn=A+Century+of+War+6+of+6+Cold+War+%28Reload%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rambam1776","files":-1,"time":1308147902,"description":"A Century of War DVD 6 The Cold War\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1840kbps \nDuration.............: 1:19:21\nResolution...........: 600*452 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,235,656,958 \n\n\n***Uploaders Note*** - This remarkable boxed set of over 85 films was released in 2009 by the United States National Archives. It consists of wartime footage, movie newsreels, and propaganda films made from World War I through the Vietnam Conflict. No subtitles are available. Furthermore, the majority of the DVDs were produced so that it was not possible to fully separate the films with normal ripping software. Therefore, many of the disks had to be ripped as one long AVI file; some containing multiple films. I have ripped every disk to the highest resolution possible, with an average bit pixel ratio of 1.50. I would have liked to have released it all as one huge torrent (I still might if the demand is high enough), but after all this work, I really do not want this to die an unseeded death, so I have decided to release it in 6 batches to keep the size down. The DVDs contained no special features of any kind. Several of these films were either nominated or even won Academy Awards back in the day, and are not commercially available in any other venue I am aware of. For each torrent, I will include the screenshots and technical stats for one representative film. SECOND ATTEMPT, FIRST torrent flawed due to TPB being down.\n\n\nRambam 1776\n\n  &lt;a href=&quot;\nhttp://www.amazon.com/National-Archives-Century-War-None/dp/B002MD3UL4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/National-Archives-Century-War-None/dp/B002MD3UL4&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://bayimg.com/LaImEaaDJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LaImEaaDJ&lt;/a&gt;\n\n\nDVD 21\n\nCommunist Blueprint for Conquest (1956) The methods and techniques used by the communists to seize power in a country.\nThe Berlin Wall (1962) The history of the Berlin wall, why it was built, and how it affects Berliners.\nA Day Called X (1957) An entire city evacuates in anticipation of the nuclear air raid. Narrated by Glenn Ford.\n\nDVD 22\n\nThe Red Nightmare (1962) A propaganda film about a small-town American who takes his civil liberties for granted.\nThe Road to the Wall (1962) An Oscar-nominated film on the rise of communism. Narrated by James Cagney.\nDuck and cover (1957) Bert the Turtle tells children to duck and cover in the case of an atomic attack.\nOur Cities Must Fight (1951) An attempt to convince Americans to stay home and fight in the event of nuclear war.\n\nDVD 23\n\nThe Communist Weapon of Allure (1956) A film on the methods used by the Communists to indoctrinate and gain converts.\nOperation Abolition (1960) The government seeks to stamp out Communist conspiracy in this 1960 courtroom battle.\nOne Week in October (1964) The 1962 Cuban missile crisis featuring actual American aircraft reconnaissance footage.\n\nDVD 24\n\nCheckpoint Charlie - U.S. Army in Berlin (1961) The Big Picture television series presents a report on Berlin in the critical summer of 1961.\nAtomic Attack (1950) A dramatization of the nuclear bomb dropped in New York City featuring Walter Matthau.","torrent":{"xt":"urn:btih:85803cf08c278e6c8faaca29c22bc9f1c9c45489","amp;dn":"A+Century+of+War+6+of+6+Cold+War+%28Reload%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85803cf08c278e6c8faaca29c22bc9f1c9c45489","infoHashBuffer":{"type":"Buffer","data":[133,128,60,240,140,39,142,108,143,170,202,41,194,43,201,241,201,196,84,137]},"announce":[],"urlList":[]}}