{"title":"High Fidelity (2000) DVDRip","uid":6334458,"size":555162710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:86d542d3eefbe8e3a62e3497f54a03ffd3b69222&amp;dn=High+Fidelity+%282000%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PokeYoke","files":-1,"time":1303412551,"description":"The film centers on Rob Gordon (John Cusack), a self-confessed audiophile whose flair for understanding women is less than par for the course. After getting dumped by his current girlfriend, Laura (Iben Hjejle), he decides to look up some of his old flames in an attempt to figure out what he keeps doing wrong in his relationships.\n\nHe spends his days at his record store, Championship Vinyl, where he holds court over the customers that drift through. Helping Rob in his task of musical elitism are Dick (Todd Louiso) and Barry (Jack Black), the &quot;musical moron twins,&quot; as he refers to them. Armed with an encyclopedic knowledge of all things musical, they compile &quot;top five&quot; lists for every conceivable occasion, openly mock the ignorance of their customers, and, every so often, actually sell a few records.\n\nRob and the staff have a strong dislike for two shoplifting skateboarder teenagers, Vince (Chris Rehmann) and Justin (Ben Carr). One day, he listens to a recording that they did and offers them a record deal, starting his own label called &quot;Top 5 Records&quot;. During his off hours, he pines for his lost girlfriend Laura and does his best to win her back.\n\nRob soon hears that Laura's father, who liked Rob, has passed away, and attends his funeral with Laura. Shortly after the reception, Rob realizes he never committed to Laura and always had one foot out the door. This made him realize he neglected his own future in the process. Afterwards, he and Laura move back in together again, and she organizes a celebration of the recently released single by the two delinquents, where Barry's band plays &quot;Let's Get It On&quot; and is delightful (to everyone's surprise). In the final scene, Rob finishes his advice about making the perfect mix tape, and says that he is now making one for Laura.\n\n","torrent":{"xt":"urn:btih:86d542d3eefbe8e3a62e3497f54a03ffd3b69222","amp;dn":"High+Fidelity+%282000%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d542d3eefbe8e3a62e3497f54a03ffd3b69222","infoHashBuffer":{"type":"Buffer","data":[134,213,66,211,238,251,232,227,166,46,52,151,245,74,3,255,211,182,146,34]},"announce":[],"urlList":[]}}