{"title":"Butterflies on the Scaffold (Mariposas en el Andamio)","uid":5768545,"size":577237613,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:88866b0261d5cc7f51c68b5757556503acee4866&amp;dn=Butterflies+on+the+Scaffold+%28Mariposas+en+el+Andamio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubusdemonoid","files":-1,"time":1282017729,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 60 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can\\'t continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nIf you are NOT interested in LGBT topics like this film portrays, then just do NOT download it or waste anyone's time by making stupid comments - just move on to another torrent. Personally, I'm not interested in drag, but I AM interested in the cultural significance of this film. If you have an open and intellectually curious mind, then download this and enjoy. Also, this DVD was obviously made from a VHS recording, so please do NOT expect DVD quality in sound or video.\n\nLife in Cuba is reputably stifling for everyday citizens. When a hidden culture attempts to surface, this Communist country reveals a surprisingly tolerant nature. Butterflies on the Scaffold  documents the real-life creation of a drag nightclub. Staffed by transvestite singers and dancers, the cafÃƒÂ© has become a bastion of social acceptance within a macho realm. La Guinera in Havana plays host to the determined performers who prove a little courage can go a long way. Backstage glimpses are interspersed with interviews of the working-class players. Butterflies on the Scaffold teaches that people everywhere share a common need for acceptance.\n\n[i]From IMDB[/i]:\nAfter the Revolution, gays were not respected in Cuba, but in the small Havana neighborhood of La GÃƒÂ¼inera, a few courageous women came to power and encouraged the gay community. Glamorous gowns fashioned from grain sacks and eyelashes made out of carbon paper are the reality of drag in Cuba. In La GÃƒÂ¼inera, gay transvestite performers have earned respect and status through creative work for the neighborhood. On stage action and backstage preparation opens out into insightful interviews with community leaders, families, and the performers themselves. the question; can you be gay and accepted in Cuba?\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\t\t","torrent":{"xt":"urn:btih:88866b0261d5cc7f51c68b5757556503acee4866","amp;dn":"Butterflies+on+the+Scaffold+%28Mariposas+en+el+Andamio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88866b0261d5cc7f51c68b5757556503acee4866","infoHashBuffer":{"type":"Buffer","data":[136,134,107,2,97,213,204,127,81,198,139,87,87,85,101,3,172,238,72,102]},"announce":[],"urlList":[]}}