{"title":"Democracy Now - 18 apr 2011","uid":6326958,"size":445983680,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:88c7e0798f34f1c29e3fdec447638beaf9d5aa4a&amp;dn=Democracy+Now+-+18+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1303144836,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 18, 2011\n\n- Gaddafi Forces Accused of Firing Cluster Bombs\n- 17 Reportedly Killed in Attack on Misrata\n- TEPCO Seeks 9 Months to Repair Plant; Clinton Visits Japan\n- House Approves GOP Spending Bill\n- Report: Walker to Propose Emergency Management Bill\n- Michigan Emergency Managers Target Elected Officials, Teachers\n- Bid to Repeal Ohio Anti-Worker Law Approved\n- Study: Dangerous Chemicals Used In Natural Gas Fracking\n- Georgia Approves Anti-Immigrant Law\n- 13 Killed in Syria Crackdown on Protests\n- Cables: U.S. Funded Syrian Opposition\n- Yemeni Forces Fire on Demonstrators\n- Study: U.S. Drone Strikes in Pakistan Killed 957 in 2010\n- Slain Italian Peace Activist Honored in Occupied Territories\n- Cuba Marks 50th Anniversary of Bay of Pigs; Castro Backs Term Limits\n- Texas Psychologist Barred From Death Row Evaluations\n- OECD: U.S. Has Highest Incarceration Rate, 9th Worst on Social Spending\n- 43 Killed in Hundreds of U.S. Tornadoes\n\n\nSpecial reports\n\n- On 8th Day of Hunger Strike, Bahraini Activist Zainab Alkhawaja Urges U.S. to Press for Family's Release\n\nAs the brutal crackdown on pro-democracy protesters continues in the Gulf state of Bahrain we speak with Zainab Alkhawaja, whose father, husband and brother-in-law were detained last Saturday following a late night raid at their home. Zainab is on the eighth day of a hunger strike that she vows to continue until her family members are released. We also speak with Human Rights Watch researcher, Faraz Sanei, who just spent six weeks in Bahrian. &quot;We are seeing a full-scale crackdown on any sort of dissent in the country,&quot; Sanei says. &quot;We are seeing a slide into a police state and dictatorship in Bahrain.&quot;\n\n\n- &quot;5 Million Barrels of Oil Does Not Disappear&quot;: Author, Activist Antonia Juhasz on the BP Spill, One Year Later\n\nThis week marks the one-year anniversary of the worst maritime oil spill in history. Last year on April 20, an oil rig leased by oil giant BP exploded in the Gulf of Mexico, killing 11 workers and releasing nearly 200 million gallons of oil, tens of millions of gallons of natural gas and 1.8 million gallons of chemicals. We speak to Antonia Juhasz, author of the new book, &quot;Black Tide: the Devastating Impact of the Gulf Oil Spill.&quot; Juhasz attended the BP shareholders meeting in London last week and spoke on behalf of Gulf Coast residents denied entry.\n\n\n- Georgia Set to Enact First Arizona Copycat Anti-Immigrant Bill\n\nGeorgia is set to become first state since Arizona to empower local and state police to demand documentation of residency and to detain people they suspect are in the country without permission. Last Thursday, Georgia lawmakers passed a bill modeled on Arizona's controversial SB 1070, known by critics as the &quot;show me your papers&quot; law. Georgia's first-term Republican Governor, Nathan Deal, campaigned on passing the bill, and says he will soon sign it into law. We speak to Azadeh Shahshahani, director of the National Security and Immigrants' Rights Project at the ACLU of Georgia; and Seth Freed Wessler, a senior research associate at the Applied Research Center and an investigative reporter for Colorlines.com.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:88c7e0798f34f1c29e3fdec447638beaf9d5aa4a","amp;dn":"Democracy+Now+-+18+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c7e0798f34f1c29e3fdec447638beaf9d5aa4a","infoHashBuffer":{"type":"Buffer","data":[136,199,224,121,143,52,241,194,158,63,222,196,71,99,139,234,249,213,170,74]},"announce":[],"urlList":[]}}