{"title":"Biography Channel: Freddie Mercury","uid":5777344,"size":365028743,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:88f90e2281800359679780dee0e7864554d69e82&amp;dn=Biography+Channel%3A+Freddie+Mercury&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"phatwarez","files":-1,"time":1282265172,"description":"Freddie Mercury\n\nFreddie Mercury, originally named Faroukh Bulsara, grew up in India and moved to Britain in 1964 to work for a time in Heathrow airport.\n\nInitially a vocalist in a band called Wreckage, Mercury joined Queen in 1971. At this point the band was made up of ex-Smile members Brian May on guitar and Rodger Taylor on drums. John Deacon answered an advert in the music press to become the band's bassist.\n\nTheir early career saw them release the poorly received album 'Queen' in 1973, and go on tour extensively, supporting Mott the Hoople.\n\nTheir second album, 'Queen 2', gave them their first hit single: 'Seven Seas Of Rye'. They gradually found a loyal audience in a difficult time for music; Freddie made a charismatic front man and the band worked together as a skilful team.\n\n'Sheer Heart Attack' and 'A Night At The Opera' followed, the former bearing 'Killer Queen', the latter 'Bohemian Rhapsody'. This epic song was a record breaker, remaining the longest running number one for twenty years.\n\nMercury wrote the catchy number 'Crazy Little Thing Called Love', from the album 'The Game', released in 1980, the same year that the band penned the score to 'Flash Gordon'.\n\nMercury's solo work included material for the soundtracks to 'Electric Dreams' and 'Metropolis'. His version of 'The Great Pretender' was a hit in 1987. He recorded an album and single, 'Barcelona', with opera diva Montserrat Caballe, for the Barcelona Olympics.\n\nThe group worked together again on 'The Miracle' and 'Innuendo', which was the last material to be released before Freddie's tragic death from AIDS in November 1991. He only admitted he was suffering from the virus the day before his death.\n\nOn 22 November 1991, Mercury had called Queen's manager Jim Beach over to his Kensington home, to discuss a public statement. The next day, 23 November, the following announcement was made to the press:\n\n&quot;Following the enormous conjecture in the press over the last two weeks, I wish to confirm that I have been tested HIV positive and have AIDS. I felt it correct to keep this information private to date to protect the privacy of those around me. However, the time has come now for my friends and fans around the world to know the truth and I hope that everyone will join with my doctors and all those worldwide in the fight against this terrible disease. My privacy has always been very special to me and I am famous for my lack of interviews. Please understand this policy will continue.&quot;\n\nA little over 24 hours after issuing the statement, Freddie Mercury died at the age of 45. The official cause of death was bronchial pneumonia resulting from AIDS.\n\nIn 1995 the last Queen album, 'Made In Heaven' was released, which made use of some of the unfinished work Mercury left unused before he died.\n\nFile Size ------- 347mb\nLength ---------- 44:00\nResolution ------ 720x432\nContainer ------- avi\nVideo Codec ----- h264\nAudio Codec ----- mp3\nFrame Rate ------ 24\n\np h a t w a r e z . t k","torrent":{"xt":"urn:btih:88f90e2281800359679780dee0e7864554d69e82","amp;dn":"Biography+Channel%3A+Freddie+Mercury","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88f90e2281800359679780dee0e7864554d69e82","infoHashBuffer":{"type":"Buffer","data":[136,249,14,34,129,128,3,89,103,151,128,222,224,231,134,69,84,214,158,130]},"announce":[],"urlList":[]}}