{"title":"Democracy Now - 16 jun 2011","uid":6473822,"size":439846064,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:892944bcdd6fb8f191346704968d841486f6c691&amp;dn=Democracy+Now+-+16+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1308242186,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 16, 2011\n\n- Lawmakers Sue Obama Admin for Libya Attack\n- 2 Iraqi Civilians Killed in U.S. Helicopter Attack\n- Zawahiri Named New Al Qaeda Chief\n- Manning Friend Refuses to Testify Before WikiLeaks Grand Jury\n- Former CIA Officer: Bush Admin Tried to Smear Prominent Academic, War Critic\n- Wisconsin Unions File Suit Over Anti-Collective Bargaining Law\n- Pakistan Denies Arrest of Top Army Major for Tipping Off CIA\n- 15 Killed in U.S. Drone Strike in Pakistan\n- Al-Qaeda Militants Attack Yemen Towns\n- U.N. Human Rights Chief Calls for Syria Probe\n- Rep. King Holds Hearing on Muslim &quot;Radicalization&quot; in U.S. Prisons\n- U.N. Warns of &quot;Huge Suffering&quot; in South Sudan Fighting\n- Rep. Giffords Released From Houston Hospital\n- Hacker Group Targets CIA Website\n\n\nSpecial reports\n\n- Political Crisis in Greece Amidst Revolt Against Massive Budget Cuts and Tax Hikes\n\nGreece was rocked Wednesday by massive street protests and a strike of millions of workers against the government's austerity plans. In response, embattled Greek Prime Minister George Papandreou announced he will reshuffle his cabinet to try to achieve consensus on how to address the country's crippling debt crisis. The new austerity package for Greece includes $9.4 billion in tax hikes, doubling past measures agreed to with bailout lenders that have pushed unemployment to a record 16.2 percent and extended a deep recession into its third year. We speak with Hara Kouki, a doctoral student based in Athens who has been writing about the protests, and by Costas Panayotakis, associate professor of sociology at the New York City College of Technology at CUNY.\n\n\n- Is U.S. Attack on Libya Legal? Rep. Dennis Kucinich Debates Former Reagan Attorney Robert Turner\n\nOn Wednesday, a bipartisan group of 10 members of Congress sued President Obama for violating the War Powers Act of 1973 by failing to obtain congressional approval for military operations in Libya longer than 60 days. We host a debate between Democratic Rep. Dennis Kucinich of Ohio, one of the congressmembers suing President Obama, and Robert Turner, who worked as an attorney in the Reagan White House and is a longtime critic of the War Powers Act. &quot;President Obama's position is absolutely clear: we are not engaged in war in Libya and thus if the War Powers Resolution were constitutional, it still would not apply,&quot; Turner says. &quot;I ask you, if another country sent 2,000 planes over the United States and some of those missions dropped bombs on us, would that be an act of war against the United States?,&quot; says Kucinich. &quot;That is exactly what we have done in Libya.&quot;\n\n\n- Aiming to Preserve Autocratic Mideast Rule, Saudi Arabia Helps Crush Uprisings in Bahrain, Yemen\n\nWhile the United States remains heavily involved in the Libya conflict, it has been noticeably silent on the violent suppression of popular uprisings against autocratic regimes Bahrain and Yemen, both of which are close allies of Saudi Arabia. In March, Bahrain called in Saudi troops to help crush massive pro-democracy protests. We discuss the role of Saudi Arabia in recent regional uprisings with Toby Jones, assistant professor of history at Rutgers University and former a former Persian Gulf analyst with the International Crisis Group.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:892944bcdd6fb8f191346704968d841486f6c691","amp;dn":"Democracy+Now+-+16+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"892944bcdd6fb8f191346704968d841486f6c691","infoHashBuffer":{"type":"Buffer","data":[137,41,68,188,221,111,184,241,145,52,103,4,150,141,132,20,134,246,198,145]},"announce":[],"urlList":[]}}