{"title":"Democracy Now - 16 aug 2010","uid":5767713,"size":445517137,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:89a3a1a4d5b5e5201aa01fd328a72d07dcbe68be&amp;dn=Democracy+Now+-+16+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1281976309,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 16, 2010\n\n- UN Chief: Pakistan Is Worst Disaster I've Ever Witnessed\n- Gen: Petraeus Hints Scheduled Afghan Withdrawal Could Be Postponed\n- Shadow War: U.S. Secretly Carries Out Strikes in Yemen\n- Obama Backs the Rights of Muslims to Build Mosque Near Ground Zero\n- U.S. Threatens to Cut Off Arms Deal To Turkey Over Criticism of Israel\n- White House Expresses Concern Over Election in Rwanda\n- Peruvian Prosecutor Seeks to Put Lori Berenson Back In Jail\n- France Urged to Repay $40 Billion &quot;Independence Debt&quot; to Haiti\n- Curfew Continues in Kashmir After Police Kill Four Protesters\n- Backers Of Open Internet Protest Outside Google HQ\n- Turkey Deports U.S. Journalist\n- Laborers' International Union Rejoins A.F.L.-C.I.O.\n- Singer, Civil Rights Activist Abbey Lincoln, 80, Dies\n\n\nSpecial reports\n\n- Journalist Exposes How Private Investigation Firm Hired by Chevron Tried to Recruit Her As a Spy to Undermine $27B Suit in Ecuadorian Amazon\n\nAn expose in the Atlantic magazine reveals how one of the world's largest private investigation firms, Kroll, hired by oil giant Chevron tried to recruit an American journalist to undermine a massive $27 billion dollar lawsuit against Chevron brought by the residents of the Ecuadorian Amazon. We speak with the journalist, Mary Cuddehe and with Han Shan, the coordinator for Amazon Watch's Clean Up Ecuador campaign.\n\n\n- Filmmakers, Activists Try to Save Dolphins From Slaughter in Oscar-Winning Doc The Cove\n\nThe Oscar-winning film The Cove opened last month in Japan after months of protests by right-wing activists who had pressured some cinemas into canceling screenings. The film documents how a group of activists and filmmakers used hidden cameras to expose the annual slaughter of over 20,000 dolphins in the small Japanese fishing village of Taiji, 200 miles southeast of Tokyo. We speak with the film's director, Louie Psihoyos and dolphin activist, Ric O'Barry.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:89a3a1a4d5b5e5201aa01fd328a72d07dcbe68be","amp;dn":"Democracy+Now+-+16+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89a3a1a4d5b5e5201aa01fd328a72d07dcbe68be","infoHashBuffer":{"type":"Buffer","data":[137,163,161,164,213,181,229,32,26,160,31,211,40,167,45,7,220,190,104,190]},"announce":[],"urlList":[]}}