{"title":"Drowning Pool - Feel Like I Do (2nafish)","uid":5804609,"size":129323012,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8a2f8dc474837389e4325b37fce4a1c85948e7a3&amp;dn=Drowning+Pool+-+Feel+Like+I+Do+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283404634,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Feel Like I Do&quot; is the first single off alternative metal band Drowning Pool's self-titled album. It was released to radio on February 9, 2010. It was used during the broadcast of the LA Galaxy vs Chivas USA game on ESPN. It was also used during the 2010 NFL Draft. &quot;Feel Like I Do&quot; is the highest-charting single by Drowning Pool to date, reaching #4 on the Billboard Hot Mainstream Rock Tracks chart, and surpassing &quot;37 Stitches&quot;, which peaked at #5. It is the band's second top-5 hit on that chart.\n\nThe music video for the song premiered on February 2010.\nDirector : Matt Cooper\n\nDrowning Pool is the eponymous fourth studio album by American heavy metal band Drowning Pool. It was released on April 27, 2010 and marks the band's first album not to feature a new singer, as Ryan McCombs remained with Drowning Pool from their 2007 release.\n\nThe song &quot;Feel Like I Do&quot; has been released as a digital single. It reflects a tough period in McCombs' life during which he went through a divorce, moved out of his home and lost his father. Fans who preordered the album received a download of the single as well as the second single &quot;Turn So Cold&quot; starting April 13, 2010. According to Blabbermouth.net, Drowning Pool's self-titled album sold 12,000 copies in its first week, earning it the #35 spot on the Billboard top 200.\n\nDrowning Pool is a four-piece alternative metal band that was formed in 1996 in Dallas, Texas, United States. They are currently signed to Eleven Seven Music and have released four albums, their most recent being their self titled album, Drowning Pool, which was released on April 27, 2010. Each of their first three albums has featured a different lead singer. After original lead singer Dave Williams died, Jason Jones took over for their second album, Desensitized. When he left the band for personal reasons, he was replaced by former Soil lead singer Ryan McCombs for Full Circle. McCombs then returned to sing on their fourth album Drowning Pool. The band played in CrÃƒÂ¼e Fest 2: The White Trash Circus  in the Summer of 2009. Drowning Pool have sold over 1.5 million units in the U.S. and they have sold over 3 million worldwide. They have made 4 studio albums, and have 10 music videos. They are also on the set list for Ozzfest 2010.\n\nDrowning Pool rose to fame while playing along with Ozzy Osbourne during an Ozzfest tour. Their 2001 debut album, Sinner, was certified platinum within six months, and the video for its first single &quot;Bodies&quot; was widely aired on various music video channels. After the September 11th attacks, radio stations pulled &quot;Bodies&quot; because there were concerns regarding its content in light of the 9/11 victims who had jumped from the towers. On August 14, 2002, the band's lead singer Dave Williams was found dead inside his tour bus. A spokesperson for the medical examiner from the Northern District of Virginia said he suffered from a form of heart disease. When asked if the band had any unreleased songs, according to a 2002 Blabbermouth  article, drummer Mike Luce replied that &quot;only 3-4 songs were done, including one called &quot;Heroes,&quot; which is a tribute to dead rock musicians such as Layne Staley. I don't know if we will ever release them.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8a2f8dc474837389e4325b37fce4a1c85948e7a3","amp;dn":"Drowning+Pool+-+Feel+Like+I+Do+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a2f8dc474837389e4325b37fce4a1c85948e7a3","infoHashBuffer":{"type":"Buffer","data":[138,47,141,196,116,131,115,137,228,50,91,55,252,228,161,200,89,72,231,163]},"announce":[],"urlList":[]}}