{"title":"Slaid Cleaves...No Angel Knows(1997)[FLAC]","uid":5787100,"size":246925950,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b27b478f783b47a50b65ec6ac4e74074733109c&amp;dn=Slaid+Cleaves...No+Angel+Knows%281997%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":16,"time":1282686868,"description":"1997 No Angel Knows   CD  Philo 1201 \n\nSlaid Cleaves' 1997 album No Angel Knows was produced by Lucinda Williams' band guitarist Gurf Morlix and comes out of similar singer/songwriter territory. The acoustic-band feel that ran through Morlix's previous small label recordings with Maine band the Moxie Men combines with the Texas troubadour tradition to produce a sound resembling that of Peter Case, Darden Smith or Robert Earl Keen. A song from Cleaves' early days revisited, a co-write with childhood friend Rod Picott in &quot;Wrecking Ball,&quot; and others capture small-town stories as well as Morlix's more famous employer. There's also a hint of Springsteen's passion for cars, rivers and bleak working-class lives on tracks such as &quot;Last of the V-8's&quot; or the defiant &quot;Not Going Down.&quot; The fine production enhances a set every bit as good as Cleaves' 1992 Life's Other Side, which led to his receiving a Kerrville New Folk songwriter award, or the 1993 self-released For the Brave &amp; Free which employed a host of Austin musicians. File under literate country-tinged folk-rock with a touch of swing. ~ Shaun Belcher\n\nRecorded at Ben Blank Audio, Austin, Texas and The Cone Of Silence, Pine Mills, Texas. Includes liner notes by Kevin Guyer.\n\nPersonnel: Slaid Cleaves (vocals).\n\nAudio Mixer: Gurf Morlix.\n\nLiner Note Author: Kevin Guyer.\n\nRecording information: Ben Blank Audio, Austin, TX; Cone Of Silence, Pine Mills, TX.\n\nPhotographer: Tonee Harbert.\n\nPersonnel: Slaid Cleaves (vocals, acoustic guitar); Gurf Morlix (acoustic &amp; electric guitars, lap steel guitar, pedal steel guitar, bass, percussion, background vocals); Bob Grant (mandolin); Troy Miller (dobro); Darcie Deaville (fiddle, background vocals); Chip Dolan (piano); Kevin Smith (bass, acoustic bass); Donald Lindley (drums, percussion); Karen Poston (background vocals);\n\n1 Not Going Down  3:48 \n2 No Angel Knows  2:49 \n3 Dance Around the Fire  3:36 \n4 Jennie's All Right  3:16 \n5 Look Back at Me  2:31 \n6 Wrecking Ball  4:01 \n7 The River Runs  3:20 \n8 Don't Tell Me  3:48 \n9 Skunk Juice  3:36 \n10 Last of the V-8s  3:18 \n11 29  3:32 \n\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:8b27b478f783b47a50b65ec6ac4e74074733109c","amp;dn":"Slaid+Cleaves...No+Angel+Knows%281997%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b27b478f783b47a50b65ec6ac4e74074733109c","infoHashBuffer":{"type":"Buffer","data":[139,39,180,120,247,131,180,122,80,182,94,198,172,78,116,7,71,51,16,156]},"announce":[],"urlList":[]}}