{"title":"Anthrax - Caught In A Mosh (2nafish)","uid":5759447,"size":184299524,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8b4383bd6a7b6660b6c016881c0c12486e767e12&amp;dn=Anthrax+-+Caught+In+A+Mosh+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281678667,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAmong the Living is the third studio album by American thrash metal band Anthrax. The album was released in March 1987 by Megaforce Worldwide/Island and is certified Gold by the RIAA. BBC has described the album as &quot;arguably their big breakthrough&quot;, and &quot;often cited by fans as their favourite Anthrax album&quot;.\n\nThe album was produced by Anthrax and Eddie Kramer. The album includes the singles, &quot;I Am the Law&quot; and &quot;Indians&quot;. The video for the song &quot;Indians&quot; received substantial rotation on MTV.\n\nThe cover of Among the Living depicts the Rev. Henry Kane, antagonist from the Poltergeist series of films. It has also been speculated that the cover is an homage to the character Randall Flagg, the antagonist from the Stephen King novel The Stand, as this character is the subject of the album's title track. &quot;A Skeleton In The Closet&quot; is also inspired by a Stephen King novella entitled Apt Pupil.\n\nThis was the final Anthrax album to feature songwriting contributions from original bassist Danny Lilker, who, despite having left the band after 1984's Fistful of Metal, was credited as the co-writer of several Anthrax songs for the next two albums. On Among the Living, he is credited as the co-writer of the songs &quot;I Am the Law&quot; and &quot;Imitation of Life&quot;.\n\nThe album was dedicated to the memory of Metallica bassist Cliff Burton, a highly regarded figure in the thrash community who died six months prior to the album's release.\n\nOn Anthrax's 2005 reunion tour with vocalist Joey Belladonna, the majority of their concert set consisted of material from Among the Living. On their 2006 tour they sometimes performed the album live in its entirety.\n\nOn November 10, 2009, a deluxe edition of the album was released which included a bonus concert DVD. The deluxe edition featured alternate takes of several album tracks, live versions, and an unreleased track entitled &quot;Bud E Luv Bomb And Satan's Lounge Band&quot;.\n\nIn 2000, the album was re-released in Germany as a double album along with Persistence of Time.\n\nAnthrax is an American heavy metal  band from New York City, formed in 1981. The band was one of the most popular of the 1980s thrash metal scene. When thrash metal began to gain a major following in the mid-to-late 1980s, Anthrax were dubbed one of the &quot;big four&quot; of thrash metal alongside Metallica, Megadeth, and Slayer.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8b4383bd6a7b6660b6c016881c0c12486e767e12","amp;dn":"Anthrax+-+Caught+In+A+Mosh+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b4383bd6a7b6660b6c016881c0c12486e767e12","infoHashBuffer":{"type":"Buffer","data":[139,67,131,189,106,123,102,96,182,192,22,136,28,12,18,72,110,118,126,18]},"announce":[],"urlList":[]}}