{"title":"Battlefield 2: Project Reality mod + Patches + Map Packs","uid":6384532,"size":7619278003,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8b56884ae9500481a1db523dde836d2570ae2b1e&amp;dn=Battlefield+2%3A+Project+Reality+mod+%2B+Patches+%2B+Map+Packs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Algu6","files":8,"time":1305151968,"description":"                         THE GAME ITSELF IS NOT INCLUDED\n\n                                                                                                      How to install Project Reality mod for Battlefield 2\n1. Have a clean copy of Battlefield 2, with no other mods installed \n\n(Can be with expansion packs)\n\n2. Apply the patches found in the \\\\\\\\\\\\\\&quot;Patches\\\\\\\\\\\\\\&quot; folder. First the 1.41 and then the 1.5.\n3. Install the Project Reality v.0.95 from the folder \\\\\\\\\\\\\\&quot;Project Reality Client\\\\\\\\\\\\\\&quot;. Starting from the first part, of course. \n\nWhen the installer asks you to go to http://www.realitymod.com/password/, do so and copy the password they provided, \n\nor just enter this: xZYgaWGIzUes2ydOuSrX8NEl9pPTDtLjM4q0oHkCQVmR35BwJK .When installing remember to set the \n\n\\\\\\\\\\\\\\&quot;installation directory\\\\\\\\\\\\\\&quot; to where your Battlefield 2 is.\n\n4. After all 3 parts of the client are installed, you might want to install the 2 Map Packs, which are also included in the folder \\\\\\\\\\\\\\&quot;Map Packs\\\\\\\\\\\\\\&quot;. \n\nThese bring many new and exciting maps to the game. \n\n      *****************************ABOUT THE MOD*****************************\n\n\nProject Reality is a free to download game modification for the Battlefield 2 (BF2) retail windows game. The Reality Mod installs alongside the existing game installation allowing both the original game and Project Reality to be played separately without causing conflicts.\n\nThe Mod developers aims are to rework the original game engine developed by Digital Illusions of Sweden (Dice) within legal and feasible constraints to create a more realistic combat environment for the gaming community. This includes adjusting various gameplay elements including physics, visual effects and overall game play formats. Along with changes to how the game handles, the PR team has introduced the British, Russian, Taliban and Insurgent factions, plus a number of community assisted factions are currently in the works to introduce Canadian, IDF forces and multiple others to the virtual battlefield.\n\nProject Reality has won second place two years running in ModDB.com\\\\\\\\\\\\\\'s annual Mod of the Year competition (2006 &amp; 2007), culminating in first place in 2008. The competition is the definitive event that showcases the best mods and indie games in the world and recognises the teams behind them.\n\nThe Project Reality team comprises a group of dedicated individuals, several of whom have backgrounds in armed services and whose sole task is to provide researched material, including statistical information to the developers. These are in turn tasked with coding and creating the mod itself. If you are looking for a fact based first person shooter from the perspective of a combat soldier, we feel Project Reality will provide for your gaming needs.\n\n\\\\\\\\\\\\\\&quot;Battlefield is all about fun, action-oriented gameplay. We\\\\\\\\\\\\\\'ll leave the truly realistic experiences to the mod teams who thrive on that type of action.\\\\\\\\\\\\\\&quot; (DICE)\n\n\\\\\\\\\\\\\\&quot;Battlefield will always be first about fun and secondly about realism. Realism implies complexity.\\\\\\\\\\\\\\&quot; (Sean Decker)\n\n\\\\\\\\\\\\\\&quot;As close to war as you are going to get when it comes to the Battlefield franchise\\\\\\\\\\\\\\&quot; (TotalBF2.com)\n\n\\\\\\\\\\\\\\&quot;Get ready for one of the meanest, most ruthlessly-demanding shooter experiences around.\\\\\\\\\\\\\\&quot; (IGN.com)\n\nThe Mod is currently in its fifteenth incarnation, Project Reality 0.91. In its earliest forms, the Project Reality Mini-Mod series began as a platform to experiment with certain realism changes and analyse their impact on gameplay with the retail BF2 engine. As the changes have progressed into tried and tested features it has become a product with a frequent release schedule which provides the gaming community with ever increasing material on the battlefield whilst improving on the realistic gaming necessary to satisfy their needs.\n\nThe ultimate goal continues to be the path to develop and release Project Reality v1.0, a stable and complete build which will be a markedly increased step up from the Project Reality Mini-Mod beginnings. This will include a complete British faction, including their various soldier classes, weaponry, vehicles and assets, as well as additional factions created by the community with help from the core developers.\n\nTrailer: \nOfficial Website: http://www.realitymod.com/","torrent":{"xt":"urn:btih:8b56884ae9500481a1db523dde836d2570ae2b1e","amp;dn":"Battlefield+2%3A+Project+Reality+mod+%2B+Patches+%2B+Map+Packs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b56884ae9500481a1db523dde836d2570ae2b1e","infoHashBuffer":{"type":"Buffer","data":[139,86,136,74,233,80,4,129,161,219,82,61,222,131,109,37,112,174,43,30]},"announce":[],"urlList":[]}}