{"title":"The Bob Dylan Encyclopedia","uid":5761391,"size":8256436,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b7fb987bfa3d4c915525fb82ef6f3441621bf62&amp;dn=The+Bob+Dylan+Encyclopedia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Djofullinn","files":1,"time":1281744503,"description":"Starred Review. Fans of Bob Dylan have a multitude of choices when it comes to biographies and retrospectives, but author Michael Gray (Song &amp; Dance Man #3: The Art of Bob Dylan) outdistances them all with this voluminous collection of all things Dylan. Over the course of 823 pages Gray considers everything from railroad imagery in Dylan's songs to his use of nursery rhymes, covering the topics thoughtfully and thoroughly. An entry on Rubin &quot;Hurricane&quot; Carter details the plight of the wrongfully jailed boxer immortalized in Dylan's song &quot;Hurricane,&quot; including not only a biography of the fighter, but details of the song's recording and live performance. Even the briefest of encounters merits an entry, such as when Neil Diamond challenged Dylan to top him as he came offstage. Dylan's reply: &quot;Waddaya want me to do-go onstage and fall asleep?&quot; Gray's knowledge of his subject is seemingly boundless, yet he manages to maintain a critical eye and keep Dylan's work in perspective. &quot;Unbelievable,&quot; a song off Dylan's Under the Red Sky album, is called &quot;a hopeless piece of rockist sludge picked from the obscurity of the album and issued as a single. Almost any other track would have fared better .&quot; While Gray is certainly a fan, it's this impartiality that fuels the book and gives it weight. Insightful and entertaining, Gray's tome will broaden appreciation of the artist, his influences and his legacy. 100 b&amp;w illustrations.\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc.\n &lt;a href=&quot;\nhttp://www.amazon.com/Bob-Dylan-Encyclopedia-Revised-Updated/dp/0826429742/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1281737065&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Bob-Dylan-Encyclopedia-Revised-Updated/dp/0826429742/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1281737065&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:8b7fb987bfa3d4c915525fb82ef6f3441621bf62","amp;dn":"The+Bob+Dylan+Encyclopedia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b7fb987bfa3d4c915525fb82ef6f3441621bf62","infoHashBuffer":{"type":"Buffer","data":[139,127,185,135,191,163,212,201,21,82,95,184,46,246,243,68,22,33,191,98]},"announce":[],"urlList":[]}}