{"title":"Thompson Twins - Lies (2nafish)","uid":5808245,"size":116654084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8bf0b8f64a6ce0712b97a944ed2b1e509d23de0d&amp;dn=Thompson+Twins+-+Lies+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283523792,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Lies&quot; is a 1983 song by the British pop / new wave band Thompson Twins. It was released as the first single from the album Quick Step and Side Kick (which was renamed Side Kicks in the U.S.), and the song peaked at #67 on the UK singles chart. The single fared better in the United States, where it peaked at #30 on the Billboard Hot 100 chart in the spring of 1983. Along with the B-side track &quot;Beach Culture&quot;, &quot;Lies&quot; also spent two weeks at #1 on the American dance chart in January 1983, becoming the band's second #1 on this chart (&quot;In The Name Of Love&quot; had spent five weeks atop this chart in 1982). The music video was played on MTV  and other video programs and features the band in an oversized bed where their feet are hanging out over the end, bouncing back and forth to the rhythm of the song.\n\nQuick Step and Side Kick is the third album by the British synthpop group Thompson Twins. It was released in February 1983, and was their first album to be released as a trio (the band consisted of up to seven members during previous releases). The album reached no.2 two on the UK Albums Chart and was later certified Platinum by the BPI.\n\nIn the USA, the album was released simply as Side Kicks, and was only the second Thompson Twins album to be released there.\n\nThe album was the first collaboration between the band and producer Alex Sadkin and was recorded at his Compass Point studio in the Bahamas. The singer Grace Jones (who had worked with Sadkin on three of her albums by that time) made a guest appearance on the track &quot;Watching&quot;, though her vocals were not included on the track when it was remixed and released as a single in mid 1983.\n\nThe album has several different versions according to different territories, containing different tracks and different track order. The UK cassette version of the album also contained a whole side of remixes of various tracks and the 12&quot; extended version of the B-side &quot;Beach Culture&quot;.\n\nThe Thompson Twins were a British New wave group that were formed in April 1977 and disbanded in May 1993. They achieved considerable popularity in the mid 1980s, scoring a string of hits in the UK, the US and around the globe. The band was named after the two bumbling detectives Thomson and Thompson in HergÃƒÂ©'s comic strip, The Adventures of Tintin. A predominately synthpop trio, they were joined on stage at Live Aid by Madonna and were at the forefront of the second, so-called, British Invasion.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8bf0b8f64a6ce0712b97a944ed2b1e509d23de0d","amp;dn":"Thompson+Twins+-+Lies+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf0b8f64a6ce0712b97a944ed2b1e509d23de0d","infoHashBuffer":{"type":"Buffer","data":[139,240,184,246,74,108,224,113,43,151,169,68,237,43,30,80,157,35,222,13]},"announce":[],"urlList":[]}}