{"title":"HISTORY OF POP AND ROCK MUSIC - part 262","uid":5821751,"size":1245343638,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8c9fc90ccf641ccb533e27f2222fdf5f578c4c75&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+262&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1284084102,"description":"                     PART  262\n\n\n           JETHRO TULL  - With You There To Help Me  (1970)\n           FREE  - Fire and Water  (1970)\n           FREE  - Mr.Big  (1970)\n           THE EDGAR BROUGHTON BAND -  Apache Drop Out  (1970)\n           CCR  -  I Heard It Through the Grapevine (1970) \n\n\n           JIMI HENDRIX  -  Are You Experienced  (Promo)   \n           JIMI HENDRIX  -  Little Wing  (1969)\n           JIMI HENDRIX  -  Voodoo Child  (Psychedelic Promo)\n                          \n                         \n\n\n     &quot;With You There To Help Me&quot; is a song by the English progressive rock band Jethro Tull from their album &quot;Benefit&quot;. &quot;Benefit&quot; is the third album by Jethro Tull and it was released in April 1970. It was the first album to feature John Evan on keyboards and the last to feature Glenn Cornick on bass guitar. It achieved number 3 in the UK album charts. \n     &quot;Fire and Water&quot; was written by Fraser and Rodgers and recorded by Free. It is the opening track on their 1970 album &quot;Fire and Water&quot;.Unlike their previous albums &quot;Tons of Sobs&quot; and &quot;Free&quot; it was a success, reaching #2 in the UK charts and #17 in the American, making it the most successful Free album. This is due to the album containing the hit single &quot;All Right Now&quot; which they later played to a crowd of over 600,000 people at the 1970 Isle of Wight Festival, which generated them popularity\n     &quot;Mr.Big&quot; was written by Fraser, Rodgers, Kirke and Kossoff.and recorded by Free. The song originally appears on the band's 1970 album &quot;Fire and Water&quot;.. \n     &quot;Apache Drop Out&quot; was written by Jerry Lordan and recorded by The Edgar Broughton Band,an English progressive rock group. The single &quot;Apache Drop Out&quot; reached #33 on the UK Singles Chart in 1970. \n     &quot;I Heard It Through the Grapevine&quot; is a landmark song in the history of Motown Records. Written by Norman Whitfield and Barrett Strong in 1966, the single was first recorded by Smokey Robinson &amp; the Miracles. Released on September 25, 1967 as Soul 35039 by Gladys Knight &amp; the Pips who recorded the third version of the song, it has since become a signature song for singer Marvin Gaye, who recorded his version of the song prior to the Pips' but released it after theirs on October 30, 1968 as Tamla 54176. Creedence Clearwater Revival released their popular version of the song in 1970. for their album, &quot;Cosmo's Factory&quot;,\n     &quot;Little Wing&quot; is a song written by Jimi Hendrix. It was first recorded by The Jimi Hendrix Experience on their 1967 album &quot;Axis: Bold as Love&quot;. It is ranked #357 on Rolling Stone magazine's list of &quot;the 500 Greatest Songs of All Time&quot;. &quot;Little Wing&quot; is played using the unique chord/melody guitar style that Hendrix developed during his early career stints in rhythm and blues bands. In this style, the guitar sounds as though it is playing two parts. This is done by simultaneously playing multiple complementary notes, often parts of chords, and then changing a note within the chord to create a melodic effect, similar to &quot;Wish You Were Here&quot; by Pink Floyd and &quot;Gimme All Your Lovin'&quot; by ZZ Top. The unusual flanging sound of the lead guitar part is a result of the Doppler effect which is created using a rotating speaker cabinet, or Leslie speaker.","torrent":{"xt":"urn:btih:8c9fc90ccf641ccb533e27f2222fdf5f578c4c75","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+262","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c9fc90ccf641ccb533e27f2222fdf5f578c4c75","infoHashBuffer":{"type":"Buffer","data":[140,159,201,12,207,100,28,203,83,62,39,242,34,47,223,95,87,140,76,117]},"announce":[],"urlList":[]}}