{"title":"Trip (2009)","uid":5781537,"size":819551834,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d56050fba4b6aae3205d91e73f679d674bdcef3&amp;dn=Trip+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1282429251,"description":"Trip (2009) \n\nlanguage - romanian\n\n\nTVRip, XVID, 368x208, 912kbps, Lame MP3, 1h 56min 54sec \n\n Genul: Drama\nRegia: Florina Titz\nScenariul: Florina Titz\n\nActori:\n\nMarian Adochitei\nLana Moscaliuc\nMirela Ungureanu\nDragos Stefan\nDan Zorila\nFlorian Banu\nDan Telehoi\n\nCompanii producatoare: Etcaetera FILMS / Rogue Productions\nTara: Romania\nDetalii tehnice: 150 min\n\nSinopsis:\n\nFolosind o maniera voyeuristica, TRIP te insereaza in vietile personajelor Yumi, Ovidiu,Dani, Ada si Cristi, tineri dependenti unul de celalalt, explorand perpetuu posibilitatea de a se elibera de tensiunea unei realitati bizare. Dezgustul, plictiseala si refuzul de a sucomba intr-un oras-desert sunt reflectate prin proiectarea unor genuine epifanii pe fundalul spatiilor limitante din Constanta postcomunista, si potentate de preferinta pentru culori intense, ritmuri acerbe si un feeling de post-pop-art. TRIP exploreaza limbajul eidetic al contemporaneitatii constantene, penetrand in vietile personajelor legate printr-o prietenie patologica, schizofrenie si imaginatie. Prietenii din acest grup simt ca isi pierd sanatatea mentala in spatiul socio-cultural anost in care traiesc. Isi petrec viata antrenandu-se in discutii fara rost sau dezbateri lingvistice fara un adevarat fundament logic si folosind unelte de alterare a constiintei precum drogurile si alcoolul. In Constanta, oras-fantoma, o alta solutie pentru un escapism autentic nu pare sa apara. Intrunul din putinele evenimente din afara apartamentului lor - spatiu inchis, concentric - ei o intalnesc pe Ada, o tipa interesanta care calatoreste din oras in oras, parasind oameni si prieteni succesiv, iar integrarea sa in grup pare sa fie una completa si absoluta. In multele sesiuni de role-play, unde cei cinci isi imagineaza progresiv ca sunt altundeva, altcineva, in cu totul alte circumstante, lucrurile par sa ia o intorsatura tragica atunci cand distanta intre realitate si vis devine din ce in ce mai subtire, iar bolile psihice, intretinute printr-un continuu cerc vicios, par sa se agraveze. ","torrent":{"xt":"urn:btih:8d56050fba4b6aae3205d91e73f679d674bdcef3","amp;dn":"Trip+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d56050fba4b6aae3205d91e73f679d674bdcef3","infoHashBuffer":{"type":"Buffer","data":[141,86,5,15,186,75,106,174,50,5,217,30,115,246,121,214,116,189,206,243]},"announce":[],"urlList":[]}}