{"title":"The Cellar (1989).avi","uid":5824182,"size":577616592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d7979d294e32a4b6e0354a3370fe616f305a999&amp;dn=The+Cellar+%281989%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kanano","files":1,"time":1284192770,"description":"A young boy finds an ancient Comanche monster spirit in the basement of his home. His parents don\\'t believe him, so he must kill the monster alone.\n\n\n\n\nIMDB Link: http://www.imdb.com/title/tt0099235/\n\n\n\n\n\n**********\n\n\n\nSaw this movie years ago when I was a kid. Remembered it and decided to try and download it so I went for a torrent of it, but I couldn't find one. After spending a while online, I finally found it onsplit into 6 parts. After several hours of downloading, waiting, then finally getting them all and joining them together, I finally had the movie. Whoever originally uploaded this did a good job, I can't tell if it's VHS or DVD. \n\n\n\n\nAnyway, enjoy and seed! \n\n\n\n\n\n************\n\n\n\n\n\nAlso, regardless of how many seeders this gets besides the bunch of people who initially download new files then delete, I will be seeding this for a long, long time. I don't let my torrents die. I know what it's like to find a torrent for something you really want, open it then see that no one's seeding it and it's impossible to get. So even if this doesn't get popular, sometime, somewhere down the line, some guy's gonna go &quot;Hey, I remember that movie The Cellar, it was pretty cool, I wonder if there's a torrent of it?&quot; and that guy's gonna search for it and you know what? He's going to get it. \n\n\n\n\nHowever though, I do use my internet connection to play online on my Ps3 and utorrent does slow my computer down a bit so I have to close it sometime so you may not get this when you want at first. I do leave utorrent open while I sleep and a lot of time when I'm on my computer if I'm only watching movies or browsing online so you will eventually get it, it just might take awhile. \n\n\n\n\n\nThe only time this torrent will ever completely die is if I get a new computer and can't download the original file to resume seeding. If that ever does happen somewhere down the line, and you want the movie, then email me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d0b7a2b5b5beb4b1a9a2a5bcb5a3a4b8b5a7bfa2bcb4e9e9e990b8bfa4bdb1b9bcfeb3bfbd&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; (my spam email) and I'll give you the link to the webpage that has thelinks for it but I hope it never comes to that. And don't email me asking for the link when there's still seeders on this, even if it's just me. Trust me, I have a 1 MB internet speed and that'll be going behind this mostly for awhile, and getting it like that will be a LOT faster then usingwhat with the waiting to download, only 100 kbs download speed, then waiting another half hour just to be able to download again thing, unless you're a Premium member, and by the amount ofcard number generators&quot; andpremium account hack&quot; sites I don't think many people are, and I still want seeders anyway. \n\n\n\n\nAnyway, enjoy, it's a pretty cool monster movie. \n\n\n\n\n","torrent":{"xt":"urn:btih:8d7979d294e32a4b6e0354a3370fe616f305a999","amp;dn":"The+Cellar+%281989%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7979d294e32a4b6e0354a3370fe616f305a999","infoHashBuffer":{"type":"Buffer","data":[141,121,121,210,148,227,42,75,110,3,84,163,55,15,230,22,243,5,169,153]},"announce":[],"urlList":[]}}