{"title":"Coast to coast AM 2011-05-03 9-11 &amp; Energy Weapons","uid":6368241,"size":55533694,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8deb948ba192cca2a569d89c68da51efbb97ab8b&amp;dn=Coast+to+coast+AM+2011-05-03+9-11+%26+Energy+Weapons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":5,"time":1304584929,"description":"Torrent downloaded from\nUploaded by Tollon\n\nDate: 05-03-11 \nHost: George Noory \nGuests: Judy D. Wood, Howard Bloom \nFormer professor of Mechanical Engineering at Clemson University, Dr. Judy Wood discussed how the destruction of buildings in NYC on 9-11 was the result of directed energy technology, not planes, fire, thermite or bombs. In her book, Where Did the Towers Go?, she focuses on physical evidence, and has not speculated on whether the US government was involved in the attacks. The official story of the Towers' &quot;pancaking&quot; down, and the lack of subsequent debris doesn't fit with the explanation of fire, or even theorized controlled demolitions, she said. And &quot;planes cannot turn buildings into powder in midair and leave no remains,&quot; she added. \n\nShe cited the exactitude of the damage-- the 47-story Building 7 collapsed, but the Post Office across the street &quot;didn't get a scratch on it.&quot; And a police car had abrupt boundaries of damage-- the front half melted, while the back half appeared untouched-- &quot;fire doesn't do that,&quot; she noted. \n\nFrom her studies, Wood concluded that a kind of (weaponized) free energy technology was employed in the WTC attacks, similar to the Hutchison Effect or Tesla technology. Tesla had wanted to share this technology 100 years ago, but was afraid it would be used for evil, she commented. She described the technology as a &quot;magnetic electro-gravitic nuclear reaction&quot; that interferes with energy fields, and suggested it might have also been used in the 1995 Oklahoma City bombing. \n\nPoll on bin Laden\nFirst hour guest, author Howard Bloom reacted to our surprising Insta-Poll results on the burial of bin Laden, in which 42% of respondents said they don't believe the body was bin Laden, and that the burial at sea was part of a cover-up. He suggested this might reflect the percentage of non-Democrats who mistrust the Obama administration. A certain amount of mistrust in the government is healthy, as it represents the freedom of speech we have in this country, he added. \n\nNews segment guests: Doug Hagmann, Chris Conrad \n\nWebsite(s): \ndrjudywood.com\nwheredidthetowersgo.com\nHowardBloom.net\nbigbangtango.net\nBook(s): \nwhere Did the Towers Go?\nThe Genius of the Beast: A Radical Re-Vision of Capitalism\n","torrent":{"xt":"urn:btih:8deb948ba192cca2a569d89c68da51efbb97ab8b","amp;dn":"Coast+to+coast+AM+2011-05-03+9-11+%26+Energy+Weapons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8deb948ba192cca2a569d89c68da51efbb97ab8b","infoHashBuffer":{"type":"Buffer","data":[141,235,148,139,161,146,204,162,165,105,216,156,104,218,81,239,187,151,171,139]},"announce":[],"urlList":[]}}