{"title":"Hydrophobia.Prophecy-SKIDROW","uid":6379617,"size":2880296691,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8df8a23a0b74c62fd21153cf96d7833663848fd0&amp;dn=Hydrophobia.Prophecy-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":60,"time":1304983431,"description":"                          S  K  I  D  R  O  W\n\n                          .the leading force.\n\n\n\n                           proudly presents\n\n          Hydrophobia: Prophecy (c) Dark Energy Digital Ltd.\n\n\n\n\n\n  09-05-2011........Release Date &lt;-&gt; Protection...............Steam\n\n  Action...............Game Type &lt;-&gt; Disk(s)..................1 DVD\n\n\n\n\n\n  RELEASE NOTES\n\n\n\n\n\nHydrophobia: Prophecy is the ultimate version of this jaw-dropping\n\naction-adventure set onboard a floating city, where terrorists take\n\ncontrol and heroine Kate has to overcome her haunting childhood\n\nmemories to fight back using all her skills and expertise as a systems\n\nengineer.\n\n\n\n2051. The world has become consumed by the ever rising tide of the\n\nglobal population flood. Fertile land has been reclaimed by rising\n\noceans and expanding deserts, resulting in famine and poverty on an\n\nunprecedented scale. Water is now mankind's most precious resource, and\n\nconflict erupts wherever it flows.\n\n\n\nA new political and ideological struggle has arisen. On one side are\n\nthe Malthusians, who seek to control and reduce the global population.\n\nOn the other side the Cornucopians, who want to find a technological\n\nsolution to feed it. As desperation turns to despair, extremists on\n\nboth sides are emerging.\n\n\n\nOnly one buble of the old capitalist world survives. The Queen of the\n\nWorld is the largest ship ever to grace the oceans, a colossal city at\n\nsea where the wealthy elite live in exile from the chaos which\n\nsurrounds them. Onboard this stateless paradise the Five Founding\n\nFathers set about pursuing their Cornucopian research unimpeded.\n\n\n\nThe contempt of the outside world is offset by NanoCell Corporation,\n\none of the five, who promise to develop nano-technology to purify sea\n\nwater at the molecular level and make the deserts bloom with the food\n\nof the world. But as they move closer to their goal, the bitterness of\n\nfanatical Malthusians grows.\n\n\n\nThe so called 'Neo Malthusians' timed their attack perfectly. 9.8\n\nbillion watched as they recast hope as hatred, following a prophecy to\n\ncommit global genocide; drowning the planet with blood as they slash\n\nthe worlds population to a mere half billion 'righteous souls'. A\n\nprophecy they will soon find themselves in a position to fulfil.\n\n\n\nFeatures:\n\n\n\nFast-paced action and breathtaking visuals; engage mind blowing &quot;flow\n\ncombat&quot; unique floating cover where emergent gameplay results in a\n\nnever-the-same-experience.\n\n\n\nUnleash floating oil fires, electricity and the power of the water to\n\nwipe out your enemy as you discover the terrifying truth of the\n\nMalthusian prophecy.\n\n\n\nCampaign includes puzzles, platforming and combat with Hydro-kinetic\n\npowers to ultimately control the water and culminates in a unique stand\n\noff battle where the player has to unleash the awesome power of tempest\n\nagainst her Malthusian nemesis.\n\n\n\nOver 200 collectables, 12 achievements and as an added bonus, players\n\ncan unlock an epic Challenge Room.\n\n\n\n\n\n  INSTALL NOTES\n\n\n\n\n\n1. Unpack the release\n\n2. Mount or burn image\n\n3. Install\n\n4. Copy all files from the SKIDROW folder to the game installation\n\n5. Play the game\n\n6. Support the companies, which software you actually enjoy!\n\n\n\n\n\n  GREETINGS\n\n\n\n\n\n Unleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - SHOCK\n\n       CRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\n\n\n\n\n\n                               ascii art by the\n\n                              godlike &amp; terrific duo\n\n                                  malodix + irokos\n\n                                   titan artdivision","torrent":{"xt":"urn:btih:8df8a23a0b74c62fd21153cf96d7833663848fd0","amp;dn":"Hydrophobia.Prophecy-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8df8a23a0b74c62fd21153cf96d7833663848fd0","infoHashBuffer":{"type":"Buffer","data":[141,248,162,58,11,116,198,47,210,17,83,207,150,215,131,54,99,132,143,208]},"announce":[],"urlList":[]}}