{"title":"VA_-_Sunlounge_Sessions_Vol_1-(3CD)-2011-DRUM","uid":6384767,"size":437643499,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e73752012f2a88b65a0f71ec66ca9f6a01e2195&amp;dn=VA_-_Sunlounge_Sessions_Vol_1-%283CD%29-2011-DRUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":19,"time":1305160520,"description":": D R U M :\n\n. 2005 .\n\n. .. is proud to present you another fine release .. .\n\nVA - Sunlounge Sessions Vol 1\n\nTracks.: cd1: 16 cd2: 17 cd3: 16\nLabel..: Edel\nGenre... Lo-Fi\nSource.: CDDA\nGrabber: EAC\nEncoder: Lame 3.98.4 V0 VBR NEW\nQuality: mp3 VBRkbps 44,1kHz Joint-Stereo\nRipDate: May-11-2011\n\n..#.  ..Trackname.                                                                                                        ..Length\n\nCD1 Mix\n\n01    Talvin Singh - Traveller (Kid Loco's Once Upon A Time In The East Mix)\n02    Jazzamor - Lovin You\n03    Kool &amp; The Gang - Summer Madness\n04    Christoph Spendel Feat. Lisa Shaw - Sunny (Feat. Lisa Shaw) Feat. Lisa Shaw\n05    Karen Ramirez - Troubled Girl (Spanish Version)\n06    Lenny Ibizarre - Smooth Temptation\n07    Roy Ayers Ubiquity - Everybody Loves The Sunshine\n08    Jose Delgado - Stella Mare\n09    Stephane De Lucia - Liquid Sun\n10    Afterlife Feat. Cathy Battistessa - Let It Go (Original) Feat. Cathy Battistessa\n11    Way Out West - One Bright Night (Instrumental Mix)\n12    Naoki Kenji - Into The Deep Sea\n13    Agua Loca Project - Bahia Blanca\n14    Lustral - The Price We Pay For Love (Original Mix)\n15    Stephane De Lucia - Musical Perfume\n16    Sin Plomo Meets Paul Lomax - Sweet Love\n\nCD2 Mix\n\n01    Fish Go Deep &amp; Tracey K - The Cure &amp; The Cause (Acoustic Version)\n02    Nick Bridges feat. Amanda Wilson - Underneath My Skin (Kinny's Chill Out Mix) Feat. Amanda Wilson\n03    Brockman &amp; Basti M feat. Nic - Live Your Life (Free Your Mind) (Brockman &amp; Basti M Sunset Mix) Feat. Nic\n04    Eddie Thoneick Feat. Andy P - Love Under Pressure (Chillout Mix) feat. Andy P\n05    Spiller - Cry Baby (Ryksopp's Mlselves Memorabililia Mix)\n06    Kings Of Tomorow - Changes (R N B Mix)\n07    Tom Tom Club - Love To Love You Baby (Tom Novy &amp; The Gran' Flow Mix)\n08    Masters At Work Feat. India - I Can't Get Not Sleep (Choice Hip Hop Mix) Feat. India)\n09    Reel People Feat. Angela Johnson - You Used To Hold Me So Tight (Live Version) Feat. Angela Johnson\n10    Negrocan - Cada Vez (Original Album Version)\n11    Funkerman - Speed Up (ATFC's Ronnie Scotts Rub)\n12    Mood II Swing - Can't Get Away (Blaze Shrine Early Morning Dub)\n13    Larse - The More I Want\n14    Mario Da Ragnio &amp; Milkwish Vs. Miqro - Without You (Original Mix)\n15    Mousse T. - Teef\n16    Falko Richtberg &amp; Sebastian Wojkowski - Viento Caliendo\n17    Dennis Ferrer - Sinfonia Della Notte (The Afterlife Sunset Reprise\n\nCD3 Mix\n\n01    JetTricks - Love Hangover\n02    Ralph Myerz feat. Pee Wee - My Darling (Original Mix) Feat. Pee Wee\n03    Reel People Feat. Dyanna Fearon - Butterflies (Album Version) Feat. Dyanna Fearon\n04    Opensouls - In Your Hands (Open Souls Edit\n05    CAN 7 Feat. Angela Caran - Eternally (Album Version) Feat. Angela Caran\n06    Marc Evans - The Way You Love Me (MuthaFunkin Soul Mix\n07    SoulChillaz - Alright (Original Mix\n08    Francesco Rossi - Princesa (Music In Your Eyes Mix\n09    Sharam Feat. Daniel Bedingfield - The One (Downtempo) Feat. Daniel Bedingfield\n10    Casanovy - I Need Your Lovin' (Sin Plomo's Superlounger Mix\n11    Schwarz &amp; Funk - 5 AM (Original Mix\n12    David Tort &amp; Norman Doray - Chase The Sun (Musica Feliz Ibiza Dream Remix\n13    Grum - Want U (Original Mix\n14    Darwin &amp; Backwall feat. Emilie Wallin - Good Morning Stockholm (Ozgur Can Remix) Feat. Emilie Wallin\n15    Tensnake - Coma Cat (Original Mix\n16    Larse - There You Are (Original Mix\n\n.Total.. 229:5\n\nCD1 Mixed by Stephane De Luca\nCD2 Mixed by Deep59\nCD3 Mixed by Ian Siga\n\nEnjoy\n\nDRUM is a group  that releases all kind  of electronic  stuff but  mainstream\nWe dont  care for any  releaseyear or source...its still all about  the music\nIn the  beginning of 2002 we began to support the scene with the best of the\nbest ... our  goal was not  to become  group #1 in scene ... we rather\nwanted  to create a strong  community out of music lovers and give our\nmusictaste to the ppl who still understand the music and its spirit\nand after 2 years we're stronger than ever before. The friendship\nthat we earn keeps us continuing every single day of the year\nand it will go on like this. So we wanna say thank you to all the\nppl that helped us over the last 2 years ... siteops, groups and\nany kind of sceners. In the  times of  flaming and  arrogance its a\nluck to find ppl with the same attitude like we have. We  appreciate\nyour help and your support in any way. So if  you wanna  join our\nsmall  and welfare community, dont hesitate\nto contact us\n\nWe dont care for a monthly amount of rips\nits still all about the music and friendship\n\nLast but not least a few greets fly\n\nto our friends from\n\n1way AMOK BCC BFHMP3 BOSS CMC CMG DPS EMP FKK FuFFENS gEm HiT2000 iTS kiNKy\n\nkW mbs miso MPX MYCEL PsyCZ sb sour SSR TR UBE UKi\n\nTHE END\n\n.KND.\n\n.Drum 2005","torrent":{"xt":"urn:btih:8e73752012f2a88b65a0f71ec66ca9f6a01e2195","amp;dn":"VA_-_Sunlounge_Sessions_Vol_1-%283CD%29-2011-DRUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e73752012f2a88b65a0f71ec66ca9f6a01e2195","infoHashBuffer":{"type":"Buffer","data":[142,115,117,32,18,242,168,139,101,160,247,30,198,108,169,246,160,30,33,149]},"announce":[],"urlList":[]}}