{"title":"Procession - Fiaba (1974) [Ape+Cue] Prog Rock (TNTVillage)","uid":5824433,"size":194397446,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e9128245c3b724445d734482ec7aca78ce20223&amp;dn=Procession+-+Fiaba+%281974%29+%5BApe%2BCue%5D+Prog+Rock+%28TNTVillage%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RJ65ITA","files":6,"time":1284203144,"description":"Artist: Procession\nAlbum title: Fiaba\n\nTracklist:\n\n1. Uomini Di Vento (3:58)\n2. Un Mondo Sprecato (4:41)\n3. C'era Una Volta (8:11)\n4. Notturno (8:09)\n5. Il Volo Della Paura (4:54)\n6. Fiaba (5:27)\n\nBand:\n\nGianfranco Gaza - vocals\nRoby Munciguerra - guitar\nMaurizio Gianotti - saxophone, flute\nPaolo D'Angelo - bass\n\nGuest musicians:\nFrancesco &quot;Froggio&quot; Francica - drums, perc.ussion\nEttore Vigo - keyboards (3)\nSilvana Aliotta - vocals (3)\nFranco Fernandez - keyboards (2 &amp; 6) \n\nDati:\n\nGenere: Progressive Rock\nAnno: 1974\nNazione: Italia\nCompressione: Nessuna/None\nCovers: Incluse\n\nITALIANO\nDopo un esordio coraggioso, ma poeticamente debole, i Procession attraversano un periodo di stasi dovuto principalmente al fallimento della loro discografica &quot;Help&quot;, di cui furono gli ultimi protagonisti a 33 giri. In piÃƒÂ¹, a causa delle modeste vendite del primo lavoro e i soliti problemi dovuti alla chiamata di leva, il gruppo subisce anche un rimpasto che lascerÃƒÂ  intatti solo i 2/5 della band originale. Se ne vanno prima il chitarrista Marcello Capra e il bassista Angelo Girardi partiti a militare, e poi il batterista Giancarlo Capello per lasciar spazio a Maurizio Gianotti (sax e flauto) e Paolo D'Angelo (basso). A questi, si aggiunge anche il batterista Francesco Froggio Francica, ex Raccomandata con Ricevuta di Ritorno, riportando la band all'originale assetto a cinque. Rimasti fedeli al produttore Pino Tuccimei, i rinnovati Procession approdano alla Fonit-Cetra che li convoca per incidere il loro secondo album negli studi di Via Bertola a Torino. Dopo quasi due mesi tra prove e registrazioni, esce cosÃƒÂ¬ nel 1974 &quot;Fiaba&quot;: sei brani di circa sei minuti l'uno composti prevalentemente da Roby Munciguerra che da un lato ricordano molto le atmosfere di &quot;Frontiera&quot;, ma dall'altro non le ammantano con problematiche superiori alle capacitÃƒÂ  narrative di Marina Comin, anche in questo caso autrice di tutti i testi. Di fatto, la dimensione fiabesca che avvolge il disco, non solo calza meglio alla sognante poetica dei testi, ma anche al sound del gruppo che risulta molto piÃƒÂ¹ morbido e organico. La stessa copertina non richiama piÃƒÂ¹ i duri simboli di un dramma storico (la valigia dell'emigrato in &quot;Frontiera&quot;) ma fantasiosi simboli araldici e, all'interno, un pittoresco castello in cui stanno simbolicamente confluendo sia musicisti di estrazione classica ,sia giovani musicisti Pop. A suggellare il nuovo corso della loro carriera, i Procession chiamano a se anche tre ospiti di grande prestigio. L'ex cantante-percussionista dei Circus 2000 Silvana Aliotta e il tastierista dei Delirium Ettore Vigo, apportano il loro contributo nel brano &quot;C'era una volta&quot;, mentre il tastierista Franco Fernandez comparirÃƒÂ  invece in &quot;Un mondo sprecato&quot; e &quot;Fiaba&quot;. Considerato unanimemente il lavoro migliore del gruppo torinese, &quot;Fiaba&quot; si apre con un'intensa galoppata di percussioni sulla quale intervengono gradualmente tutti gli strumenti definendo in poche misure il groove generale del disco: un piacevole Prog molto piÃƒÂ¹ acustico che elettrico, con grandi concessioni al Jazz-Fusion, specie nell'uso dei fiati. La parti piÃƒÂ¹ rock sono affidate alla chitarra elettrica di Roby Munciguerra che, specie nel primo brano &quot;Uomini di vento&quot; fornisce un ottimo biglietto da visita delle sue capacitÃƒÂ , mentre il lato piÃƒÂ¹ morbido ÃƒÂ¨ rappresentato dal flauto di Maurizio Gianotti che contrappunta delicatamente il tessuto armonico con tanto di raddoppio sulle note. Estremamente efficaci anche gli interventi del sax che, specialmente nell'attacco di &quot;C'era una volta&quot;, raggiungono un raro livello di efficacia e di bellezza pur pagando un debito forse eccessivo al turnista dei Pink Floyd Dick Parry. Anche in questo caso perÃƒÂ², ci pensa il raddoppio sul finale a personalizzare dignitosamente l'assolo. Sempre nello stesso brano (che possiamo considerare il piÃƒÂ¹ rappresentativo dell'album), ÃƒÂ¨ davvero troppo accostabile alla Claire Torry di &quot;The great gig in the sky&quot; il pur ottimo contributo di Silvana Aliotta (foto a sx) che, in quello stesso periodo, aveva appena pubblicato il suo primo ottimo singolo &quot;Madre&quot;. Vero e proprio marchio di fabbrica dei Procession ÃƒÂ¨ infine la splendida voce di Gianfranco Gaza, il cui registro alto e potente, svetta per esempio in &quot;Notturno&quot; grazie a un bel duetto col mellotron che evidenzia anche l'accurata ricerca di particolari sonoritÃƒÂ  di cui ÃƒÂ¨ intriso tutto il long playing. Chiudono il tutto &quot;Il volo della paura&quot; (la cui introduzione ricorda la prima &quot;Era di Acquario&quot;) e un finale molto morbido che si commiata dall'ascoltatore nella piÃƒÂ¹ coerente delle maniere possibili. In sostanza, davvero un bel lavoro che perÃƒÂ², malgrado i grossi sforzi promozionali dal vivo (in cui alla batteria compariva invece Roberto Balocco degli ex-Capsicum Red) non riuscÃƒÂ¬ a decollare commercialmente, provocando lo scioglimento dei Procession che si riformeranno grazie al solo Munciguerra ben 32 anni dopo. Gianfranco Gaza entrerÃƒÂ  negli Arti e Mestieri nel 1975, Marcello Capra collaborerÃƒÂ  con Tito Schipa Jr nell'opera Orfeo 2000 e Giannotti si rifarÃƒÂ  vivo nel 1979 con l'album &quot;No Speed&quot; dei torinesi &quot;Combo Jazz&quot;. Comunque, a parte quei miglioramenti che avrebbero potuto portare la band a un terzo lavoro, era evidente che le sonoritÃƒÂ  semiacustiche e il linguaggio aulico di Fiaba non corrispondesse piÃƒÂ¹ alle necessitÃƒÂ  di un mondo giovanile alle porte di una crisi esistenziale.\n\nENGLISH\nAfter the debut album &quot;Frontiera&quot; released in 1972, Procession released their second album for the record label Fonit Cetra in 1974 with a different line up festuring original members Gianfranco Gaza (vocals) and Roby Munciguerra (guitars) plus Maurizio Gianotti (sax, flute) and Paolo D'Angelo (bass). In studio they were helped by some guests musicians like drummer Francesco Froggio Francica (Raccomandata Ricevuta Ritorno), keyboardist Ettore Vigo (Delirium) and vocalist Silvana Aliotta (Circus 2000). The result was excellent. The overall sound is less raw and aggressive if compared with the previous album and dreamy acoustic atmospheres prevail while lyrics by Marina Comin perfectly fit the music blending dreams and reality. The opener &quot;Uomini di vento&quot; (Men of wind) starts with a rhythm percussion pattern, then electric guitar comes in... &quot;The wind blows strongly by now / Men run away because they can't stand it...&quot;. Sax, flutes and vocals depict a world stormed by the wind where scared shadows are looking for a shelter. Reality and its hypocrisies are swept away... &quot;Un mondo sprecato&quot; (A wasted world) is more reflexive and darker and features good electric guitar and sax solos... &quot;I wasted a world trying to understand / But I don't know how to begin / Man, you look at me and you don't understand / I used to live like you / A bitter life like many others / But I made up my mind and now I know / You're laughing at a clown / That has stopped playing with the wind by now... You are laughing without asking yourself what this tale could mean...&quot;. On the long and complex &quot;C'era una volta&quot; (Once upon a time) the band try to explore the &quot;dark side of the moon&quot; and sax and vocals every now and again run after Pink Floyd's shadows... Lyrics are about a quest for true life: a child set off looking for the sense of life and when he thinks to have found it he realizes that he's old by now and that he has wasted his time... &quot;Notturno&quot; begins softly, with acoustic guitar and flute drawing a strange and unquiet dreamy atmosphere... &quot;A boat sails lightly on the see / There's a man on the edge / And the breeze wets his face / And the night gets darker / The man seems looking for life / But what is he looking for? He's not a fisherman... And the sea gets darker and darker / And the man leaves the edge / Now the boat is lighter...&quot;. &quot;Il volo della paura&quot; (The flight of fear) is another beautiful dreamy track. Lyrics depict a flock of seagulls that darken the sky. When they land all together the earth is shaken. Men that can't fly are scared and remain on their shaken world where there's only a wall left, so hard to climb... Just thousand wings and so much fear! The final title track &quot;Fiaba&quot; (Fairy tale) describes a village on top of a hill where live people refusing the rules of the world and enjoy their peace... I think that the inlay painting featuring classical and rock musicians climbing the hill describes this track better than words... An essential album for every Italianprog lover!\n(progarchives.com)","torrent":{"xt":"urn:btih:8e9128245c3b724445d734482ec7aca78ce20223","amp;dn":"Procession+-+Fiaba+%281974%29+%5BApe%2BCue%5D+Prog+Rock+%28TNTVillage%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e9128245c3b724445d734482ec7aca78ce20223","infoHashBuffer":{"type":"Buffer","data":[142,145,40,36,92,59,114,68,69,215,52,72,46,199,172,167,140,226,2,35]},"announce":[],"urlList":[]}}