{"title":"Kansas - Point Of Know Return (2nafish)","uid":5770907,"size":105840644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8f5e8fd9dbb0ffa61ec6d62b37bed4f139bc0803&amp;dn=Kansas+-+Point+Of+Know+Return+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282106094,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nPoint of Know Return is the fifth album by American rock band Kansas, released in 1977.\n\nThe huge success of Kansas's previous effort, Leftoverture, brought a new kind of pressure. While they were no longer desperately poor and starving for a hit, the band wondered whether they would be able build on, or at least maintain the level of achievement the years of recording and touring had brought them. The sessions for their follow-up LP, Point of Know Return, were filled with tension as singer/songwriter Steve Walsh, who had always been uncomfortable with the artistic direction of the band, left the group briefly. Years later, Walsh would admit in an interview with nationally-syndicated radio host Redbeard on the weekly rockumentary series In the Studio with Redbeard (edition #849, week of 9/27/04 and again on the 30th Anniversary Episode for Point of Know Return in 2007) that he had been something of a prima donna at this point. The other members of the group talked him into returning and the sessions continued. As with the previous album, it was a last-minute addition to the track line-up that would prove to be a huge success.\n\nKerry Livgren had been practicing with his acoustic guitar, working on a chord progression that he had written as a finger exercise. His wife, Vicci, happened to hear what he was doing and remarked that the melody was nice and that he should write lyrics for it. The result was a short song called Dust in the Wind. Again, Livgren was unsure as to whether his fellow band members would like it, since Kansas was not known for acoustic ballads. Needless to say, the song was recorded, securing Kansas's place in the annals of classic rock.\n\nThe album marked the commercial peak of the band in many ways. A subsequent tour brought them to the largest venues in the country, such as Madison Square Garden (which was sold out resulting in a second show at the newly constructed nearby Nassau Coliseum on Long Island) and the LA Forum (on New Year's Eve 1977). Marketing efforts were escalated at that point, including a tour book featuring an essay about the band by then Rolling Stone contributor Cameron Crowe. The band became a staple on FM radio at this point, and during this period was one of the most popular rock acts in the country.\n\nPoint of Know Return would be Kansas' highest charting album in the US, peaking at #4 in January 1978, and would sell four million copies in the US and be certified Quadruple Platinum by the RIAA.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8f5e8fd9dbb0ffa61ec6d62b37bed4f139bc0803","amp;dn":"Kansas+-+Point+Of+Know+Return+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f5e8fd9dbb0ffa61ec6d62b37bed4f139bc0803","infoHashBuffer":{"type":"Buffer","data":[143,94,143,217,219,176,255,166,30,198,214,43,55,190,212,241,57,188,8,3]},"announce":[],"urlList":[]}}