{"title":"Max Payne 2 Portable (with mods) - [Espera]","uid":6321706,"size":2533918835,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:905209f7e3f6d7d1389e0555a68a9815fc330fa9&amp;dn=Max+Payne+2+Portable+%28with+mods%29+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"060684","files":2,"time":1302914885,"description":"\n    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\n\nThis is a PORTABLE version of the game.\n\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Max Payne 2 - 1 Click.exe&quot;\n3.Enjoy a nice portable\n\n*Fully updated and cracked!\n*A lot of great mods to enhance your gameplay.\n*Absolutely no clutter!\n\n\nMax Payne 2: The Fall of Max Payne is a third-person shooter video game developed by the Finnish Remedy Entertainment and produced by 3D Realms. The game is a direct sequel to the 2001 video game Max Payne. It was released by Rockstar Games for Windows on October 15, 2003, for Xbox on November 25, 2003, and for PlayStation 2 on December 2, 2003. In Max Payne 2, the player controls Max, a detective for the New York City Police Department (NYPD). In the game's predecessor, Max Payne, the developers played all the roles other than Max. In Max Payne 2, however, professional actors were used to model and voice all the characters.\n\nMax Payne 2 continues the story of Max Payne, who was a fugitive undercover cop framed for murder in New York City at the end of Max Payne. Two years after the events of the first game, Max has cleared his name and is now an NYPD detective. He reunites with Mona Sax, who he first met in the previous game. Max meets his new NYPD partner, Valerie Winterson, who later tries to kill Mona because she is a fugitive and had stumbled upon secrets that were not meant for her to know. However, Max kills Winterson first, and he and Mona set out to resolve a conspiracy of death and betrayal, finding the mysterious Inner Circle in the center of it all.\n\nVideo game critics gave Max Payne 2 generally favorable reviews. Praise focused on its action and story, while criticism targeted its short length. Despite the positive reception, the game sold poorly, leading Rockstar Games' parent company Take-Two Interactive to cite Max Payne 2's sales as a cause for the company's reforecasted finances of 2004. Max Payne 2 received several industry awards, including Outstanding Art Direction at the Golden Satellite Awards 2004, and Editors' Choice Awards from GamePro, IGN, and GameSpy. ","torrent":{"xt":"urn:btih:905209f7e3f6d7d1389e0555a68a9815fc330fa9","amp;dn":"Max+Payne+2+Portable+%28with+mods%29+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"905209f7e3f6d7d1389e0555a68a9815fc330fa9","infoHashBuffer":{"type":"Buffer","data":[144,82,9,247,227,246,215,209,56,158,5,85,166,138,152,21,252,51,15,169]},"announce":[],"urlList":[]}}