{"title":"Bridge to Terabithia (2007) DVD NLT-Release","uid":5812515,"size":4680930035,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:906aa3693ed40da3e30b52bbfd53d942fcf15a21&amp;dn=Bridge+to+Terabithia+%282007%29+DVD+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1283699530,"description":"Bridge to Terabithia (2007) DVD NLT-Release\n\n\n[url=http://www.moviemeter.nl/film/38753]Moviemeter[/url]\nVerenigde Staten\nFamilie / Avontuur\n95 minuten\ngeregisseerd door Gabor Csupo\nmet Josh Hutcherson, AnnaSophia Robb en Lauren Clinton\n\nAvontuurlijke familiefilm waarin twee kinderen in een magisch woud hun eigen fantasiewereld creÃƒÂ«ren: Terabithia.\nLeslie Burke vindt het heerlijk om de meest fantastische verhalen aan haar vriendje Jess Aarons te vertellen. Jess op zijn beurt houdt erg van tekenen, maar voordat hij Leslie kende was er niemand aan wie hij dat liet zien. Zij opent een andere wereld voor hem, vol nieuwe ideeÃƒÂ«n en fantasieÃƒÂ«n. Samen bedenken ze het geheime koninkrijk Terabithia, een magische plek die je alleen kunt bereiken door met een touw over een smal beekje in het bos te slingeren. In dat land zijn zij heersers, vechten ze met de Dark Master en zijn handlangers en spannen ze samen tegen de pestkoppen op school. Het leven van Jess verandert voorgoed door deze bijzondere vriendschap. Maar staat hij hierdoor ook sterk genoeg om zich door een ernstig drama te slaan?\n\nDe avontuurlijke familiefilm Bridge to Terabithia is de verfilming van het bekroonde boek van Katherine Paterson, over twee kinderen die hun eigen fantasiewereld verzinnen. Deze door Disney geproduceerde film, werd geregisseerd door Gabor Csupo die samen met zijn ex-vrouw Arlene Klasky verantwoordelijk was voor cartoonseries als Rugrats ('Ratjetoe'), The Wild Thornberrys ('Expeditie Berenklauw') en &quot;Duckman&quot;. Csupo had dus voornamelijk ervaring op animatiegebied voordat hij met Bridge to Terabithia zijn live action regiedebuut maakte. Gelukkig kon hij rekenen op de steun van een aantal ervaren crewleden, die ook hadden meegewerkt aan de soortgelijke fantasyfilm The Chronicles of Narnia: The Lion, the Witch and the Wardrobe.\n\n[url=http://www.imdb.com/title/tt0398808/]IMDB[/url]\nUSA\nFamily / Adventure\n95 minutes\ndirected by Gabor Csupo\nwith Josh Hutcherson, AnnaSophia Robb and Lauren Clinton\n\nFamily adventure film in which two children in a magical forest to create their own fantasy world: Terabithia.\nLeslie Burke loves the most amazing stories to tell her boyfriend Jess Aarons. Jess, in turn, loves to draw, but before he knew Leslie was nobody to whom he showed. She opens a different world for him, full of new ideas and fantasies. Together they invent the secret kingdom of Terabithia, a magical place that can only be reached by a rope over a narrow stream in the woods swinging. In that country they are rulers, they fight the Dark Master and his henchmen and brought them together against the bullies at school. Life of Jess forever changed by this extraordinary friendship. But this also he is strong enough to beat a serious drama?\n\nThe adventurous family film Bridge to Terabithia is the adaptation of the award-winning book by Katherine Paterson, about two children who invent their own fantasy world. This Disney-produced film, directed by Gabor Csupo together with his ex-wife Arlene Klasky was responsible for shows like Rugrats cartoon (&quot;Rugrats&quot;), The Wild Thornberrys ('Expedition Hogweed &quot;) and&quot; Duckman &quot;. Csupo did so mainly in animation field experience prior to his Bridge to Terabithia his live action directorial debut made. Fortunately he could count on the support of a number of experienced crew members, who also had participated in the same fantasy film The Chronicles of Narnia: The Lion, the Witch and the Wardrobe.\n\nBron: Retail\nAudio: Engels DD 5.1\nOndertitels: Nederlands\nMenu: Ja\nExtra's: Ja\nmet dank en alle eer voor de kleine tovernares \nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Avontuur Familiefilm\n \nWeblink : http://www.film1.nl/films/21985-Bridge-to-Terabithia.html \n\n\nEnjoy the movie\n\nXX-Men","torrent":{"xt":"urn:btih:906aa3693ed40da3e30b52bbfd53d942fcf15a21","amp;dn":"Bridge+to+Terabithia+%282007%29+DVD+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906aa3693ed40da3e30b52bbfd53d942fcf15a21","infoHashBuffer":{"type":"Buffer","data":[144,106,163,105,62,212,13,163,227,11,82,187,253,83,217,66,252,241,90,33]},"announce":[],"urlList":[]}}