{"title":"Reggie Ashworth VidConvert v1.0.5MacOSX Incl.Keygen","uid":6467927,"size":6206183,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:917f757b67e1140ab2c064e0800581ce163ac5e1&amp;dn=Reggie+Ashworth+VidConvert+v1.0.5MacOSX+Incl.Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"adnan1102","files":-1,"time":1308030555,"description":"About:\n\nVidConvert is a simple, easy to use video converter designed to make converting your videos simple and easy. VidConvert will convert just about any type of video into one of the many popular formats of today. Creating videos for your iPhone or iPad, for your Mac or TV, or formats such as DivX and MPEG are just a click away with VidConvert! VidConvert uses MEncoder and other open source components for conversion purposes. VidConvert is easy!: Simply add a file, select a format and a quality, and click convert. No expertise in video conversion required. VidConvert couldn't be easier! Add to iTunes: VidConvert can add your converted videos straight to your iTunes library so all you have to do is click play and enjoy, or sync with your iDevice. It just works: Convert your videos for your iDevice, Mac, TV, non-Apple portable or computer or stand-alone player, or just to save space it's up to you.\n\nFeatures:\n\n-&gt; Multiple file formats:- VidConvert supports a plethora of file formats to make converting your videos simple and easy. The formats include .mp4, .mp3, .wav, Xvid, and more.\n-&gt; For every kind of user:- VidConvert is a very simple and easy to use, but at the same time is is extremely powerful and lets you tweak every little setting you could think of.\n-&gt; Straight to iTunes:- If you wish, VidConvert can export your converted videos straight to iTunes!\netc etc.....","torrent":{"xt":"urn:btih:917f757b67e1140ab2c064e0800581ce163ac5e1","amp;dn":"Reggie+Ashworth+VidConvert+v1.0.5MacOSX+Incl.Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"917f757b67e1140ab2c064e0800581ce163ac5e1","infoHashBuffer":{"type":"Buffer","data":[145,127,117,123,103,225,20,10,178,192,100,224,128,5,129,206,22,58,197,225]},"announce":[],"urlList":[]}}