{"title":"Making The Most Of The Micro","uid":6314602,"size":2580692546,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:92a935d11dea0311b58b9490731824ef3d3d80a4&amp;dn=Making+The+Most+Of+The+Micro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darrencaf","files":10,"time":1302657727,"description":"Making the Most of the Micro was a TV series broadcast in 1983 as part of the BBC's Computer Literacy Project. It followed the earlier series The Computer Programme. Unlike its predecessor, Making the Most of the Micro delved somewhat deeper into the technicalities and uses that microcomputers could be put to, once again mainly using the BBC Micro in the studio for demonstration purposes.\n\nPresenters\nIan McNaught-Davis (known as 'Mac') was once again the anchorman but Chris Serle and Gill Nevill were absent, instead various experts were brought in as required to demonstrate some of the more technical aspects of the microcomputers and their uses. John Coll was the main technical 'bod' (he had also written the User Guide for the BBC Micro along with other manuals) and Ian Trackman also featured - he wrote most of the software that was used for demonstrating certain features of the microcomputer, not only for this series but also The Computer Programme. and Computers in Control. The programme also featured location reports to demonstrate various practical and business uses of microcomputers.\n","torrent":{"xt":"urn:btih:92a935d11dea0311b58b9490731824ef3d3d80a4","amp;dn":"Making+The+Most+Of+The+Micro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92a935d11dea0311b58b9490731824ef3d3d80a4","infoHashBuffer":{"type":"Buffer","data":[146,169,53,209,29,234,3,17,181,139,148,144,115,24,36,239,61,61,128,164]},"announce":[],"urlList":[]}}