{"title":"STARGATE.SG-1.S07E05-08.SWESUB. -Lindoff.ISO","uid":5802806,"size":2996926464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94ce6ff42e915b2449ac97c0da1b041659b8c40b&amp;dn=STARGATE.SG-1.S07E05-08.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1283329372,"description":"\n\t\nSeason 7, Episode 5: Revisions\n\nOn a planet with an extremely toxic atmosphere, there exists a bubble within which \n\nexists a livable atmosphere. Inside the bubble lies a seemingly less advanced \n\nsociety of humans. They reveal to SG-1 that they once were highly industrialized \n\nand poisoned the air. They voluntarily simplified their lives and constructed the \n\nbarrier to keep out the bad air. They also show SG-1 their &quot;link&quot;, a neural \n\ninterface that gives them access to all their computer records, including history, \n\nscience, etc. When one of the citizens disappears in the night and the entire \n\npopulation forgets she existed, SG-1 begins to think things are not what they \n\nappear to be.\n\t\n\nSeason 7, Episode 6: Lifeboat\n\nWhile investigating a crashed ship, SG-1 finds hundreds of inhabited stasis pods. \n\nWhile doing a thorough count, they are all knocked unconscious by an alien force. \nWhen Teal'c wakes Dr. Jackson, Daniel is terrified of him. Upon returning to the \n\nSGC, Daniel insists upon getting back to the ship and appears to not know where he \n\nis nor who anyone else is.\n\t\n\n\nSeason 7, Episode 7: Enemy Mine\n\nAt a hopeful mining outpost for Naquadah a member of the survey team is kidnapped \n\nby an unknown foe. Based on mining artifacts, Daniel speculates that the creature \n\nmay have been an Unas. When Teal'c finds the missing man as part of a collection \n\nof corpses warning others away from the area, their suspicions appear to be \n\nconfirmed. Daniel brings Chaka to the planet to help negotiate with the leader of \n\nthe tribe of Unas.\n\t\n\n\nSeason 7, Episode 8: Space Race\n\nThe captain of the Serrakin prisoner transport ship Cerberus seeks Major Carter's \n\nhelp in winning a race and offers in exchange full access to their ion engine \n\ntechnology. He further explains that it is not through official channels and that \n\nthey will only learn what they pick up by helping him tune up his ship. Sam agrees \n\nto help and insists upon running the race with him. However, the competition for \n\nthis race is steep and there is no telling whether the team will be able to \n\nsurpass their rivals.","torrent":{"xt":"urn:btih:94ce6ff42e915b2449ac97c0da1b041659b8c40b","amp;dn":"STARGATE.SG-1.S07E05-08.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ce6ff42e915b2449ac97c0da1b041659b8c40b","infoHashBuffer":{"type":"Buffer","data":[148,206,111,244,46,145,91,36,73,172,151,192,218,27,4,22,89,184,196,11]},"announce":[],"urlList":[]}}