{"title":"Coast To Coast Am - 09-01-10 - Paranormal Creatures","uid":5808463,"size":55828005,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9545d72987df5959a27164a60670886bd2594ff1&amp;dn=Coast+To+Coast+Am+-+09-01-10+-+Paranormal+Creatures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1283533617,"description":"Date: 09-01-10 \n\n\nHost: George Noory \n\n\nGuests: Neil Arnold, Deena West Budd  \n\n\n\nIn the first half of the show, researcher Neil Arnold shared stories of paranormal creatures and events in London. The city is steeped with tales of monsters and folkloric accounts, many that date back centuries. In the 1800's, &quot;Spring Heeled Jack&quot; reportedly terrorized England. He was &quot;a kind of tall, spindly phantom that used to accost females...and tear their garments with iron-like claws and spit blue flame in their faces,&quot; before leaping away at great heights, Arnold detailed. In the 1960s, the Highgate Vampire, a tall dark figure with red eyes, was seen floating behind a wrought iron gate, and was said to haunt a cemetery. \n\nIn the 1700s, there were reports of a dragon-like creature seen flying over London, as well as strange phantom airships, he noted. There have also been spooky stories associated with London's Underground, including sightings of a bizarre hairy creature that resembled Bigfoot, and rumors of a subterranean race of cannibals &quot;feeding off tramps, and drunks, and rats,&quot; Arnold said. Some of the weird creatures and beings that people describe such as fairies, have folkloric qualities and each culture or religion creates their own version, he posited. \n\nIn the third hour, author Deena West Budd discussed various cryptozoological and unexplained creatures. Shadow People, dark amorphous entities, are particularly frightening because of the dread and fear they can instill in people, she noted. Detailing the 1955 case of the &quot;Kentucky Goblins,&quot; she described how people saw a light in the sky, and then small humanoid creatures began attacking their farmhouse. The &quot;goblins&quot; were 3-4 ft. tall with metallic skin that glowed, claws for hands, and a slit for a mouth. \n\nThe last hour of the show featured Open Lines, with people sharing frightening stories. \n\nWebsite(s): \n-bellaonline.com/site/Paranormal\nBook(s): \n-Paranormal London\n-Monster! - The A-Z OF Zooform Phenomena\n-The Weiser Field Guide to Cryptozoology\n","torrent":{"xt":"urn:btih:9545d72987df5959a27164a60670886bd2594ff1","amp;dn":"Coast+To+Coast+Am+-+09-01-10+-+Paranormal+Creatures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9545d72987df5959a27164a60670886bd2594ff1","infoHashBuffer":{"type":"Buffer","data":[149,69,215,41,135,223,89,89,162,113,100,166,6,112,136,107,210,89,79,241]},"announce":[],"urlList":[]}}