{"title":"Sea Of Bees - Songs For The Ravens (2010) [FLAC]","uid":5810567,"size":284711752,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:96761d06460d80e01dff255846a5a7d689c22431&amp;dn=Sea+Of+Bees+-+Songs+For+The+Ravens+%282010%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nightissuchproximity","files":12,"time":1283610350,"description":"Sea of Bees - Songs for the Ravens (2010)\nEAC Rip | FLAC (tracks cue log) | No scans | \nFolk | Label: Crossbill Records | 271 MB (RAR 4% Rec.) \n\n\nThe strength, innocence, honesty and purity of intention that flows throughout Sea of Bees' debut, Songs For the Ravens, manifests itself compositionally and technically - most immediately with the laser beam pull of Jules' captivating voice. She's so versatile, not only as a vocalist but as a songwriter, that Songs For The Ravens finds her masterfully navigating Americana-tinged stompers (Sidepain), heavy, trotting expanses (Marmalade), soaring harmonic rock sorrow (Wizbot) and keyboard-brightened musings (Willis). Aside from the drums and a few other instrumental lines, Jules wrote and played every single bit of the entire album - including handheld percussion, glockenspiel, guitar, bass, keys, marimba and slide. This is a record that will soothe your broken heart, commiserate with you when you're angry, befriend you when you're lonely and celebrate life with you through the pure joy of its being. Longing is expressed with hope; sadness with understanding. Its scope, intensity and solidity would be considered stunning for any weathered artist; it's simply astounding here.\n\nTracklisting:\n\n1. Gnomes\n2. Skinnybone\n3. Wizbot\n4. Fyre\n5. Marmalade\n6. Willis\n7. Won't Be Long\n8. Strikefoot\n9. The Gold\n10. Sidepain\n11. Blind\n\n\nIt's rare but sometimes we geek out for Americana. This is one of those delicate moments as Sea of Bees was too invading to the ear to ignore.\n\n Julie Ann Bee has a cool name. The acronym is J.A.B. Her last name is a sweet insect that gets wasted on pollen, in addition to being the prompt for her band's name. I don't know whether to imagine a sea of insects coming my way or a sea of Julie Ann Bee clones, either way I don't think I'd be able to supply enough flowers for the army.\n\nSea of Bees' Songs For The Ravens is a heavy album to ingest. Texturally splendid, the big finish is that, save for a few instrumental lines and the drums, Jules played all the instruments heard on her record; this includes handheld percussion, glockenspiel, guitar, bass, keys, marimba and slide. If her mountain of instruments still has you mean mugging the girl, you'll soften up quick when her pipes hit your ears. She's cutsey without going all bubblegum-Chairlift on us, which is emphasized by the vulnerability she exhibits on songs like &quot;Won't Be Long&quot; and &quot;Blind&quot;. Listening to Songs For The Ravens makes me less resistant to the label &quot;singer-songwriter,&quot; simply typing those words makes me cringe, but Julie Ann Bee soothes that grating screech in my skull. \n\n","torrent":{"xt":"urn:btih:96761d06460d80e01dff255846a5a7d689c22431","amp;dn":"Sea+Of+Bees+-+Songs+For+The+Ravens+%282010%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96761d06460d80e01dff255846a5a7d689c22431","infoHashBuffer":{"type":"Buffer","data":[150,118,29,6,70,13,128,224,29,255,37,88,70,165,167,214,137,194,36,49]},"announce":[],"urlList":[]}}