{"title":"Le Tour de France 2011 [PAL][Multi5][Spanish][Xbox360][www.conso","uid":6502633,"size":7350721875,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:9731120a1efe38da51db46ba67f231e6705d8052&amp;dn=Le+Tour+de+France+2011+%5BPAL%5D%5BMulti5%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.conso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":80,"time":1309302752,"description":"Experiencia de una temporada excepcional en la cabeza de uno de los  equipos oficiales en el ciclismo profesional Manager 2011. Este juego te  pone en el corazÃƒÂ³n de los mayores desafÃƒÂ­os de ciclismo como el Tour de  Francia o La Vuelta. Intervenir durante las carreras, guiando a su lÃƒÂ­der  y sus compaÃƒÂ±eros en medio de las etapas de intensa y llena de suspenso.  AdemÃƒÂ¡s de su componente de simulaciÃƒÂ³n impresionante, Pro Cycling  Manager te permite administrar la organizaciÃƒÂ³n de su equipo y las  finanzas de una sola raza o una temporada completa.\n\n De los modelos de su nueva HD ciclista a su configuraciÃƒÂ³n carrera  soberbia, rica y diversa, Pro Cycling Manager ofrece una experiencia de  juego mÃƒÂ¡s realista y bella que nunca! Componente del juego de gestiÃƒÂ³n  tambiÃƒÂ©n ha sido cuidadosamente diseÃƒÂ±ado. La interfaz de usuario ha sido  mejorado y ahora es mÃƒÂ¡s cÃƒÂ³modo de manejar, sin embargo, ofrece una mejor  interacciÃƒÂ³n con el equipo y los patrocinadores. La gestiÃƒÂ³n de  patrocinio es tambiÃƒÂ©n mÃƒÂ¡s rica en esta ocasiÃƒÂ³n. La nueva IA demuestra  reacciones mÃƒÂ¡s preciso y conduce a una simulaciÃƒÂ³n mÃƒÂ¡s avanzadas: el  comportamiento de manada, escapadas, los sprints ... nunca la raza sido  tan real! Para conocer todo sobre las nuevas caracterÃƒÂ­sticas de la  excepcional ediciÃƒÂ³n de 2011, le invitamos a descubrir en detalle en la  secciÃƒÂ³n de novedades.","torrent":{"xt":"urn:btih:9731120a1efe38da51db46ba67f231e6705d8052","amp;dn":"Le+Tour+de+France+2011+%5BPAL%5D%5BMulti5%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.conso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9731120a1efe38da51db46ba67f231e6705d8052","infoHashBuffer":{"type":"Buffer","data":[151,49,18,10,30,254,56,218,81,219,70,186,103,242,49,230,112,93,128,82]},"announce":[],"urlList":[]}}