{"title":"Hanna [BR-Screener][Spanish][www.consolasatope.com].avi","uid":6462342,"size":2374117376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:987ac217931e4e4b162b056cc60cb98437631aed&amp;dn=Hanna+%5BBR-Screener%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":1,"time":1307816719,"description":"Hanna (Saoirse Ronan) tiene 16 aÃƒÂ±os. Es brillante, curiosa y una devota hija. Excepcionalmente, tiene la fuerza y la energÃƒÂ­a de un soldado; esto se debe a que fue criada por su padre viudo, Erik (Eric Bana), un ex hombre de la CIA, en las salvajes tierras del norte de Finlandia. Erik ha enseÃƒÂ±ado a Hanna a cazar, le ha entrenado con un duro programa de autodefensa y le ha enseÃƒÂ±ado a leer y escribir con tan solo una enciclopedia y un libro de cuentos de hadas. Hanna ha vivido una vida muy diferente a la de cualquier otra adolescente; toda su educaciÃƒÂ³n y entrenamiento se reduce a un objetivo, convertirla en la perfecta asesina. Pero en el mundo real hay una cuenta pendiente con la familia de Hanna, y con una mezcla de orgullo paternal y temor Erik se da cuenta de que ya no puede retener mÃƒÂ¡s a su hija.\n\nEste momento crucial cambia bruscamente la adolescencia de Hanna; es separada de Erik y se embarca en la misiÃƒÂ³n para la que siempre ha estado destinada. Antes de que ella y su padre se reÃƒÂºnan en BerlÃƒÂ­n, tal y como lo tenÃƒÂ­an planeado, Hanna es capturada por unos agentes dirigidos por la despiadada agente de inteligencia Marissa Wiegler (la ganadora del OscarÃ‚Â®, Cate Blanchett). Marissa, una experimentada agente, oculta desde hace largo tiempo el secreto que le une a Hanna y Erik.\n\n","torrent":{"xt":"urn:btih:987ac217931e4e4b162b056cc60cb98437631aed","amp;dn":"Hanna+%5BBR-Screener%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987ac217931e4e4b162b056cc60cb98437631aed","infoHashBuffer":{"type":"Buffer","data":[152,122,194,23,147,30,78,75,22,43,5,108,198,12,185,132,55,99,26,237]},"announce":[],"urlList":[]}}