{"title":"POCALOID2 - VY1 (VOCALOID2) (VOCALOID)","uid":5817530,"size":193182061,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99743c9d8cc5ab687ba19f52d906d724cf6fbd3f&amp;dn=POCALOID2+-+VY1+%28VOCALOID2%29+%28VOCALOID%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rfliffle","files":47,"time":1283916344,"description":"About POCALOID\n\nPOCALOID is the ultimate hacked VOCALOID system by TEAM ASSiGN. Even if the vocal synthesis technology is a revolution of the software, its installations and systems are far from perfect. POCALOID was hacked and optimized for creators, the best way to use VOCALOID technology.\n\nThe advantage of POCALOID\n\nFixed from VOCALOID - Installation\n* Some softwares interrupt the installation (Don't happen in POCALOID)\n* Can't install/uninstall bug (Don't happen in POCALOID)\n* Misregistration of file (Fixed in POCALOID)\n* Wrong Version Installation (Don't happen in POCALOID)\n* Complicated and heavy installer (POCALOID installer is simple and light)\n* Problem with unused RegKey (POCALOID doesn't install/use these keys)\n* Problem with HDD capacity (Don't happen in POCALOID)\n\nFixed from VOCALOID - System\n\n* Number limited, and unstable C&amp;R protection (Removed in POCALOID)\n* Sensitive KeyFile (POCALOID2 Manager can rebuild this)\n* Sensitive RegKey (POCALOID2 was hacked to avoid those problems)\n* Worst TimeBomb which cause to Legal User too (Removed in POCALOID)\n* Some ReWire bugs (Fixed in POCALOID)\n\nPOCALOID Feature \n\n* Support POCALOID2 Plugin (Allow Fixer is now supported)\n* Installation checker and fixer\n* Registry cleaner\n* Voice Database Map manager\n* Simple and proper installation/uninstallation\n* Improved GUI\n* Additional English dictionary from Crypton\n* Run POCALOID2 Editor from ReWire Device\n\nFrequently asked questions\n\nQ: Can I use Japanese Singer in English?\nA: Yes you can. Details on our POCALOID2 Manager manual with a picture.\n\nQ: Can POCALOID2 exist with legal VOCALOID2?\nA: Yes it can, but not recommended.\n\nQ: Does VOCALOID2 Library work in POCALOID2?\nA: No it doesn't. POCALOID can read our POCALOID libraries only.\n\nQ: Your previous English VOCALOID Editor was half translated!\nA: This version would satisfy you!\n\nNote from uploader of torrent:\nOnce again, here you go. Initial seeding, once again, may be slow. Be patient, please! VY1 is also mistakenly called MIZKI (as it was her code name in reference to &quot;hanamizuki&quot;).\n\nFor the people who only want VY1 with POCALOID, I have also included the POCALOID2 Manager/VSTi/Library/etc. Feel free to not download them if you already have them. You do not need to install them again. If this is your first time with POCALOID, read the readme, please. This is most important.\n\nOnce again, only download the voices you want. And remember to seed, please!\n\nVoices inside this torrent:\nVY1\n\nRegarding Tonio, ASSiGN currently does not have their hands on him due to needing money; please support them and get them a copy!\n\nIf you wish to use a torrent that has all of the VOCALOID2 voices from Hatsune Miku to SF-A2 miki, please visit http://thepiratebay.se/torrent/5267010/.\nIf you wish to use a torrent that has all of the Hatsune Miku Append voices, please visit http://thepiratebay.se/torrent/5565206/.\nIf you wish to use a torrent that has Lily, please visit http://thepiratebay.se/torrent/5748800/.\nIf you wish to use a torrent that has Big-Al, please visit http://thepiratebay.se/torrent/5778774/.\n","torrent":{"xt":"urn:btih:99743c9d8cc5ab687ba19f52d906d724cf6fbd3f","amp;dn":"POCALOID2+-+VY1+%28VOCALOID2%29+%28VOCALOID%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99743c9d8cc5ab687ba19f52d906d724cf6fbd3f","infoHashBuffer":{"type":"Buffer","data":[153,116,60,157,140,197,171,104,123,161,159,82,217,6,215,36,207,111,189,63]},"announce":[],"urlList":[]}}