{"title":"Metroid Other M [DVD5][Proper][NTSC][Multi5][Spanish][www.consol","uid":5801415,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:9a3979c473257b237600100d0bee51b492014e7e&amp;dn=Metroid+Other+M+%5BDVD5%5D%5BProper%5D%5BNTSC%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":3,"time":1283270201,"description":"\nDurante dÃƒÂ©cadas Samus Aran ha sido una de las pocas heroÃƒÂ­nas protagonista de un videojuego, y una de las mÃƒÂ¡s enigmÃƒÂ¡ticas. Por primera vez conoceremos la historia de esta solitaria caza recompensas, su historia personal, sus sentimientos y motivaciones.\nMetroid Other M, toma los mejores elementos de los juegos en primera y tercera persona para crear un juego ÃƒÂºnico, donde la jugabilidad, la historia y las escenas cinemÃƒÂ¡ticas te llevan a sentir que controlas una pelÃƒÂ­cula.\nLos fans de Metroid conocen mÃƒÂ¡s sobre los trajes y armas de Samus que de la historia que ha llevado a Samus a ser lo que es, y esto va a cambiar.\nLa historia comienza inmediatamente despuÃƒÂ©s de los acontecimientos de Super Metroid, cuando un bebÃƒÂ© Metroid dio su vida para proteger Samus. Ahora conoceremos una historia rica en detalles de la vida errante de nuestra heroÃƒÂ­na, Samus encontrarÃƒÂ¡ a su primer mentor y oficial al a mando de la federaciÃƒÂ³n galÃƒÂ¡ctica, Adan Malkovich.\n\nCaracterÃƒÂ­sticas:\nÃ‚Â· Descubre por primera vez la historia completa de Metroid Other M, muestra informaciÃƒÂ³n del pasado de Samus Aran, sobre su vida y personajes de su pasado.\nÃ‚Â· Nuevo control mÃƒÂ¡s accesible y versÃƒÂ¡til, ahora coges el mando horizontalmente, tipo NES, para jugar en modo 3Ã‚Âª persona, pero cuando lo apuntas a la pantalla pasas al modo acciÃƒÂ³n en primera persona.\nÃ‚Â· Cambia la perspectiva de la cÃƒÂ¡mara cuando quieras: apunta a la pantalla para pasar de una vista en tercera persona a primera persona.\nÃ‚Â· Incluye mas de una hora de escenas cinemÃƒÂ¡ticas que te permiten entender toda la trama a la vez que juegas.\nÃ‚Â· Nuevas habilidades como Overblast y ConcentraciÃƒÂ³n amplÃƒÂ­an el repertorio de movimientos de Samus.\nÃ‚Â· Incluye contenido adicional al terminar el juego","torrent":{"xt":"urn:btih:9a3979c473257b237600100d0bee51b492014e7e","amp;dn":"Metroid+Other+M+%5BDVD5%5D%5BProper%5D%5BNTSC%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3979c473257b237600100d0bee51b492014e7e","infoHashBuffer":{"type":"Buffer","data":[154,57,121,196,115,37,123,35,118,0,16,13,11,238,81,180,146,1,78,126]},"announce":[],"urlList":[]}}