{"title":"Michael Caine -- The Elephant to Hollywood 2010 [Audiobook]","uid":6499970,"size":297549323,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9bd5a5efba51bcede5f02c465acce013b70390a0&amp;dn=Michael+Caine+--+The+Elephant+to+Hollywood+2010+%5BAudiobook%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nisse20062007","files":11,"time":1309212821,"description":"LENGTH\n10 hrs and 18 mins\n\nCharming, engaging, and surprisingly forthright, Michael Caine gives us his insider's view of Hollywood and the story of his brilliant second act\n\nWhen he was in his late fifties, Michael Caine believed his glamorous, rags-to-riches Hollywood career had come to an end. The scripts being sent his way were worse and worse. When one script really disappointed, he called the producer to complain about the part. The producer said, &quot;No, no, we don't want you for the lover, we want you for the father.&quot; Salvation came in the unlikely form of his old friend Jack Nicholson, who convinced him to give acting one more shot. What followed was not only an incredible personal transformation but also one of the most radical comebacks in film history. Learning to accept his new role both on camera and in his own life, Caine went on to win his second Oscar, be knighted by the queen, and deliver some of his best performances to date. Now he shares the spectacular story of his life, from his humble upbringing in London's poverty-stricken Elephant and Castle, his military service, touching marriage and family life, and lively adventures with friends, to legendary meetings with fellow stars, forays as a restaurateur, and hilarious off-screen encounters from his glittering five-decade career. Caine brings his gift for storytelling and his insider's view to a tale that is funny, warm, and deeply honest.\t","torrent":{"xt":"urn:btih:9bd5a5efba51bcede5f02c465acce013b70390a0","amp;dn":"Michael+Caine+--+The+Elephant+to+Hollywood+2010+%5BAudiobook%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bd5a5efba51bcede5f02c465acce013b70390a0","infoHashBuffer":{"type":"Buffer","data":[155,213,165,239,186,81,188,237,229,240,44,70,90,204,224,19,183,3,144,160]},"announce":[],"urlList":[]}}