{"title":"AIR CLIMBER","uid":6371551,"size":8043126240,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9c6145346936a2cb78c1624591639c7a8e8dfe10&amp;dn=AIR+CLIMBER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Falcon_eddy","files":15,"time":1304693573,"description":"  \n\nAir Climber ÃƒÂ© a maneira mais fÃƒÂ¡cil e divertida de perder peso e modelar o corpo enquanto vocÃƒÂª queima calorias! E se ele jÃƒÂ¡ era o jeito mais fÃƒÂ¡cil e divertido de queimar calorias se prepare porque ele estÃƒÂ¡ ainda mais poderoso!\n\nAir Climber Power System ÃƒÂ© um sistema completo para vocÃƒÂª perder peso, conquistar um corpo atraente e transbordar saÃƒÂºde, de um jeito fÃƒÂ¡cil e muito divertido! Tenha pernas torneadas, bumbum durinho, curvas perfeitas, barriga lisinha e o abdÃƒÂ´men definido que sempre sonhou!\n\nAir Climber Power System foi desenvolvido pelos maiores experts em fitness do paÃƒÂ­s e transforma seu Air Climber em uma poderosa mÃƒÂ¡quina de resultados!\n\n- Abuse de shorts e saias mais curta sem medo, com a aula Bun &amp; Thigh Sexy!\n\n- Afina a cintura e seque o abdÃƒÂ´men com a aula Extreme Abs!\n\n- Defina braÃƒÂ§os, costas e peito com os movimentos da aula Powerful Body!\n\n- Ganhe resistÃƒÂªncia e forÃƒÂ§a com os mais incrÃƒÂ­veis golpes de artes marciais com a aula Combat!\n\n- Tenha mais equilÃƒÂ­brio, flexibilidade e energia com a aula Life &amp; Health!\n\n- Para condicionar o corpo inteiro em uma hora de pura diversÃƒÂ£o e movimento com a aula Happy Hour Training!\n\nO segredo de Air Climber estÃƒÂ¡ na sua exclusiva tecnologia Air Flow: O ar flui entre as duas cÃƒÂ¢maras blindadas, que impulsionam as pernas, aceleram a queima de gorduras e tonificam os mÃƒÂºsculos num movimento constante, ritmado e muito fÃƒÂ¡cil de fazer, sem nenhum impacto para as articulaÃƒÂ§ÃƒÂµes!\n\nVocÃƒÂª ainda recebe as incrÃƒÂ­veis Bodycords que trabalham a parte superior do corpo com uma variedade incrÃƒÂ­vel de exercÃƒÂ­cios! Ganhe braÃƒÂ§os fortes, costas definidas e um peitoral de causar inveja! SÃƒÂ£o 6 aulas em DVD especialmente criados para vocÃƒÂª perder peso e conquistar o corpo que vocÃƒÂª sempre quis!\n\nAir Climber chega completamente montado, basta pressionar o disco para inflar e comeÃƒÂ§ar a ver os resultados. Seu exclusivo computador de treinamento monitora o tempo de exercÃƒÂ­cio, nÃƒÂºmero de passos e mostra na hora quantas calorias vocÃƒÂª perdeu!\n\nAir Climber Power System ÃƒÂ© uma exclusividade Polishop!","torrent":{"xt":"urn:btih:9c6145346936a2cb78c1624591639c7a8e8dfe10","amp;dn":"AIR+CLIMBER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c6145346936a2cb78c1624591639c7a8e8dfe10","infoHashBuffer":{"type":"Buffer","data":[156,97,69,52,105,54,162,203,120,193,98,69,145,99,156,122,142,141,254,16]},"announce":[],"urlList":[]}}