{"title":"Ocean's 11, 12, + 13","uid":5806326,"size":22271682560,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9d8d32917c6fac49db04fb67d51a9f35300f2652&amp;dn=Ocean%5C%27s+11%2C+12%2C+%2B+13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Roodpart","files":54,"time":1283458755,"description":"Ocean\\'s 11\n\nOcean\\'s Eleven is a 2001 crime comedy film and remake of the 1960 Rat Pack caper film of the same name. The 2001 film was directed by Steven Soderbergh and features an ensemble cast including George Clooney, Brad Pitt, Matt Damon, Don Cheadle, Andy Garcia, and Julia Roberts. The film was a success at the box office and with critics. Soderbergh directed two sequels, Ocean\\'s Twelve in 2004 and Ocean\\'s Thirteen in 2007. George Clooney stated in November 2007 that there will not be any additional sequels.\n\nOcean\\'s 12\n\nOcean\\'s Twelve is a 2004 American crime comedy film, the sequel of Ocean\\'s Eleven from 2001. Like its predecessor, which was a remake of the 1960 film of the same name, the film used a celebrity ensemble cast. The film was released in the United States on December 10, 2004. The sequel, Ocean\\'s Thirteen, was released on June 8, 2007 in the United States. The film starred George Clooney, Brad Pitt, Matt Damon, Catherine Zeta-Jones, Andy GarcÃƒÂ­a, Julia Roberts, Don Cheadle, Bernie Mac and others.\n\nOcean\\'s 13\n\nOcean\\'s Thirteen is a 2007 crime comedy film directed by Steven Soderbergh and starring an ensemble cast. It is the third and final film[1] in the Soderbergh series following the 2004 sequel Ocean\\'s Twelve and the 2001 film Ocean\\'s Eleven, which itself was a remake of the 1960 Rat Pack film of the same name. All of the cast members reprised their roles from the previous installments except for Julia Roberts and Catherine Zeta-Jones. Al Pacino and Ellen Barkin joined the cast as their new targets.","torrent":{"xt":"urn:btih:9d8d32917c6fac49db04fb67d51a9f35300f2652","amp;dn":"Ocean%5C%27s+11%2C+12%2C+%2B+13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d8d32917c6fac49db04fb67d51a9f35300f2652","infoHashBuffer":{"type":"Buffer","data":[157,141,50,145,124,111,172,73,219,4,251,103,213,26,159,53,48,15,38,82]},"announce":[],"urlList":[]}}