{"title":"WinRAR v4.01 Beta 1 x86-x64 Incl. Keygen","uid":6383052,"size":3378914,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d940ecabc40d24b9639120c16f53f02213612d1&amp;dn=WinRAR+v4.01+Beta+1+x86-x64+Incl.+Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"adnan1102","files":-1,"time":1305100846,"description":"About:\n\nThe WinRAR application was developed to be a powerful compression tool with many integrated additional functions to help you organize your compressed archives. WinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disc space, transmission costs AND valuable working time as well. WinRAR supports all popular compression formats (RAR, ZIP, CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip). WinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries particularly well.\n\nFeatures:\n- WinRAR introduces an original compression algorithm. It provides high compression ratios on executable files, object libraries, large text files, etc.\n- WinRAR offers an optional compression algorithm highly optimized for multimedia data.\n- WinRAR supports files and archives up to 9,223,372,036,854,775,807 bytes in size, about 9000PB. The number of archived files is unlimited for all practical purposes.\n- WinRAR provides complete support for RAR and ZIP 2.0 archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, Z, 7Z archives.\n- WinRAR supports NTFS file security and data streams.\n- WinRAR offers both a classic interactive Windows interface and the command line interface.","torrent":{"xt":"urn:btih:9d940ecabc40d24b9639120c16f53f02213612d1","amp;dn":"WinRAR+v4.01+Beta+1+x86-x64+Incl.+Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d940ecabc40d24b9639120c16f53f02213612d1","infoHashBuffer":{"type":"Buffer","data":[157,148,14,202,188,64,210,75,150,57,18,12,22,245,63,2,33,54,18,209]},"announce":[],"urlList":[]}}