{"title":"Goat_Horn-Discography-SCENE","uid":6314541,"size":154141293,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9de77b6a078259fe576bc512c6a414ec96fd93df&amp;dn=Goat_Horn-Discography-SCENE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lesty","files":37,"time":1302655966,"description":"Goat Horn was a heavy metal band founded in Pembroke, Ontario, Canada in late 1999. The band was composed of Jason Decay (lead vocal / bass), Brandon Wars (guitar) and Steel Rider (drums). Decay, Wars, and Rider had all been in and out of bands on the local scene before forming Goat Horn. What began as a jam of Cathedral and Judas Priest covers quickly developed into a serious project. Their music was influenced by ground-breaking metal bands such as Venom, Raven, Eudoxis (Canadian thrash metal pioneers), and Celtic Frost.\n\nWith the release of their 2001 debut, Voyage To Nowhere, Goat Horn became the main focus and priority of each member's musical endeavors. This album was recorded in a one-day session in February 2001. In September 2001, they relocated to Toronto in order to gain more exposure. The majority of 2002 was spent touring Ontario, Quebec and the northern United States.\n\nDuring the winter of 2003, the band re-entered the studio to prepare their second release. In June 2003, Storming The Gates was released. The band's last album was entitled Threatening Force, and it was released in 2005. Goat Horn disbanded in 2006. Since its break-up, Jason Decay has continued his heavy metal vision with his new band Cauldron, using demos he recorded for Goat Horn's fourth release as the basis of his new band's material. Decay has also joined long-time friends from the Toronto punk-metal band, KÃƒÂ¯ll CheerleadÃƒÂ«r. Brandon Wars has formed Zuku, with the drummer from KÃƒÂ¯ll CheerleadÃƒÂ«r, Kriss Rites. Kill Cheerleader broke up that same year.\n\n\n    Discography\n\n    2001 Voyage to Nowhere - Goat_Horn-Voyage_From_Nowhere-2001-BUTT\n    2003 Storming The Gates - Goat_Horn-Storming_The_Gates-2003-BUTT\n    2005 Threatening Force - Goat_Horn-Threatening_Force-(EP)-2005-MTD\n","torrent":{"xt":"urn:btih:9de77b6a078259fe576bc512c6a414ec96fd93df","amp;dn":"Goat_Horn-Discography-SCENE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de77b6a078259fe576bc512c6a414ec96fd93df","infoHashBuffer":{"type":"Buffer","data":[157,231,123,106,7,130,89,254,87,107,197,18,198,164,20,236,150,253,147,223]},"announce":[],"urlList":[]}}