{"title":"Star.Trek.VI.The.Undiscovered.Country.1991.1080p.BluRay.DTS.x264","uid":5756123,"size":9436443386,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9ea738459b851723b5d4546274ffc9e918ab90a0&amp;dn=Star.Trek.VI.The.Undiscovered.Country.1991.1080p.BluRay.DTS.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"avalonbss","files":-1,"time":1281567436,"description":"Star Trek VI: The Undiscovered Country\n\nGenre: Action, Mystery, Sci-Fi, Thriller\nYear: 1991\nCountry: USA\nRuntime: 113 min\nDirector: Nicholas Meyer\nCast: William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, Walter Koenig, Nichelle Nichols, George Takei\n\n.: Plot :.\nIt's all for one and one for all as the Kirk and the crew of Enterprise-A set course for the stars in their final adventure. The Klingon Empire has been one of the Federation's deadliest enemies for nearly a century. All of that changes when their key energy production facility, the moon Praxis, explodes, damaging the Klingon home world's atmosphere and meaning that all ozone will be depleted in 50 years. Unable to the cope with this disaster due to their massive military expenditures, the Empire seeks peace talks with the Federation in order to receive aid. Kirk however is opposed to the peace talks; it has been eight years since his son David was killed at the Genesis planet and he has never been able to forgive the Klingons for it. But he is a Starfleet officer and must escort Kronos One, the ship carrying Klingon Chancellor Gorkon, to Earth. But while en route, Kronos One is fired upon and Gorkon is assassinated. All evidence points to the Enterprise-A as the source of the photon torpedoes and Kirk and McCoy as the assassins, who are subsequently arrested, tried, and sentenced to life at the gulag Rura Penthe. But Spock is certain that Kirk and the Enterprise-A have been framed and with the aid of senior staff as well as help from Sulu, now captain of the Excelsior, set out to clear Kirk's name and cement a lasting peace between the United Federation of Planets and the Klingon Empire before all is too late.","torrent":{"xt":"urn:btih:9ea738459b851723b5d4546274ffc9e918ab90a0","amp;dn":"Star.Trek.VI.The.Undiscovered.Country.1991.1080p.BluRay.DTS.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ea738459b851723b5d4546274ffc9e918ab90a0","infoHashBuffer":{"type":"Buffer","data":[158,167,56,69,155,133,23,35,181,212,84,98,116,255,201,233,24,171,144,160]},"announce":[],"urlList":[]}}