{"title":"[PDF] [2010] The Filioque History of a Doctrinal Controversy (Ox","uid":6464570,"size":11285555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f1f2d7f33ea4d6e629455161397ac13a680243e&amp;dn=%5BPDF%5D+%5B2010%5D+The+Filioque+History+of+a+Doctrinal+Controversy+%28Ox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lyndavilla","files":2,"time":1307916228,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n   &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nAmong the issues that have divided Eastern and Western Christians throughout the centuries, few have had as long and interesting a history as the question of the filioque. Christians everywhere confess their faith in the ancient words of the Nicene Creed. But rather than serve as a source of unity, the Creed has been one of the chief sources of division, as East and West profess their faith in the Trinitarian God using different language. In the Orthodox East, the faithful profess their belief in &quot;the Holy Spirit, who proceeds from the Father.&quot; In the West, however, they say they believe in the Holy Spirit, who proceeds from the Father &quot;and the Son&quot;-in Latin &quot;filioque.&quot; For over a millennium Christendom's greatest minds have addressed and debated the question (sometimes in rather polemical terms) in the belief that the theological issues at stake were central to an orthodox understanding of the trinitarian God. To most modern people, this may seem like a trivial matter, and indeed most ordinary Christians would be hard pressed to explain the doctrine behind this phrase. In the history of Christianity, however, these words have played an immense role, and the story behind them deserves to be told. For to tell the story of the filioque is to tell of the rise and fall of empires, of crusades launched and repelled, of holy men willing to die for the faith, and of worldly men willing to use it for their own political ends. It is, perhaps, one of the most interesting stories in all of Christendom, filled with characters and events that would make even the best dramatists envious.The Filioque: History of a Doctrinal Controversy is the first complete English language history of the filioque written in over a century. Beginning with the biblical texts and ending with recent agreements on the place and meaning of the filioque, this book traces the history of the doctrine and the controversy that has surrounded it. From the Greek and Latin fathers, the ninth-century debates, the Councils of Lyons and Ferrara-Florence, to the twentieth- and twenty-first century-theologians and dialogues that have come closer than ever to solving this thorny problem, Edward Siecienski explores the strange and fascinating history behind one of the greatest ecumenical rifts in Christendom.\n\n \n\nContents\n\nIntroduction, 3\n1. The Procession of the Holy Spirit in the New Testament, '7\n2. The Greek Fathers, 33\n3Ã‚Â· The Latin West, 51\n4Ã‚Â· Maximus the Confessor, 73\n5Ã‚Â· The Filioque from the Seventh to the Eleventh Century, 87\n6. The Filioque from the Eleventh to the Thirteenth Century, III\n7Ã‚Â· The Council of Lyons to the Eve of Ferrara-Florence, 133\n8. The Council of Ferrara-Florence (1438-39), 151\n9Ã‚Â· From Florence to the Modern Era, 173\n10. The Twentieth and Twenty-first Centuries, 193\n\nEpilogue, 215\n\nNotes, 217\n\nBibliography, 309","torrent":{"xt":"urn:btih:9f1f2d7f33ea4d6e629455161397ac13a680243e","amp;dn":"%5BPDF%5D+%5B2010%5D+The+Filioque+History+of+a+Doctrinal+Controversy+%28Ox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f1f2d7f33ea4d6e629455161397ac13a680243e","infoHashBuffer":{"type":"Buffer","data":[159,31,45,127,51,234,77,110,98,148,85,22,19,151,172,19,166,128,36,62]},"announce":[],"urlList":[]}}