{"title":"Mongrels Season 1 complete [BBC 3 ADULT]","uid":6319957,"size":6434284609,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9f659b47423ddc39867c8bed720c9c80d7337868&amp;dn=Mongrels+Season+1+complete+%5BBBC+3+ADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smexyfox","files":9,"time":1302917269,"description":"Mongrels is BBC Three\\'s first adult puppet comedy. It tells the tale of a group of urban animals who hang out together an inner-city backyard.\n\nThe sitcom follows the day-to-day lives, trials and tribulations of Nelson, a metrosexual fox; Destiny, a pretentious pedigree \\'it-bitch\\'; Kali, a deeply cynical pigeon; Marion, an abandoned tom cat; and Vince, a streetwise geezer fox. They are kidults struggling with the everyday drama of life in the back-alleys of the urban jungle.\n\nMongrels is bold, mischievous, upbeat, surprising and colourful. It encompasses all human life, love and its contradictions - relationships, sex, aspirations, desperations and shattered dreams. The show also features cut-aways and flashbacks (a bit like Family Guy), musical songs and cameo appearances.\n\nBe warned: contrary to appearances, this isn\\'t a comedy for kids - and perhaps not for some adults either! It\\'s got some rude words in it, lots of death, some close-to-the-bone jokes and other such things that stop it from ever approaching PG territory. For example: the first episode starts with a cat giving mouth-to-mouth to a dead granny. LOL\n\nAll in all this is truly a funny laugh out loud show! Give it a try and I\\'m sure it will make your day.","torrent":{"xt":"urn:btih:9f659b47423ddc39867c8bed720c9c80d7337868","amp;dn":"Mongrels+Season+1+complete+%5BBBC+3+ADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f659b47423ddc39867c8bed720c9c80d7337868","infoHashBuffer":{"type":"Buffer","data":[159,101,155,71,66,61,220,57,134,124,139,237,114,12,156,128,215,51,120,104]},"announce":[],"urlList":[]}}