{"title":"Weymouth:Through The Ages","uid":6461000,"size":715062272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9fa6f53605902447715f6ffd9684fd11a3733792&amp;dn=Weymouth%3AThrough+The+Ages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"adambeef","files":1,"time":1307769389,"description":"This is the story of how Weymouth, an important harbour since the 14th Century, became one of the most popular seaside resorts in the country.\n\nHistoric photographs and illustrations blend with stunning modern film to create a fascinating portrayal of this much-loved Dorset town.\n\nWeymouthÃ‚Â´s story has a macabre edge to it: in 1348 the dreaded bubonic plague, known today as the Black Death, entered the country when an infected sailor stepped ashore on the harbourside. In 1588, as England defended her shores against the Spanish Armada, the San Salvador was captured off Portland and gleefully looted by the locals.\n\nWeymouthÃ‚Â´s popularity as a seaside resort was enhanced dramatically from 1789 onwards, when King George III frequently visited to bathe in the gentle waters of the bay. You will also re-live the history of OsmingtonÃ‚Â´s famous White Horse, the Roman Villa at Preston and the airfield that once stood on the nature reserve at Lodmoor.\n\nWeymouth suffered greatly in World War II, as devastating air raids destroyed much of the Chapelhay district, yet the town went on to play a key role in the path to final victory. In 1944 many thousands of American troops embarked from the harbour for the D-Day landings on the Normandy beaches. ","torrent":{"xt":"urn:btih:9fa6f53605902447715f6ffd9684fd11a3733792","amp;dn":"Weymouth%3AThrough+The+Ages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fa6f53605902447715f6ffd9684fd11a3733792","infoHashBuffer":{"type":"Buffer","data":[159,166,245,54,5,144,36,71,113,95,111,253,150,132,253,17,163,115,55,146]},"announce":[],"urlList":[]}}