{"title":"Dresden: Tuesday, February 13, 1945","uid":5810641,"size":11137057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a06df75d054922988d0400adb69b3f0ac390120d&amp;dn=Dresden%3A+Tuesday%2C+February+13%2C+1945&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Djofullinn","files":1,"time":1283613572,"description":"From Publishers Weekly\nThe allied bombing of Dresden created a massive fire that swept the city center, killing thousands of people and destroying its medieval heart. Debate began almost immediately: Was the destruction of this seemingly civilian city necessary militarily, or was it, some asked, equivalent to a war crime? Not just another in an endless parade of books on Dresden, Taylor's account may go a long way toward putting such questions to rest. It opens with the start, by British bombers, of the nighttime attack, and immediately turns to the past, meandering through several centuries of Dresden history, from its founding in the Middle Ages to the 20th century and the rise of the Nazis. Taylor, translator of The Goebbels Diaries, also covers the history of aerial bombardment and its international laws; gives glimpses of life under the Nazi regime; details the Allied bombing campaign against Germany; and, most excitingly, puts forth new information concerning Dresden's part in the German war effort, which turns out to be much greater than postwar information generally portrays. Five chapters of 30 describe the actual bombing of the city by the British and American air forces, and they do so effectively, weaving first-person accounts of the aircrews with those of the terrified German soldiers and civilians. The aftermath of the raid is concisely dealt with, in the process correcting common perception about the numbers actually killed (approximately 25,000, not up to 250,000, as often cited), and he offers a review of the postwar debate on the morality of the bombing. An afterword describes the author's experience at a recent ceremony for the dead of Dresden, and further corrects some longstanding misinformation that includes the alleged strafing of civilians by American aircraft. Taylor has used a variety of German, as well as Allied, sources to write an account not previously accomplished to this extent in English.\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to an out of print or unavailable edition of this title.\n &lt;a href=&quot;\nhttp://www.amazon.com/Dresden-Tuesday-February-13-1945/dp/0060006773/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1283606096&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Dresden-Tuesday-February-13-1945/dp/0060006773/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1283606096&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:a06df75d054922988d0400adb69b3f0ac390120d","amp;dn":"Dresden%3A+Tuesday%2C+February+13%2C+1945","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a06df75d054922988d0400adb69b3f0ac390120d","infoHashBuffer":{"type":"Buffer","data":[160,109,247,93,5,73,34,152,141,4,0,173,182,155,63,10,195,144,18,13]},"announce":[],"urlList":[]}}