{"title":"Fleximage DVD-to-MPEG CD Converter v4.50 Build 809","uid":5777639,"size":3814151,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a141d0fead9c96757c56af68d1a71c44688372fc&amp;dn=Fleximage+DVD-to-MPEG+CD+Converter+v4.50+Build+809&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1282314651,"description":"      Fleximage DVD-to-MPG Converter v4.50 Build 809 | 3,63 Mb\n\n\nFleximage DVD to MPEG Converter is powerful, convenient and high-efficient software to convert DVD to MPEG1 or MPEG2. It is easy to use, fast in speed, excellent in quality and reasonable in price. And the publisher offers excellent after-sale service that ensures the convenience and joy for all users in using the software. \nThe most important thing is, it is super easy to use, which is beyond your imagination. No matter whether you are a beginner or a veteran, you will feel it's developed JUST for you! In one word, choosing Fleximage DVD to MPEG Converter means opening the door of enjoying your multimedia life! \n\nFeatures: \n1. Easy to use. It is so super easy to use that beyond your imagination. You can handle all settings and properties quite easily in one interface. \n2. High speed. Fleximage DVD to MPEG Converter can check your CPU type automatically, which ensures that you can rip your DVDs with the best ripping speed. With Fleximage DVD to MPEG Converter conversion isn't time-consuming work any more! \n3. Add the function of setting the video and audio Bitrate (Kbit/s) of MPEG \n4. Brand-new DVD decryptor. Includes the CSS decryptor, also supports more encrypted DVD movies. \n5. High quality. Excellent image and sound quality provided. \n6. Excellent compatibility. Support a variety of DVD movies, as well as PAL and NTSL. \n7. Customized screen size. The output screen size is adjustable. You can compress movies to any size you need. \n8. Space-saving. 750MB is enough for a two-hour DVD Movie. \n9. Support chapter choosing and previewing. \n\nOS: Windows 2000/XP/Vista/7 \n","torrent":{"xt":"urn:btih:a141d0fead9c96757c56af68d1a71c44688372fc","amp;dn":"Fleximage+DVD-to-MPEG+CD+Converter+v4.50+Build+809","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a141d0fead9c96757c56af68d1a71c44688372fc","infoHashBuffer":{"type":"Buffer","data":[161,65,208,254,173,156,150,117,124,86,175,104,209,167,28,68,104,131,114,252]},"announce":[],"urlList":[]}}