{"title":"(Blues) Peg Leg Sam - Joshua (Feat. Louisiana Red)","uid":6321962,"size":102114717,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a1bf1b349efb152946aba8d4cedf401289ef7ad4&amp;dn=%28Blues%29+Peg+Leg+Sam+-+Joshua+%28Feat.+Louisiana+Red%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1302966852,"description":"Styles: Acoustic Country Blues, Folk-Blues, Vaudeville Blues\nRecorded: 1975\nReleased: 1989\nLabel: Tomato \nFile: mp3 @ 320 kbps\nSize: 97:13 MB\nTime: 38:04\nArt: Full Covers\n\n1. Joshua Fit The Battle Of Jericho - 3:30\n2. Navaho Trail - 4:47\n3. John Henry - 5:53\n4. Going Train Blues - 3:13\n5. Mr. Ditty Wa Ditty - 4:21\n6. Strollin' - 4:50\n7. I Got A Home - 4:50\n8. Dog Chase - 2:58\n9. Early In The Morning - 2:57\n10. Poor Boy - 3:40\n\nPersonnel:\nPeg Leg Sam - Harmonica, Vocals\nLouisiana Red - Guitar, Vocals\n\n\nPeg Leg Sam was a performer to be treasured, a member of what may have been the last authentic traveling medicine show, a harmonica virtuoso, and an extraordinary entertainer. Born Arthur Jackson, he acquired his nickname after a hoboing accident in 1930. His medicine show career began in 1938, and his repertoire -finally recorded only in the early '70s - reflected the rustic nature of the traveling show.\n'Peg' delivered comedy routines, bawdy toasts, and monologs; performed tricks with his harps (often playing two at once); and served up some juicy Piedmont blues (sometimes with a guitar accompanist, but most often by himself). Peg Leg Sam gave his last medicine-show performance in 1972 in North Carolina and was still in fine fettle when he started making the rounds of folk and blues festivals in his last years.\nRecorded shortly before his death, this album features Peg Leg Sam with Louisiana Red performing a set of old-timey, traditional blues - the kind of that was frequently heard at travelling medicine shows. Although it was recorded late in his career, the album captures the essence of Peg Leg Sam.\nOriginally released on the indie label Blue Labor in 1975, and it certainly shows his roots as a medicine show performer. The music falls halfway between medicine show burlesque and straight country-blues. Peg Leg Sam was a fine harmonica player and guitarist who captured the essence of the medicine show, even after that tradition had died. Louisiana Red, who accompanies Peg Leg on several tracks, doesn't quite get into the spirit and sounds uncomfortable with the material, which only shows that Sam was a master of a forgotten art. Nevertheless, to many blues fans, this music may sound more like a historical curiosity than a lost treasure.  The second re-release in 2001 was remastered and titled 'Early In The Morning'. Had changed covers and was released by Blues Alliance label and Labor Records.\n\n\n","torrent":{"xt":"urn:btih:a1bf1b349efb152946aba8d4cedf401289ef7ad4","amp;dn":"%28Blues%29+Peg+Leg+Sam+-+Joshua+%28Feat.+Louisiana+Red%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1bf1b349efb152946aba8d4cedf401289ef7ad4","infoHashBuffer":{"type":"Buffer","data":[161,191,27,52,158,251,21,41,70,171,168,212,206,223,64,18,137,239,122,212]},"announce":[],"urlList":[]}}