{"title":"The Godfather Portable - [Espera]","uid":6381511,"size":2236392913,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a3273bf4e72ef52ff8068757ee85a53e6609afa7&amp;dn=The+Godfather+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1305044924,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;REG1.reg&quot;\n3.Run &quot;REG2.reg&quot;\n4.Run &quot;The Godfather 1 Click.exe&quot;\n5.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nThe Godfather is widely regarded as one of the greatest films of all time. So when Electronic Arts announced that it was making a game based on the license, it made sense as a business venture, but it also seemed like a risky move to adapt such a beloved and well-known story to a video game. Luckily, that risk paid off. The Godfather is a satisfying, lengthy adventure, and more importantly, it remains faithful to the classic film while managing to create a compelling story of its own.\n\nEven though you play as an all new character, the game still manages to stick closely to the events in the movie.\n\nThe Godfather puts you in the role of a peripheral character that didn't appear in the film, but nevertheless played a critical role in the story. While the character is by no means an official write-in from Mario Puzo or Francis Ford Coppola, he manages to mesh fairly well with the rest of the story, a large part of which is taken directly from the film. When you start the game, you can create a mobster using customization tools similar to those found in the EA Sports games. You then begin the game and watch your father get gunned down in the streets by rival mobsters. Flash forward a few years to the wedding scene from the opening of the film, and your mother is asking the Don to take you under his wing and offer you work. As we learned from the film, no Sicilian can refuse a request for a favor on his daughter's wedding day, so the Don sends the imposing Luca Brasi to look after you and teach you how to be a mobster. \n\nMinimum System Requirements\n\nSystem:\n    1.4 GHz or equivalent\nRAM:\n    256 MB\nHard Drive Space:\n    5000 MB\nOther:\n    DirectX 9.0c compatible sound card and sound card\n\n\n","torrent":{"xt":"urn:btih:a3273bf4e72ef52ff8068757ee85a53e6609afa7","amp;dn":"The+Godfather+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3273bf4e72ef52ff8068757ee85a53e6609afa7","infoHashBuffer":{"type":"Buffer","data":[163,39,59,244,231,46,245,47,248,6,135,87,238,133,165,62,102,9,175,167]},"announce":[],"urlList":[]}}