{"title":"The Consequence","uid":5811423,"size":631414272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a44ed89c179845ab4cf3675a3797bb76ba8be7d1&amp;dn=The+Consequence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1283646422,"description":"The first part of &quot;The Consequence&quot; is a tender courtship episode. Martin, a quiet, sensitive man of perhaps 30 years old, is imprisoned for having had sex with a 15-year-old boy, and while incarcerated he meets Thomas, the son of one of the prison officials. Thomas (Ernst Hannawald) has the cheek-bones of a female fashion model and the innocent beauty of an angel. And, more to the point, Thomas has a crush on Martin (Jurgen Prochnow) from the moment they meet.\n\nTheir affair is consummated in the kind of gradual, intimate, not at all sexually explicit love scene one seldom sees between heterosexual couples on the screen any more. The director, Wolfgang Petersen, uses slow, steady camera movements and the natural warmth of his two actors to give this early part of the film an unusually rosy glow.\n\nThe rest of &quot;The Consequence,&quot;, follows Thomas and Martin from one hardship to the next, with society persecuting them at every turn. Martin is denied parole after the prison guards read one of Thomas's love letters. Thomas loses his job for consorting with Martin later on. Thomas winds up in a reform school populated exclusively by goons, including one burly sadist who puts out cigars on the persons of his least-favorite students.\n\nMuch of &quot;The Consequence&quot; is sentimental in the nicest sense and genuinely romantic, too. Mr. Petersen demonstrates both technical proficiency and a sensitivity toward the gentler side of his subject.\n\n\n\nRUNTIME..........: 01:35:00 \n\nAUDIO LANGUAGE...: German\n\nGENRE............: Drama, Love, Homosexuality\n\nSUBTITLES........: English\n\nRAINBOW RATING...: 8.3 out of 10\n\n","torrent":{"xt":"urn:btih:a44ed89c179845ab4cf3675a3797bb76ba8be7d1","amp;dn":"The+Consequence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a44ed89c179845ab4cf3675a3797bb76ba8be7d1","infoHashBuffer":{"type":"Buffer","data":[164,78,216,156,23,152,69,171,76,243,103,90,55,151,187,118,186,139,231,209]},"announce":[],"urlList":[]}}