{"title":"Kiran Ahluwalia - Wanderlust [FLAC] TQMP","uid":5808505,"size":274489457,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a49bb3eb5d2436c1dd1130231ed35a055e636a22&amp;dn=Kiran+Ahluwalia+-+Wanderlust+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pastafari","files":-1,"time":1283535843,"description":"Kiran Ahluwalia - Wanderlust\n2007\n\nSonglines Music Awards 2009. Winner\nCategory - Newcomer.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nGracias to my friend Yurik for this one.\n\nReviews\n\nAluwalia was born in India, grew up in Canada, and now lives with her husband and musical collaborator, Rez Abbasi, a native of Pakistan, in New York City. A longtime devotee of ghazals, ancient romantic poetry originally written in Urdu (she is one of the few modern artists to compose new music for these odes), she recently found herself enthralled by fado (literal translation--&quot;fate&quot;), Portugal's impassioned, doom-laden, yet somehow stately contribution to the world's lovelorn repertoire. Sensing a common chord between the two traditions, she sought out some noted specialists in the latter field, including guitarist Jose Manuel Neto and bassist Ricardo Cruz, along with accordionist Enzo d'Aversa. The result was a trio of tunes (&quot;Jo Dil,&quot; &quot;Haath Apne,&quot; &quot;Haal-e-Dil&quot;) in which the two styles are blended and transformed into a mysteriously apt and no less heartrending third entity. The balance of the album is dedicated to further intercultural experiments, in which elements of Indian classical music, filmi (soundtrack) vocals, Western blues, and African influences alternate and join forces, underpinning the singer's silkily sinuous, sensual voice. One track, &quot;Aks,&quot; even wanders into Brazilian bossa nova territory with no transitional shock whatsoever. Traditional instruments and percussion abut a stinging electric guitar, as boundaries are less surmounted than calmly and cheerfully ignored, to wonderful effect.\n-- amazon.com\n\nKiran Ahluwalia's Wanderlust: The Yearning of Urdu Poetry, the Longing of Portuguese Fado, and the Gentle Grooves of the Sahara \n\nIf yearning had a musical form it would be ghazals, the Indian and Pakistani sung poetry about unrequited love. If longing was a genre, it would be fado, the melancholic Portuguese song form also based in poetry. Singer Kiran Ahluwalia--a musical wanderer who was born in India, raised in Canada, and now lives in New York City--unites the two on her latest recording, Wanderlust (Times Square/4Q Records). As always she has been poring over poetry--ancient and modern--in search of compelling words which she can set to music, continuing her reputation as one of the few people in the Western hemisphere composing new music for ghazals. The latest album draws on fado, Saharan African blues, jazz, and more demonstrating Kiran's continual journey to bring her unique ghazal style into a modern and global context.\n\nThe seeds of the album began when she spent most of last year falling asleep at night to fado recordings. &quot;Fado vocalists are so dramatic when they perform and much of this drama is also present in the words of ghazal poetry. Fadistas use their voice in a very different way than ghazal vocalists and yet I find so much similarity in the emotional intent. I found myself mesmerized by fado instrumentalists as well,&quot; says Kiran.\n\nShe started attending fado concerts in New York and Toronto, her hometown which she visits regularly. When her husband and musical collaborator Rez Abbasi--born in Pakistan--was offered a tour of Portugal, Kiran (who also performs with Rez's group) got straight to work tracking down musicians with whom she could record while there. Along with producing and playing on Wanderlust, Rez arranged compositions for a traditional fado setting that included the Portuguese guitarra of Jose Manuel Neto and the Portuguese bass of Ricardo Cruz. Both have adorned countless fado recordings including those of fado star Mariza.  Added to the mix was accordion player, Enzo d'Aversa.  Together with Kiran's voice, this unprecedented ghazal-fado collaboration created three magical songs that anchor the new album: &quot;Jo Dil,&quot; &quot;Hath Apne,&quot; and &quot;Haal-e Dil.&quot;\n\nThe magic of unexpected combinations fills Wanderlust, as does the enterprising spirit of the constant traveler suggested by the album's title. Both Kiran and the genre she composes in have wandered across continents and united disparate worlds.\n\nOne of the first ghazals penned in Urdu in 15th century India appears on Wanderlust, &quot;Tere Darsan,&quot; written by Quli Qutub Shah. This sultan ruled over the city of Hyderabad, the place where Kiran received much of her ghazal training from one of the last living court musicians, Vithal Rao. &quot;I'm constantly reading poetry in Urdu and Punjabi. That's the way I live my life,&quot; Kiran explains. Her passionate reading brought her to Qutub Shah's words, crafted when Urdu was still emerging as a language. &quot;Because the Urdu language of these ghazals is not the same dialect we speak today, I felt I could waiver from the path and experiment a little,&quot; Kiran continues. &quot;It was easier to play with the words, because there was no preconceived notion of how they could be sung.&quot; This feeling of freedom led Kiran to incorporate a bluesy rhythm and groove reminiscent of Saharan Africa, for another of Wanderlust's serendipitous successes. It also marks the first time she has used the sounds of electric guitar.\n\nGhazal, African grooves, and Portuguese fado mix freely in Kiran's music, but the diverse inspirations for the album have another connection. There is an element of ghazal that remains constant throughout its migrations: the subjects of desire and heartbreak. &quot;Ghazals are always hard to explain,&quot; Kiran notes. &quot;The majority of them are about romantic passion, and a very common theme is that there is a lover and a beloved. The lover is forever yearning for the beloved and the beloved is forever unattainable.&quot; Fado, with poetic foundations which evolved a continent away, was equally obsessed with romantic longings, with saudade, an untranslatable emotion akin to longing for a lost, past love.\n\nToronto is one of the latest homes to the yearnings of ghazal. Kiran began composing ghazals and Punjabi folk songs, in part inspired by a group of Canadian-Indian and -Pakistani poets. Their work continues to inspire her, and many of the songs on Wanderlust stem from the works of these poets active in Toronto today. Some, like Rafi Raza, are just as tempted to wander the world as Kiran: In &quot;Yakeenan&quot; (&quot;No Doubt&quot;), he writes, 'My wandering is still imperfect, because I come home too often.' &quot;I don't know why he is obsessed with wandering, but so am I,&quot; Kiran says with a smile.\n\nA gratifying and well-received CBC collaboration with a Toronto-based qawalli singer, Shahid Ali Khan, a former member of Nusrat Fateh Ali Khan's party, moved Kiran to compose &quot;Jaag Na Jaag,&quot; based on a poem by 17th-century Sufi saint Sultan Bahu. &quot;I had Shahid in mind and so composed something to work with him,&quot; Kiran explains, &quot;something that is loosely based on the qawalli genre.&quot; The result is Kiran's first vocal duet with another singer from the subcontinent.\n\nShahid Ali Khan is also featured on &quot;Mere Mathay,&quot; supporting Kiran's catchy folk melody.  This song emerged when Kiran performed at a Toronto school assembly. The student body was predominantly South Asian and Kiran's presence was a resounding success. &quot;Though I played an acoustic set, it was like I was in a rock concert,&quot; says Kiran. &quot;The kids were screaming at the top of their lungs. They were so excited. Here I was... someone who emanated from their culture, had the same skin color, and was singing in words that are spoken in their homes. They were out of control.&quot;\n\nThere Kiran met a young student and aspiring singer who grilled her about the music industry. His father turned out to be a poet who wrote the words for &quot;Mere Mathay,&quot; to which Kiran put a Punjabi folk-style melody. &quot;In India, people read the lines on your hands and feet to tell your future,&quot; explains Kiran. &quot;Some very learned and elevated mystics say they can even read the lines on your forehead. In this song, the lover is saying to the beloved, 'The lines on my forehead say we will never be together. Without a lamp, the oil is not going to spring into flames.' But it's not as dramatic and melancholy as it seems. These words are really an excuse to start a conversation with the woman of his desires,&quot; says Kiran.   \n\nThough Kiran Ahluwalia may sing about unfulfilled desires, Wanderlust reveals a compelling harmony that unites diverse inspirations through the beautiful yearning of ghazal. And somehow it is fitting that a musical wanderer is building a bridge across eras, continents, and cultures.\n-- rockpaperscissors\n\nTrack List\n01- Jo Dil\n02- Merey Mathay\n03- Teray Darsan\n04- Haal-e-dil\n05- Yakeenan\n06- Soch Ka\n07- Tumba\n08- Aks\n09- Jaag Na Jaag\n10- Haath Apne\n\nArtwork and EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:a49bb3eb5d2436c1dd1130231ed35a055e636a22","amp;dn":"Kiran+Ahluwalia+-+Wanderlust+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49bb3eb5d2436c1dd1130231ed35a055e636a22","infoHashBuffer":{"type":"Buffer","data":[164,155,179,235,93,36,54,193,221,17,48,35,30,211,90,5,94,99,106,34]},"announce":[],"urlList":[]}}