{"title":"Srar Wars-The Clone Wars-Republic Heroes[pc-multi5] [Tntvillage]","uid":5773000,"size":5459378176,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4a200851343952bbe5205a9034b5035c2de28dc&amp;dn=Srar+Wars-The+Clone+Wars-Republic+Heroes%5Bpc-multi5%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1282169897,"description":"Srar Wars-The Clone Wars-Republic Heroes[pc-multi5] [Tntvillage]\n\n &lt;a href=&quot;\nhttp://img685.imageshack.us/img685/9230/cozx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img685.imageshack.us/img685/9230/cozx.jpg&lt;/a&gt;\n\nAzione  - 1 DVD  - Multi5 (Eng-Ita-Esp-Fre-Deu)\ndata di uscita: 18 settembre 2009\n\nVisit this link:\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220414&amp;view=findpost&amp;p=12277180&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220414&amp;view=findpost&amp;p=12277180&lt;/a&gt;\n\n\n.::.Recensione.::.\n\nQuando si parla di Star Wars ÃƒÂ¨ impossibile non incontrare il favore delle grandi masse. L'universo partorito da George Lucas ha ospitato un'infinitÃƒÂ  di avventure che hanno abbracciato ogni media e forma d'intrattenimento esistente e negli anni i videogiochi non hanno fatto certo eccezione, annoverando numerosi capitoli e saghe vivibili attraverso il pad. Oramai il dualismo tra la Galassia lontana lontana  e la dimensione videoludica ÃƒÂ¨ talmente consolidato che ÃƒÂ¨ diventato impensabile concepire un nuovo capitolo di Star Wars senza aspettarsi il relativo tie-in sulle nostre console e pc. A tal proposito non poteva certo fare eccezione la versione animata in computer grafica The Clone Wars che annovera all'attivo un lungometraggio cinematografico e due serie televisive.\nGli eventi di Star Wars: The Clone Wars - Gli Eroi Della Repubblica si collocano esattamente a cavallo tra le due serie e vede comparire al suo interno numerose figure eccellenti protagoniste dei vari episodi d'animazione.\n &lt;a href=&quot;\nhttp://img442.imageshack.us/img442/8198/12571517.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img442.imageshack.us/img442/8198/12571517.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img831.imageshack.us/img831/4410/68332808.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img831.imageshack.us/img831/4410/68332808.jpg&lt;/a&gt;\n\nCloni Jedi VS Droidi Sith\nStar Wars: The Clone Wars - Gli Eroi Della Repubblica si presenta come un action dall'anima piuttosto semplice ed intuitiva, niente combo infinite o mosse particolari da apprendere con il tempo, le abilitÃƒÂ  dei personaggi sono subito disponibili e tali rimangono per tutto il gioco. Impersonando un cavaliere Jedi si ha la possibilitÃƒÂ  di destreggiarsi con spada laser e spinte della Forza, mentre vestendo le bianche armature dell'esercito di cloni dobbiamo farci valere a colpi di blaster sfruttando al meglio i ripari accovacciandosi.\nOgni missione vede due eroi come protagonisti contemporaneamente a schermo, da cui la spiccata inclinazione del gioco verso la cooperativa tra due giocatori, ma anche nel caso si voglia affrontare gli scontri da soli l'intelligenza artificiale si comporta piÃƒÂ¹ che bene.\nGli eventi narrati si contestualizzano all'interno di quel gigantesco conflitto intergalattico noto come la Guerra dei Cloni, dove i Jedi a capo dell'esercito repubblicano fronteggiano la minaccia separatista dei droidi manovrati dal lato oscuro dei Sith. Come a voler riprendere il rapido susseguirsi di eventi tipico delle due trilogie cinematografiche le missioni di gioco si alternano con un ritmo vivace a sostegno di una narrazione di fondo ben orchestrata e resa sempre dinamica dall'incrociarsi di protagonisti e scenari di conflitto lontani tra loro vari anni luce che formano, man mano che si procede nel gioco, una rete che offre un chiaro quadro complessivo degli sviluppi della guerra.\n &lt;a href=&quot;\nhttp://img651.imageshack.us/img651/3843/53598687.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img651.imageshack.us/img651/3843/53598687.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img442.imageshack.us/img442/6847/72582939.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img442.imageshack.us/img442/6847/72582939.jpg&lt;/a&gt;\n\nA Forza di punti\nSpada laser o fucile alla mano si procede spediti al fianco del compagno attraverso i numerosi campi di battaglia o navi stellari abbordate prossime ad esplodere. Le missioni sono piuttosto brevi ma il loro numero rende la longevitÃƒÂ  del gioco piÃƒÂ¹ che sufficiente. CiÃƒÂ² che invece puÃƒÂ² portare a una precoce conclusione dell'avventura ÃƒÂ¨ l'estrema semplicitÃƒÂ  del gioco che si mantiene tale fino alla fine e non c'ÃƒÂ¨ numero di droidi o boss di fine livello che tenga, Gli Eroi della Repubblica ÃƒÂ¨ un gioco facile, facilissimo, complice il fatto che ogni morte non comporta alcuna conseguenza se non una, sporadica, perdita di una infima manciata di punti. Alla luce di questa inusuale immortalitÃƒÂ  non si hanno quindi particolari scrupoli nell'affrontare anche gli scontri piÃƒÂ¹ ardui con una certa spavalderia consci del fatto che il respawn ÃƒÂ¨ sempre vicino e infinito.\nAbbiamo parlato di punti, accumulabili mantenendo alto il moltiplicatore durante gli scontri e ottenibili anche come ricompensa a fine missione. Questi sono spendibili nel negozio per acquistare potenziamenti alle abilitÃƒÂ  offensive dei personaggi o anche per alcuni divertenti gadget o extra vari. Devono stare tranquilli i giocatori piÃƒÂ¹ spensierati dato che il reperimento dei punti non sarÃƒÂ  mai ostico, alcuni livelli ne sono letteralmente pieni e a tale scopo vengono anche in aiuto le numerose sfide disseminate per i livelli che metteranno in competizione i due giocatori in una gara a chi ottiene il punteggio piÃƒÂ¹ alto, c'ÃƒÂ¨ da dire che in queste occasioni l'IA del compagno (nel caso si stia giocando da soli) non rappresenta mai una sfida degna di nota lasciandoci conquistare il primato senza troppa fatica.\n &lt;a href=&quot;\nhttp://img831.imageshack.us/img831/4474/49185222.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img831.imageshack.us/img831/4474/49185222.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img442.imageshack.us/img442/2067/60567074.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img442.imageshack.us/img442/2067/60567074.jpg&lt;/a&gt;\n\nCome combattere il lato oscuro\nUn Jedi, si sa, ÃƒÂ¨ un guerriero pieno di risorse, oltre al ricorso alla sua lama di luce Obi Wan, Anakin e i loro compagni hanno la possibilitÃƒÂ  di utilizzare le spinte della Forza per far precipitare i droidi dalle alture oppure per scagliare alcuni oggetti dello scenario contro gli avversari. Ancor piÃƒÂ¹ interessante ÃƒÂ¨ la capacitÃƒÂ  di ogni cavaliere di prendere momentaneamente il controllo dei droidi saltandoci sopra cosÃƒÂ¬ da sfruttarne il potenziale offensivo contro la loro stessa truppa metallica, in alcune circostanze il ricorso a questi espedienti ÃƒÂ¨ fondamentale per poter proseguire nei livelli o per sgombrare passaggi apparentemente impraticabili come non manca di ripeterci l'apprensivo maestro Yoda con i suoi consigli al giocatore. Nei panni dei cloni dell'esercito repubblicano l'azione percorre binari piÃƒÂ¹ canonici: dobbiamo far affidamento sul nostro fido fucile blaster e sulle armi secondarie come granate o razzi, da raccogliere quando necessario lungo il percorso, utili per liberarsi degli avversari piÃƒÂ¹ coriacei.\nOltre alla preponderante componente action che rappresenta l'anima del gioco nelle missioni in cui siamo chiamati a comandare i cavalieri dediti al culto della Forza non ÃƒÂ¨ raro affrontare delle sezioni platform. Anche in questo caso non si tratta di fasi impegnative, le doti atletiche dei Jedi sono accompagnate da un salto assistito che quasi sempre ci catapulta automaticamente sulla piattaforma desiderata, risparmiandoci la fatica (ma anche la soddisfazione) di calcolare al millimetro lo stacco perfetto nei balzi tra uno strapiombo e l'altro. Le cadute accidentali sono riconducibili quasi sempre a problemi di prospettiva causati dall'inquadratura della telecamera fissa che non sempre rende possibile una corretta valutazione delle distanze. Una semplificazione cosÃƒÂ¬ estrema da mortificare il gameplay stesso finisce per sminuire il level design che in alcuni casi potrebbe vantare dei percorsi quantomeno interessanti da affrontare se solo ci fosse un adeguato livello di sfida a stimolare il giocatore.\nIn altre occasioni siamo chiamati a ricorrere all'uso di alcuni mezzi da battaglia, in questo modo il gioco si trasforma in un classico shooter a scorrimento verticale senza troppe pretese. Dato il loro misero peso specifico nell'economia del gioco queste fasi rappresentano giusto una, non troppo marcata, variazione sul tema.\n &lt;a href=&quot;\nhttp://img442.imageshack.us/img442/6187/21657763.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img442.imageshack.us/img442/6187/21657763.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img442.imageshack.us/img442/6797/37019098.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img442.imageshack.us/img442/6797/37019098.jpg&lt;/a&gt;\n\nSerie animata?\nStar Wars: The Clone Wars - Gli Eroi Della Repubblica ÃƒÂ¨, come abbiamo giÃƒÂ  detto, tratto dalla serie animata The Clone Wars i cui episodi vantano un'ottima realizzazione in computer grafica, particolaritÃƒÂ  che ha reso ben riconoscibile questo spin-off e ne ha donato un carattere definito e inconfondibile. Il gioco in questione s'ispira direttamente alla stessa linea guida, riprendendo le fattezze dei personaggi e la loro caratterizzazione sfruttando questa volta il motore poligonale del gioco. Purtroppo il risultato ÃƒÂ¨ ben lontano dall'effetto gradevole visto al cinema e in tv, il carico poligonale, anche nel caso dei protagonisti, ÃƒÂ¨ insufficiente e tradisce una modellazione dozzinale che stride con il ricordo dei modelli presi a riferimento. Anche le texture mostrano il fianco ad una bassa definizione davvero fastidiosa, in particolare quando si va ad analizzare l'ambiente di gioco: scarno e troppo spesso anonimo. A questo aggiungiamo la presenza di un leggero aliasing e alcuni sporadici cali di frame rate durante i combattimenti piÃƒÂ¹ caotici nonostante la scena non brilli mai di un dettaglio grafico tale da poter giustificare un appesantimento dell'hardware.\nOttimo invece l'audio, d'altronde Sta Wars ci da ha sempre deliziato l'udito con colonne sonore d'eccezione, stavolta perÃƒÂ² il compito di accompagnare lo sguainare di spade laser non tocca al caro vecchio John Williams, ma al talentuoso Kevin Kiner, curatore della colonna sonora della serie animata.\n\nVisit thelink:\n\nInstallazione\nMasterizzate o montate il file immagine con le daemon tools lite. Installate il gioco. Copiate i files RepublicHeroesLauncher e razor1911.dll dalla cartella razor1911 e incollateli nella directory di installazione del gioco sovrascrivendo quelli esistenti.\n\nIl gioco ÃƒÂ¨ stato testato su windows XP\n\nRequisiti di sistema\nOS: Windows XP or Windows Vista\nProcessor: Intel P4 3.0GHz AMD XP 3000+ or higher\nMemory: 1GB Ram, 2GB for Windows Vista\nGraphics: Nvidia 7300 GS or better, ATI X1600 or better* *Requirement of 256MB or more video memory\nDirectXÃ‚Â®: DirectX 9.0c\nHard Drive: 8GB\nSound: 100% DirectX 9.0c compatible audio Device\nController Support: Yes\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:a4a200851343952bbe5205a9034b5035c2de28dc","amp;dn":"Srar+Wars-The+Clone+Wars-Republic+Heroes%5Bpc-multi5%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a200851343952bbe5205a9034b5035c2de28dc","infoHashBuffer":{"type":"Buffer","data":[164,162,0,133,19,67,149,43,190,82,5,169,3,75,80,53,194,222,40,220]},"announce":[],"urlList":[]}}