{"title":"Forrest Gump(1994)DVDRip.AC3(ENG)-DROCK","uid":6320062,"size":734479770,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a54b35d0cd2cb86e98daa12997c5e67307b6c168&amp;dn=Forrest+Gump%281994%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1302919475,"description":"&quot;Stupid is as stupid does,&quot; says Forrest Gump (played by Tom Hanks in an Oscar-winning performance) as he discusses his relative level of intelligence with a stranger while waiting for a bus. Despite his sub-normal IQ, Gump leads a truly charmed life, with a ringside seat for many of the most memorable events of the second half of the 20th century. Entirely without trying, Forrest teaches Elvis Presley to dance, becomes a football star, meets John F. Kennedy, serves with honor in Vietnam, meets Lyndon Johnson, speaks at an anti-war rally at the Washington Monument, hangs out with the Yippies, defeats the Chinese national team in table tennis, meets Richard Nixon, discovers the break-in at the Watergate, opens a profitable shrimping business, becomes an original investor in Apple Computers, and decides to run back and forth across the country for several years. Meanwhile, as the remarkable parade of his life goes by, Forrest never forgets Jenny (Robin Wright Penn), the girl he loved as a boy, who makes her own journey through the turbulence of the 1960s and 1970s that is far more troubled than the path Forrest happens upon. Featured alongside Tom Hanks are Sally Field as Forrest's mother; Gary Sinise as his commanding officer in Vietnam; Mykelti Williamson as his ill-fated Army buddy who is familiar with every recipe that involves shrimp; and the special effects artists whose digital magic place Forrest amidst a remarkable array of historical events and people.\n\nRipped with handbrake.\n\nLength: 2 Hours 22 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:a54b35d0cd2cb86e98daa12997c5e67307b6c168","amp;dn":"Forrest+Gump%281994%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a54b35d0cd2cb86e98daa12997c5e67307b6c168","infoHashBuffer":{"type":"Buffer","data":[165,75,53,208,205,44,184,110,152,218,161,41,151,197,230,115,7,182,193,104]},"announce":[],"urlList":[]}}