{"title":"Ed Kowalczyk - Grace (2nafish)","uid":5769469,"size":119687172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a5613b5d997609ad2af536ec6a4c30ef1a490067&amp;dn=Ed+Kowalczyk+-+Grace+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282003856,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Grace&quot; is the first single by former Live lead singer Ed Kowalczyk from his debut solo album Alive.\n\nAlive is the debut solo album by former Live lead singer Ed Kowalczyk.\n\nKowalczyk entered the studio in early 2010 to record material that he began writing in 2008. In writing material for Alive, Kowalczyk sat with an acoustic guitar and began writing lyrics and melodies that he felt moved by, a process which was similar to how he wrote when he was in Live.\n\nThe lyrics on Alive feature much religious and spiritual imagery. Kowalczyk's acknowledgement of his faith is much more explicit on this album than it was on his work with Live. The album entered Billboard's Christian Albums Chart at number 6.\n\nThe album is a major hit in The Netherlands, debuting at number 4 on the Dutch album chart. It has also charted in the US, Belgium and Australia.\n\nEdward Joel Kowalczyk (born July 16, 1971) is the former lead singer of the band Live. Since Live disbanded, he has launched a solo career. His first album, Alive, was released worldwide in June and July 2010.\n\nEd Kowalczyk was the lead singer and primary songwriter for the band Live.\n\nKowalczyk has worked with musicians Stuart Davis and Glen Ballard as well as singers Anouk, Neneh Cherry and Adam Duritz of Counting Crows. He featured on the Tricky song &quot;Evolution Revolution Love,&quot; from the 2001 album Blowback.\n\nIn 2008 Kowalczyk appeared in a video with will.i.am from the Black Eyed Peas, John Legend, Scarlett Johansson and rapper Nick Cannon, supporting US Presidential candidate Barack Obama. He has also appeared at campaign rallies for Obama with will.i.am.\n\nHe grew up in York, Pennsylvania  of Polish decent and attended William Penn Senior High School in the York City School District, where he met the other three members of what would become Live. His father was a teacher at the local High School (Northeastern).\n\nHis younger brother Adam Kowalczyk toured with Live, playing rhythm guitar and providing backing vocals.\n\nHe appeared in the David Fincher film Fight Club as a waiter, his only film acting credit to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a5613b5d997609ad2af536ec6a4c30ef1a490067","amp;dn":"Ed+Kowalczyk+-+Grace+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5613b5d997609ad2af536ec6a4c30ef1a490067","infoHashBuffer":{"type":"Buffer","data":[165,97,59,93,153,118,9,173,42,245,54,236,106,76,48,239,26,73,0,103]},"announce":[],"urlList":[]}}