{"title":"Democracy Now - 14 jun 2011","uid":6469577,"size":446655904,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a5abb48ff4b425fdd8c8e1c8a38ab7ca24b18918&amp;dn=Democracy+Now+-+14+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1308076096,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 14, 2011\n\n- U.S., Afghan Officials Discuss Extending Military Presence For Decades\n- CIA to Intensify Covert Killing Campaign in Yemen, Modeled After Pakistan Drone Program\n- Syrian Military Forces Expand Operations, Thousands of Refugees Flood Turkey Border\n- Jordan Protesters Reportedly Attack Motorcade of King Abdullah II\n- Republicans Attack President Obama in First Major Debate of 2012 Presidential Race\n- Obama Reaches Out To Wall Street Executives Ahead Of 2012 Election\n- Italy Votes in Overwhelming Numbers to Block Nuclear Power Revival\n- Grand Jury Investigates CIA Over Death of Abu Ghraib Prisoner\n- Families of Dead GuantÃƒÂ¡namo Prisoners Appeal to Revive Lawsuit Against Donald Rumsfeld\n- Mexico: Majority of Guns Come From U.S., Hearing Begins on U.S. Efforts To Sell Weapons To Cartels\n- Thousands of New York Macy's Workers Prepare For Strike\n\n\nSpecial reports\n\n- First Major Republican Presidential Debate Focuses on Obama, Jobs, Healthcare, Afghan War and Tea Party\n\nSeven Republican presidential hopefuls held their first major debate Monday night in New Hampshire. Broadcast nationally on CNN, the debate offered candidates their first major opportunity to convince Republican voters they can beat President Obama in 2012. Former Massachusetts Gov. Mitt Romney and Rep. Ron Paul called for end to Afghanistan. Rep. Michele Bachmann vowed to repeal President Obama's healthcare law. Pizza mogul Herman Cain expounded on his fear of Muslims. We air excerpts from the debate. [includes rush transcript]\n\n\n- FBI to Expand Domestic Surveillance Powers As Details Emerge of Its Spy Campaign Targeting Activists\n\nCivil liberties advocates are raising alarm over news the FBI is giving agents more leeway to conduct domestic surveillance. According to the New York Times, new guidelines will allow FBI agents to investigate people and organizations &quot;pro-actively&quot; without firm evidence for suspecting criminal activity. We speak to former FBI agent Mike German, who now works at the American Civil Liberties Union, and Texas activist, Scott Crow, who has been the focus of intense FBI surveillance from 2001 until at least 2008. Using the Freedom of Information Act, Crow received 440 pages of heavily-redacted documents revealing the FBI had set up a video camera outside his house, traced the license plates of cars parked in front of his home, recorded the arrival and departure of his guests and observed gatherings that Crow attended at bookstores and cafes. The agency also tracked Crow's emails and phone conversations and picked through his trash to identify his bank and mortgage companies. &quot;It definitely has been traumatizing at different points,&quot; says Crow. &quot;But if we don't come out and be open about this, then they've already won, and the surveillance and the 'War on Terror' wins against us.&quot;\n\n\n- Formaldehyde Added to &quot;Known Carcinogens&quot; List Despite Lobbying By Koch Brothers, Chemical Industry\n\nThe U.S. Department of Health and Human Services has added formaldehyde to a list of known carcinogens, despite years of lobbying by the chemical industry. Formaldehyde is found in plastics and often used in plywood, particle board, mortuaries and hair salons. The government also said Friday that styrene, which is used in boats, bathtubs and in disposable foam plastic cups and plates, may cause cancer. The conservative billionaire Koch brothers have led the lobbying effort against labeling formaldehyde as a carcinogen, and Georgia-Pacific, a subsidiary of Koch Industries, is one of the country's top producers of formaldehyde.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a5abb48ff4b425fdd8c8e1c8a38ab7ca24b18918","amp;dn":"Democracy+Now+-+14+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5abb48ff4b425fdd8c8e1c8a38ab7ca24b18918","infoHashBuffer":{"type":"Buffer","data":[165,171,180,143,244,180,37,253,216,200,225,200,163,138,183,202,36,177,137,24]},"announce":[],"urlList":[]}}