{"title":"Fugazi - In on the Kill Taker (1993) [FLAC] politux","uid":5774954,"size":268416927,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a62ae90e3f921e2e3188cb14acc3e93d69c10ed8&amp;dn=Fugazi+-+In+on+the+Kill+Taker+%281993%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1282231529,"description":"In on the Kill Taker is like scrubbing your face with steel wool. It finds the band relying on rusty guitar shards that scrape, seethe, and hiss, further removing itself from the sound of 13 Songs and Repeater. Harsh and grating, Fugazi surprisingly produces sheer noise at times, best witnessed in the lengthy closing of 23 Beats Off and the unintentional Gremlins homage that opens Walkens Syndrome. Joe Lallys bass and Brendan Cantys drums are relegated to acting as a guide; theyre pushed -- but not squashed -- down in the mix, allowing for Ian MacKaye and Guy Picciottos guitars to take control, corrosively so. Its probably Fugazis least digestible record from front to back, but each track has its own attractive qualities, even if not immediately perceptible. Facet Squared and Public Witness Program open the record furiously, but the majority of the following Return the Screw is hardly audible, aside from occasional vocal tantrums. A good amount of time is spent alternating between low-key guitar noodling and intrusive bursts of aggression. They're smart with their sequencing, placing the gentle instrumental Sweet and Low (the only track where Lally plays a prominent role) after the exhaustive cacophony of 23 Beats Off, and generally piecing together a set of rather diverse tracks that flows well. Buried at the end of the record are two excellent lurchers, MacKayes Instrument and Picciottos Last Chance for a Slow Dance. \n\nSource: CD\nReleased: 1993\nLabel: Dischord Records\nGenre: Rock\nStyle: Post Hardcore\nQuality: FLAC\n\nTracks:\n\n  1. Facet Squared\n  2. Public Witness Program\n  3. Returning the Screw\n  4. Smallpox Champion\n  5. Rend It\n  6. 23 Beats Off\n  7. Sweet and Low\n  8. Cassavetes\n  9. Great Cop\n  10. Walkens Syndrome\n  11. Instrument\n  12. Last Chance for a Slow Dance","torrent":{"xt":"urn:btih:a62ae90e3f921e2e3188cb14acc3e93d69c10ed8","amp;dn":"Fugazi+-+In+on+the+Kill+Taker+%281993%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62ae90e3f921e2e3188cb14acc3e93d69c10ed8","infoHashBuffer":{"type":"Buffer","data":[166,42,233,14,63,146,30,46,49,136,203,20,172,195,233,61,105,193,14,216]},"announce":[],"urlList":[]}}