{"title":"Ultima Online - Polnyj komplekt dlya igry na servere The World.","uid":6393370,"size":1963355088,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a70d9aedfcf25e4aad0fa63fd24245dc0637e965&amp;dn=Ultima+Online+-+Polnyj+komplekt+dlya+igry+na+servere+The+World.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"L_Nigrouse","files":8,"time":1305429240,"description":"God vypuska: 2011\nZHanr: MMORPGRazrabotchik: Origin Systems\nIzdatel\\'stvo: Electronic ArtsVersiya: 7+\nTip izdaniya: Neofitsialnyj\nYAzyk interfejsa: anglijskij\nYAzyk ozvuchki: anglijskij\nSistemnye trebovaniya:\nDlya 2D klienta:\nTrebuemoe mesto dlya ustanovki: 1.7GBTrebovaniya k zhelezu: 500mhz protsessor, 192mb operativnoj pamyati, 8mb videokarta.\nDlya 3D klienta:\nTrebuemoe mesto dlya ustanovki: 320MB + 2GBTrebovaniya k zhelezu: 1000mhz protsessor, 256mb operativnoj pamyati, 64mb videokarta.\n\nOpisanie:\nPredlagaem Vam poprobovat poigrat na novom servere Ultima Online - The World.\nMy podderzhivaem rabotu kak s 2D klientom, tak i s 3D klientom. Rabotaem s poslednej versiej klienta - 7.0.13.4 (na 12 maya 2011 goda).Rabotayut sleduyuschie fasety (karty): Felucca/ Trammel/ Ilshenar/ Malas/ Tokuno. V skorom vremeni budet vklyuchen TerMur.Poka server tol\\'ko nachinaet rabotu, u Vas est\\' unikal\\'nyj shans nachat\\' igru v chistom mire i stat\\' ego geroem!\n\nV razdache prisutstvuet:\nKlassicheskij klient versii 7.0.10.h (Ispolzuetsya kak osnovnoj klient, mozhno obnovit do poslednej versii cherez avtoapdejter). Klient nuzhen dlya igry v 2D;Klassicheskij klient versii 4.h.h.h so vklyuchennymi v nego 3D modelyami, i klient Iris 2.0. Oba etih klienta nuzhny, esli Vy hotite igrat v 3D rezhime;Nadstrojka dlya klienta Razor. Nuzhna kak dlya zahoda na server, tak i dlya povysheniya udobstva igrovogo protsessa;Fajly dlya registratsii igry v reestre, dlya 32 bitnyh i 64 bitnyh OS. Oni mogut ponadobyatsya v buduschem, esli Vy zahotite perenesti papku s igroj v drugoe mesto;Fajl login.cfg. On nuzhen dlya teh, kto ne hochet ispolzovat Razor i hochet poprobovat poigrat po starinke. So vsemi versiyami klientov ne proveryalsya, no s bolshinstvom rabotaet tochno.\n\nFAQ po igre: http://twuo.ru/faq.php\n\nSajt igry / ssylka dlya registratsii akkaunta: http://twuo.ru/\n\nRegistratsiya v samoj igre avtomaticheskaya. Nuzhno prosto vvesti zhelaemyj login i parol, posle chego podtverdit Vash e-mail v igre.\n\nHarakteristiki servera: 700 Skill (+ powerscrolls), 225 Stat.\nUstanovka i zapusk igry: http://twuo.ru/readarticle.php?article_id=2\nLogin: login.twuo.ru\nPort: 2593\n\nObnovlenie razdachi: Net\n\nDop. informatsiya:\n1. My staraemsya ne otstavat ot ofitsialnogo servera igry i rabotaem na poslednih versiyah klienta. Tekuschaya versiya nashego servera rabotaet s klientom 7.0.13.4 (2011 goda), v to vremya, kak bolshinstvo serverov v Rossii zastryalo na kliente 2.0.0.0 - 2.0.3.0 (2000 goda).Poverte, za 11 let v igre mnogoe dobavilos i izmenilos v luchshuyu storonu. Po suti, esli Vy nikogda ne igrali na klientah versii vyshe - Vy nikogda ne igrali v Ultima Online;\n\n2. U nas rabotaet polnaya podderzhka vseh dopolnenij, s ML vklyuchitelno. Dopolnenie SA uzhe na stadii testirovaniya i dorabotki. Bolshinstvo serverov zastryalo na addone Renaissance. S takimi serverami nas razdelyaet 7 addonov;\n\n3. Na nashem servere rabotayut takie shkoly navykov, kak - Magiya, Nekromantiya, CHivlari, Nindzhitsu i Bushido. Na stadii testirovaniya - Mistitsizm. Na bolshinstve serverov est lish shkola Magii, chasto s nerabotayuschimi ili otklyuchennymi umeniyami. U nas - rabotaet vse;\n\n4. My ne beremsya sozdavat novye territorii ili novye klassy, rasy i umeniya, portya etim igru i vydavaya poluchivsheesya za Ultima Online. Nash server, i lyubaya detal na nem, rabotaet tochno tak zhe, kak ona rabotaet na ofitsialnom servere igry;\n\n5. Bolshinstvo serverov obyasnyaet svoe otstavanie tem, chto posle 2000 goda byli dobavleny PVE fasety, i PVP bylo ubito na kornyu. My ispravili etu oshibku EA. Nash Mir - PVP Mir. I my zhivem segodnyashnim dnem;\n\n6. Nash server dejstvitelno besplatnyj. V otlichii ot mnogih drugih besplatnyh serverov. Vam ne nuzhno tratit dengi, dlya togo, chtoby oplachivat uluchshennuyu podpisku bez kotoroj nevozmozhno komfortno igrat. My ne prodaem za donat veschi kotorye narushayut igrovoj balans. My ne prodaem za donat oruzhee, bronyu, butylki i vse to, chto pozvolit Vam beznakazanno ubivat teh, kto ne pokupaet takih veschej. My - za ravnuyu igru i chestnoe PVP;\n\n7. V otlichie ot podavlyayuschego bolshinstva serverov, u nas ne odin faset (Felucca). Na nashem servere vklyucheny i polnostyu rabotosposobny takie fasety kak - Felucca, Trammel, Ilshenar, Malas, Tokuno. Na stadii testirovaniya - Ter Mur. My predostavlyaem prostor dlya puteshestvennikov i iskatelej priklyuchenij;\n\n8. Nezabyvaemoe PVP i PVE. Fraktsii, zahvat zamkov, kontrol nad gorodami i ekonomikoj, ogromnoe raznoobrazie taktik vedeniya boya, za schet razlichnyh shkol, navykov i klassov, rasovyh sposobnostej. Rejd-bossy s razlichnymi taktikami, kraft, morskie puteshestviya, kastomizatsiya domov. Kvesty, v tom chisle i beskonechno generiruemye, smena vremen goda pod stat realnym, ogromnoe raznoobrazie veschej i mobov v Mire i vse eto - lish malaya chast togo, chto zhdet Vas na nashem servere;\n\n9. My predostavlyaem vozmozhnost igry kak na klassicheskom 2D kliente, tak i na moschnejshem 3D kliente Iris 2.0. V to vremya, kak u bolshinstva igrokov drugih serverov, takogo vybora net;\n\n10. Vsya nasha komanda imeet mnogoletnij opyt igry kak na ofitsialnyh serverah, tak i na ogromnom mnozhestve zarubezhnyh i rossijskih shardov. My dejstvitelno ponimaem v tom, chto delaem. Pri etom, u nas net manii velichiya, i my vsegda gotovy prislushatsya k konstruktivnoj kritike i interesnym predlozheniyam.\n\nP.S. - Dlya teh, kto nikogda ne igral v Ultima Online:Eta igra otnositsya k pervomu pokoleniyu MMORPG yavlyayas, na ravne s igroj Everquest I, praroditelnitsej 90% sovremennyh MMORPG vtorogo pokoleniya.Otlichitelnoj osobennostyu igry yavlyaetsya ogromnyj funktsional, svoboda vybora i povedeniya. K primeru, takie izvestnye i lyubimye mnogim igry kak World of Warcraft i Lineage 2 ne imeyut dazhe 30% ot vozmozhnostej i funktsionala Ultima Online.YAvlyayas hardkorno-PVP orientirovannoj, ona, pri etom, predstavlyaet naibolshuyu svobodu dlya lyubitelej PVE i PVM, chem lyubaya iz kogda-libo vyhodivshih onlajn igr.\n\nSlovom, eta ta igra, poigrat v kotoruyu stoit hotya by radi interesa. ZHivaya legenda mira MMORPG igr, prikosnutsya k kotoroj Vy mozhete na nashem besplatnom servere The World. ","torrent":{"xt":"urn:btih:a70d9aedfcf25e4aad0fa63fd24245dc0637e965","amp;dn":"Ultima+Online+-+Polnyj+komplekt+dlya+igry+na+servere+The+World.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a70d9aedfcf25e4aad0fa63fd24245dc0637e965","infoHashBuffer":{"type":"Buffer","data":[167,13,154,237,252,242,94,74,173,15,166,63,210,66,69,220,6,55,233,101]},"announce":[],"urlList":[]}}