{"title":"Hoobastank - The Reason [MP3 192 Kbps] TNT Village","uid":5821600,"size":60910567,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a781838a20a9728b7b59744b3127a924044cc12a&amp;dn=Hoobastank+-+The+Reason+%5BMP3+192+Kbps%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":15,"time":1284079005,"description":"Hoobastank - The Reason [MP3 192 Kbps] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=38832&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=38832&lt;/a&gt;\n\nFor The Reason, those nice suburban Californians in Hoobastank refine and shade in the concentric circles of their self-titled debut, but stay safely within its platinum figure eight. &quot;Crawling in the Dark&quot; was the contoured heart of that album. Its combination of enormous rock chorus and elastic dreamboat vocals made Hoobastank stars and established their sound -- not original, but firmly rooted in the rousing voice of Doug Robb and guitarist Dan Estrin's slick post-grunge concoctions. Despite the usual pressure to produce another &quot;Crawling,&quot; the songwriting duo seems to have largely been left alone for The Reason. Naturally, the presence of boffo big producer Howard Benson ensures the album's impeccable sonic accessibility. Robb's voice breaks at just the right time and for maximum emotional resonance, while the music ebbs and flows effortlessly between aggressive rockers and more introspective material. But for the most part, what you hear is what you get. Strings do pop up on a few songs, and here and there the harmonies seem too rich for reality. But these additional elements never overshadow the foursome's work. The strings punch up &quot;Lucky&quot;'s already uplifting chorus (the acoustic verses are a nice touch, too), while they're a lush bed of down pillows for the somewhat sappy title track. It's not that Robb's words throughout The Reason aren't genuine. Lyrics like &quot;I'm not a perfect person, I never meant to do those things to you,&quot; &quot;So what should I do, just lay next to you as though I'm unaffected?,&quot; and &quot;There has to be somewhere that we can be safe from the lives we live each day&quot; are delivered with real feeling. However, Hoobastank is still reducing teen angst (over love, escape, or a higher power) to digestible phrases, and writing sandpaper smooth rock symphonies around those couplets. So it's a formula, and one that remains unchanged from the debut. But Robb, Estrin, bassist Markku Lappalainen, and drummer Chris Hesse are a better band now -- endless touring will do that. &quot;Same Direction&quot; and &quot;Just One&quot; are standout anthems, raucous and righteous all at once. Lead single &quot;Out of Control&quot; lets Robb and Estrin shriek and shred with some reckless (yet still melodic and ready for radio) aggression. Meanwhile, the other, softer side of the band is represented best by &quot;What Happened to Us?&quot; and the drifting departure &quot;Disappear,&quot; which both unfold as much more focused versions of Hoobastank's sometimes clunky attempts at nuance (think &quot;To Be With You&quot;). In the end, The Reason is really a better version of Hoobastank, written and played by more mature versions of Hoobastank. ~ Johnny Loftus, All Music Guide\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img152.imageshack.us/img152/8137/hoobastankthereason5il.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img152.imageshack.us/img152/8137/hoobastankthereason5il.gif&lt;/a&gt;\n\n.: TrackList :.\n\n1. Same Direction\n2. Out Of Control\n3. What Happened To Us?\n4. Escape\n5. Just One\n6. Lucky\n7. From The Heart\n8. The Reason\n9. Let It Out\n10. Unaffected\n11. Never There\n12. Disappear","torrent":{"xt":"urn:btih:a781838a20a9728b7b59744b3127a924044cc12a","amp;dn":"Hoobastank+-+The+Reason+%5BMP3+192+Kbps%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a781838a20a9728b7b59744b3127a924044cc12a","infoHashBuffer":{"type":"Buffer","data":[167,129,131,138,32,169,114,139,123,89,116,75,49,39,169,36,4,76,193,42]},"announce":[],"urlList":[]}}