{"title":"Coast To Coast Am - 08-23-10 - Cancer Cures","uid":5787821,"size":55858605,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a7d2159587279ca6f7c1e1851516e098ad648103&amp;dn=Coast+To+Coast+Am+-+08-23-10+-+Cancer+Cures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1282715863,"description":"Date:\n 08-23-10\n \nHost:\n George Noory\n \nGuests:\n Dr. Leonard Coldwell, Craig Webb, James Cameron \n \n\n\nSharing his natural cures for cancer, Dr. Leonard Coldwell declared that every cancer is curable within 2-16 weeks. Stress is a major source of cancer (the malfunctioning of cells), and the disease is fostered when the body is overly acidic which makes it prone to fungal conditions, he explained. Treatments like surgery, chemotherapy, and radiation are more likely to make a patient worse, he warned. Further, he noted that cancer is the main money maker in the medical field, with $400,000 to $1.8 million spent on an individual patient from diagnosis to death. \n\nAmong his recommendations for general health and for cancer sufferers: \n\n-Cancer patients can take food-grade hydrogen peroxide drops mixed in distilled water or aloe vera juice.\n-Hemp oil can be rubbed on skin cancer.\n-Stay away from artificial sweeteners, refined sugar, and high fructose corn syrup.\n-Don't drink milk.\n-Don't cook foods in the microwave.\n-Eliminate exposure to electromagnetic frequencies such as from cell phones, by wearing devices like the EP2 pendant.\n-Put filters on shower heads to reduce toxins.\n-Websites awesomesupplements.com and helpingamericanow.com are good sources for supplements.\n-A special site he set up to get more info: healthfreedomnetwork.com. \nAvatar &amp; Dreams\nFirst hour guests, director James Cameron and Craig Webb, of the Dreams Foundation, talked about dreams and the creativity process. In making Avatar, &quot;I was trying to achieve a kind of waking dream state for the audience, and the 3D was part of that,&quot; as well as the use of flight and phantasmagorical images, said Cameron. Years ago, his mother had a remarkable dream about a 12-ft tall blue-skinned goddess/warrior, and he made a painting of it. &quot;I was just swirling together a lot of things when I wrote Avatar,&quot; he added. \n\n\nWebsite(s):\n-drleonardcoldwell.com\n-instinctbasedmedicine.com\n-dreams.ca\nBook(s):\n-The Only Answer to Cancer","torrent":{"xt":"urn:btih:a7d2159587279ca6f7c1e1851516e098ad648103","amp;dn":"Coast+To+Coast+Am+-+08-23-10+-+Cancer+Cures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d2159587279ca6f7c1e1851516e098ad648103","infoHashBuffer":{"type":"Buffer","data":[167,210,21,149,135,39,156,166,247,193,225,133,21,22,224,152,173,100,129,3]},"announce":[],"urlList":[]}}