{"title":"Vso Convertxtodvd v4.1.1.334+Keygen","uid":5781025,"size":19246039,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a892514699ffe0468123f1f287213cf3191eed18&amp;dn=Vso+Convertxtodvd+v4.1.1.334%2BKeygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Slickinator","files":3,"time":1282403771,"description":"ConvertXtoDVD - 4.1.1.334 \n\nKey Features\n\n    * Video formats supported: avi, divx, xvid, mov, mkv, flv, mpeg-1, mpeg2-, mpeg-4, nsv, dvr-ms, tivo, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec download\n    * Create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus\n    * Conversion advisor wizard, control of the conversion speed vs. quality\n    * Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n    * Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats and Some Blueray Support\n    * Custom and or automatic chapter creation with markers and preview window\n    * Advanced file merging possibilities\n    * Audio formats supported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more...\n    * Subtitles files supported internal and external: SRT, .SUB/IDX, .SSA with color and font selection, and supports tags like italic, bold\n    * Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Boradcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n    * Video post processing settings like video resize-pad/cropping and de-interlacing options\n    * Multilingual support available languages...\n    * Optimized for Windows 2000 / XP / Vista.\n\n\nConvertXtoDVD changes history\n\n\nConvertXtoDVD - 4.1.1.334 (Released 2010-08-17)\n===============================================\n\nMinor regression fixes from version 4.1.0.333 \n\n- 0003163: [Feature Request] link to BatchXtoDVD from File menu (wesson) - resolved.\n- 0003771: [Bug] Template Selector in the main window displays all black, cannot preview templates ! (wesson) - resolved.\n\ntraduction FranÃƒÂ§aise mise ÃƒÂ  jour\n\n\nConvertXtoDVD - 4.1.0.333 \n==========================\n\n* Update FFMPEG library to revision 23153\n* interface cleanup, make it easier to use without a mouse\n* fix support of RAW video (RGB24 or YUV)\n* fix many issues with the audio rendering and sync in AVI files\n* other minor bugfixes\n* updated EULA's for LGPL compliance\n\n- 0002877: [Information] Converting MP4 file (h264/AAC) / Get Audio sync messages in the logs, did not occur on older builds/versions (annelise) - resolved.\n- 0002868: [Bug] Some MPEG2 files are no longer recognized by Convertxtodvd (wesson) - resolved.\n- 0002891: [Bug] regression out of sync avi (worked in 3.6.13) - resolved.\n- 0002892: [Bug] out of memory (wesson) - resolved.\n- 0002904: [Bug] Audio sync message with Avi file (wesson) - resolved.\n- 0002918: [Bug] Regression : No audio when converting some MP4 files with AAC audio streams. (wesson) - resolved.\n- 0003095: [Bug] image split in half and inversed in preview and final result (wesson) - resolved.\n- 0002923: [Bug] Bad conversion when the source is an uncompressed RGB24 AVI files. (wesson) - resolved.\n- 0003154: [Bug] no decodable video stream (wesson) - resolved.\n- 0003217: [Unsupported file/stream format] regression, noload: Stream #0 (video) - Codec tag &quot;&quot; unsupported (wesson) - resolved.\n- 0003303: [Unsupported file/stream format] v4 can no longer convert this video stream / Video: Raw video, yuyv422 (wesson) - resolved.\n- 0003370: [Crash] Crash Access Violation converting some wmv files (wesson) - resolved.\n- 0003747: [Bug] v4.1.0.322 regression no audio on 2 files in test validation 2 (wesson) - resolved.\n- 0003431: [Bug] regression, ccess violation at address 00403623 in module 'ConvertXtoDvd.exe'. Read of address 076557C5] while reading packet 0000001 (wesson) - resolved.\n- 0003193: [Bug] Regression: bug 0002451 returned and DVD playback loops continu on No Menu template (wesson) - resolved.\n- 0003765: [Unsupported file/stream format] green screen with MXF file (wesson) - resolved.\n- 0003233: [Feature Request] remove option complete from convertxtodvd &quot;Add original files to DVD&quot; (wesson) - resolved.\n- 0003226: [Bug] detect the partition type and inform the user of file system limitations (wesson) - resolved.\n- 0003182: [Suggestion] Add text to hintbox &quot;skip root menu initially&quot; at DVD options (wesson) - resolved.\n- 0003737: [Bug] about window not compatible with notebooks (wesson) - resolved.\n- 0002056: [Feature Request] add text next to menu template Black Mirror with video (wesson) - resolved.\n- 0003192: [Bug] Double separation for Width / Height in log (typo) (wesson) - resolved.\n- 0001868: [Bug] Menu text style editor does not save new created style (wesson) - resolved.\n- 0003018: [Bug] v3.8.0.193k bad audio on converted file (wesson) - resolved.\n- 0003745: [Feature Request] special setting for 12 core (wesson) - resolved.\n- 0002880: [Bug] after conversion the file play much much faster (wesson) - resolved.\n- 0003195: [Feature Request] Add DVD Options to log for No Menu template (wesson) - resolved.\n- 0003101: [Bug] English / french mix in log files (wesson) - resolved.\n- 0003094: [Bug] For the 3rd time editing &quot;DVD menu labels&quot; broken. (wesson) - resolved.\n- 0003099: [Bug] dvd menu labels menu dialog ( double click broken ) (wesson) - resolved.\n- 0003748: [Bug] v4.1.0.322 regression audio out of sync - test validation 2 file &quot;0000627 [NOSOUND] 3642_4_4044.swf&quot; (wesson) - resolved.\n- 0003216: [Feature Request] activate tabstop and set tab order in all setting sections (wesson) - resolved.\n- 0003710: [Feature Request] change link of buy button (wesson) - resolved.\n- 0003724: [Bug] cannot cancel a conversion correctly when conversion freezes - must end with task manager (wesson) - resolved.\n- 0003734: [Bug] does not know how to convert more than 1 file (or depending on order...?) (wesson) - resolved.\n- 0003723: [Bug] menu does not display correctly (wesson) - resolved.\n- 0003059: [Feature Request] Prevent Windows 7 from going to sleep when converting (wesson) - resolved.\n- 0003038: [Bug] Safe view area differs in size from the one shown in v3. (wesson) - resolved.\n- 0003102: [Bug] Undue &quot;Video processing failed to init on stream 0000001&quot; (wesson) - resolved.\n- 0003124: [Crash] Transcoder has stopped working when pressing on red X / after having changed font for menus (wesson) - resolved.\n- 0003134: [Bug] Video processing failed to init on stream 0000001 when cropping merged files (wesson) - resolved.\n- 0003673: [Suggestion] make some treeview items clickable (in the case virtual treeview doesnt work) (wesson) - resolved.\n- 0003116: [Crash] Assertion failed! Program: C:\\vsoffmpeg\\libavcodec\\/motion_est_template.c (wesson) - resolved.\n[43 issues]\n\n\n","torrent":{"xt":"urn:btih:a892514699ffe0468123f1f287213cf3191eed18","amp;dn":"Vso+Convertxtodvd+v4.1.1.334%2BKeygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a892514699ffe0468123f1f287213cf3191eed18","infoHashBuffer":{"type":"Buffer","data":[168,146,81,70,153,255,224,70,129,35,241,242,135,33,60,243,25,30,237,24]},"announce":[],"urlList":[]}}