{"title":"Stargate SG-1 S09 D1 PAL 2Lions-Team","uid":5815366,"size":4691100361,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ab5c1c096e59fb12a3ae404c7671e2864b4aadb6&amp;dn=Stargate+SG-1+S09+D1+PAL+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wietseherman","files":-1,"time":1283799887,"description":"Stargate SG-1 S09 D1 PAL 2Lions-Team\n\nAvalon - Part1 - Cameron Mitchell krijgt de leiding, maar het blijkt dat hij een heel nieuw team moet formeren. Met Vala Mal Doran, Daniel Jackson en Teal'c ontdekt hij een Arthuriaanse tombe.\n\nAvalon - Part2 - aniel en Vala Mal Doran verplaatsen zich met een Communicatieapparaat van de Ouden (Ancient Communication Device) telepathisch naar een ander sterrenstelsel. Daar maken ze kennis met de religie Origin.\n\nOrigin - Part3 - SG-1 maakt kennis met de Ori (Stargate) en hun Priors (Voorgangers) met de Doci aan het hoofd.\n\nThe Ties That Bind - SG-1 gaat op een scavenger hunt om de band tussen Vala en Daniel, die door middel van Goa'uld-technologie aan elkaar gekoppeld zijn, te verbreken.\n\n\nAvalon - Part1 - Lt. Colonel Cameron Mitchell  is recruited by the SGC as leader of SG-1 but finds the original SG-1 has disbanded. Trying to find out how to bring them back together, Vala Mal Doran  arrives with an artifact which could reveal an ancient treasure, and he finds this is his only opportunity to reunite the team. \n\nAvalon - Part2 - After passing all of the tests found in Avalon, the makeshift SG-1 discovers the treasure, along with an Ancient  long-range communication device. Hoping to find actual Ancients, Daniel and Vala are given control of the bodies of two people in a distant galaxy\n\nOrigin - Part3 - When Daniel and Vala follow a mysterious man to find answers to their questions, they discover the Ori. The Ori, like the Ancients, are ascended beings, but pure evil entities that feel the need to be worshipped. \n\n\nThe Ties That Bind - Hoping to disconnect the kor mak bracelet (&quot;Avalon&quot;), Daniel, Teal'c, Mitchell, and Vala try to pry the information out of the person she stole them from in the first place.\n\n\nSource : retail\nFormat : DVD5\nVideo : Pal\nSound : DD 5.1\nLanguages : EN\nMenu : Yes\nExtra : No\nSubs : Hindi Greek English Dutch\n\nWeblink: http://www.imdb.com/title/tt0118480/\n\nBrought to you by\nB2B\n2Lions Team, Film Terminal\n\nmeer zien??\nKom dan eens kijken op een van onze site's\n &lt;a href=&quot;\nhttp://2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://2lions-site.nl/index.php&lt;/a&gt;\n\nof\n &lt;a href=&quot;\nhttp://www.film-terminal.org/forum/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.film-terminal.org/forum/index.php&lt;/a&gt;\n\n\n2Lions-Team and Film Terminal for all your Dutch MOVIES and more\n\n*****************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n\n*****************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team and Film Terminal are not responsible for the fake posts on our name\n\nWij 2Lions-Team en Film Terminal zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site's !!!\nto the fakers , get a life !!!\n\n*****************************************************","torrent":{"xt":"urn:btih:ab5c1c096e59fb12a3ae404c7671e2864b4aadb6","amp;dn":"Stargate+SG-1+S09+D1+PAL+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab5c1c096e59fb12a3ae404c7671e2864b4aadb6","infoHashBuffer":{"type":"Buffer","data":[171,92,28,9,110,89,251,18,163,174,64,76,118,113,226,134,75,74,173,182]},"announce":[],"urlList":[]}}