{"title":"ALphaSim Rutan","uid":5803641,"size":39827133,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ac305970ee4c07bad9eee2dd3e08d780b61f104c&amp;dn=ALphaSim+Rutan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Trevers","files":1,"time":1283365422,"description":"You could be forgiven, perhaps, if the first thing you thought when you saw the Rutan Long-EZ was that it looked more like it belonged in a science fiction film as a fighter than at your local GA airfield. That's where you'll find one, though. Parked between the ever-present Piper PA-28 or Cessna 172 and the mysterious little red kitplane that no-one can quite identify is a real-world X-Plane, a &quot;pocket rocket&quot; pusher canard monoplane with the vertical stabilisers at the end of the wings and - somewhat disconcertingly - what appears to be the wheel off a shopping trolley under the nose.\n\nThe out-of-this-world design, however, becomes a little less unexpected when you read a little about the aircraft's designer, Burt Rutan. Between Burt and his brother Dick, the Rutan name is more than a little well known in aviation circles. Possibly the brothers' most famous collaboration was the non-stop around the world flight in 1986 of the Voyager, developed by Burt and flown by Dick and his partner, Jeana Jeager (no relation to Chuck, I'm told). Burt Rutan, however, is also famous as the developer of SpaceShipOne which won the X-Prize for a privately funded sub-orbital spacecraft and many other weird and wonderful designs. A quick look around the website of Scaled Composites, the company Burt Rutan founded in 1982, shows the Long-EZ to in fact be one of the more conservative aircraft he's ever come up with!\n\nUnfortunately the Long-EZ plans are no longer available and the Rutan Aircraft Factory now only exists to support those who haven't finished building their aircraft yet, but the aircraft that were sold and built are still flying in the real world and now, courtesy of Alphasim, in the FS world too.","torrent":{"xt":"urn:btih:ac305970ee4c07bad9eee2dd3e08d780b61f104c","amp;dn":"ALphaSim+Rutan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac305970ee4c07bad9eee2dd3e08d780b61f104c","infoHashBuffer":{"type":"Buffer","data":[172,48,89,112,238,76,7,186,217,238,226,221,62,8,215,128,182,31,16,76]},"announce":[],"urlList":[]}}