{"title":"Godzilla(1998)DVDRip.AC3(ENG)-DROCK","uid":6372467,"size":733402717,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:acd9ccb47e299cc234c2a0fa3b0cb7ebacb3136e&amp;dn=Godzilla%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1304727360,"description":"Dedicated to Tomoyuki Tanaka (1910-1997), who produced the 1954 original and sequels, the Devlin/Emmerich interpretation displays a redesign of Godzilla, now a large lizard mutated after fallout from French nuclear tests. A blinding flash of white light fills the Eastern sky. Thousands of miles away, the Pacific Ocean churns, engulfing a freighter. On another part of the globe, giant footsteps plow a path through miles of Panamanian forests, Tahitian villages, and Jamaican beaches. In the Ukraine, biologist Dr. Niko Tatopoulos (Matthew Broderick), with the U.S. Nuclear Regulatory Commission, is examining the impact of radiation on Chernobyl earthworms. Colonel Hicks (Kevin Dunn) and a military team escort Niko to check out giant claw marks on the beached freighter; they're joined by paleontologists Elsie Chapman (Vicki Lewis) and Mendel Craven (Malcolm Danare). Blood and giant-size footprints indicate &quot;some sort of enormous reptile.&quot; French secret agent Philippe Roache talks to the freighter's only survivor, who keeps repeating, &quot;Gojira...Gojira.&quot; Tatopoulos et al arrive in Manhattan's Fulton Fish Market where Godzilla surfaces, moving on to the NYC financial district where Mayor Ebert (Michael Lerner) is speaking. Ambitious Audrey Timmonds (Maria Pitillo), who works for TV news anchor Charles Caiman (Harry Shearer), is Niko's former girlfriend, and she uses this to her professional advantage. As the wave of destruction continues, Niko and Roache track the creature through the evacuated city and discover Godzilla's eggs about to hatch in Madison Square Garden. They are followed by Audrey and TV cameraman Victor &quot;Animal&quot; Palotti (Hank Azaria), and soon the hatching Godzilla offspring prowl the Garden corridors, leading to a final showdown. \n\nRipped with Handbrake.\n\nLength: 2 Hours 18 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:acd9ccb47e299cc234c2a0fa3b0cb7ebacb3136e","amp;dn":"Godzilla%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd9ccb47e299cc234c2a0fa3b0cb7ebacb3136e","infoHashBuffer":{"type":"Buffer","data":[172,217,204,180,126,41,156,194,52,194,160,250,59,12,183,235,172,179,19,110]},"announce":[],"urlList":[]}}