{"title":"swiftlinux-diet-0_1_1.iso","uid":6478248,"size":557717504,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:aebb86a861c4b80451013f88a1c338f7cb515576&amp;dn=swiftlinux-diet-0_1_1.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1308357023,"description":"The Top Four Benefits\nSWIFT: Swift Linux requires just 128 MB of RAM (256 MB recommended), which is ridiculously low even by Linux standards. If your computer is fast enough for Windows 98 or Puppy Linux, it's fast enough for Swift Linux.\nSOFTWARE SELECTION: Swift Linux is compatible with the Debian software repository, which contains over 20,000 FREE software packages. The Puppy Linux repository cannot compete with this.\nUSER-FRIENDLY: Swift Linux includes a GUI environment and clickable icons on the screen (just like Puppy Linux and Linux Mint). Even Jessica &quot;Chicken of the Sea&quot; Simpson could get up to speed with Swift Linux.\nALL OF THE ABOVE: Only Swift Linux offers the unique combination of speed, software selection, and user-friendliness. Other Linux distros can compete with Swift Linux on one or two of the above criteria, but they all fall far short on at least one.\n\nAdditional Benefits\nSTABLE EVEN BY LINUX STANDARDS: Swift Linux has roots in Debian's Testing branch. Ubuntu and Linux Mint are based on Debian's Unstable branch.\nECONOMICAL: Swift Linux is even more economical than most other Linux distros. Because of its extremely low hardware requirements, Swift Linux runs on old computers that are too slow for Ubuntu, Linux Mint, and many other distros. Swift Linux allows you to use an older and cheaper computer or to keep a new computer longer. This is one of the few Linux distros that work well on a 10-year-old computer.\nBETTER FOR THE ENVIRONMENT: Swift Linux allows you to keep your old computer running longer than most other distros. This means less electronic waste, which all too often ends up in the landfills of Third World countries with inferior, unenforced, or nonexistent environmental laws. Fewer purchases of new computers means less consumption of natural resources and less pollution generated in the manufacturing process.\n  &lt;a href=&quot;\nhttp://distrowatch.com/table.php?distribution=swift&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://distrowatch.com/table.php?distribution=swift&lt;/a&gt; &lt;a href=&quot;\nhttp://swiftlinux.org/node/1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://swiftlinux.org/node/1&lt;/a&gt;  &lt;a href=&quot;\nhttp://swiftlinux.org/about&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://swiftlinux.org/about&lt;/a&gt;  &lt;a href=&quot;\nhttp://swiftlinux.org/discuss&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://swiftlinux.org/discuss&lt;/a&gt;\n\nc034bb17709e75789c663b8d6a702c68  swiftlinux-diet-0_1_1.iso","torrent":{"xt":"urn:btih:aebb86a861c4b80451013f88a1c338f7cb515576","amp;dn":"swiftlinux-diet-0_1_1.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebb86a861c4b80451013f88a1c338f7cb515576","infoHashBuffer":{"type":"Buffer","data":[174,187,134,168,97,196,184,4,81,1,63,136,161,195,56,247,203,81,85,118]},"announce":[],"urlList":[]}}