{"title":"Democracy Now - 02 sep 2010","uid":5806029,"size":456007403,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:af659154b30bef561a9c42ef98f81e848fbdad76&amp;dn=Democracy+Now+-+02+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1283447910,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 02, 2010\n\n- Palestinians: Obama Vows to &quot;Stop the Settlements&quot;\n- Biden Marks Nominal End to U.S. Combat Operations in Iraq\n- Over 60 Killed in Pakistan Airstrikes\n- Justice Dept. Charges Mehsud With CIA Bombing in Afghanistan\n- UN Increases Estimate of DRC Rape Victims\n- Evacuations Ordered in N.C. Ahead of Hurricane Earl\n- Armed Suspect Killed After Taking Hostages at Discovery Channel\n- Judge Rejects Dismissal of Suit to Overturn Drilling Ban\n- Recession Spurs Sharp Decline in Undocumented Immigration\n- Wyoming Town Near Drilling Told Drinking Water Unsafe, Potentially Explosive\n- Lawyer: Mental Health of Alleged Leaker Was Questioned\n\n\nSpecial reports\n\n- As Pakistan Floods Continue Moving South, Calls for Debt Cancellation Grow\n\nIn Pakistan, torrential rains a month ago that triggered unprecedented floods have moved steadily from north to south, engulfing a fifth of the country. Seventeen million people have been affected and some five million have lost their homes. Meanwhile, a movement to cancel Pakistan's external debt is now underway as campaigners plan a protest in front of Pakistan's parliament house today to call on international institutions like the IMF to cancel the country's debt.\n\n\n- After Years of Organizing, Domestic Workers Win Bill of Rights Law in New York\n\nNew York Governor David Paterson has signed into law a measure establishing a landmark set of working standards for housekeepers, nannies and other domestic workers. With the signing of the Domestic Workers Bill of Rights, New York becomes the first state where domestic workers will be guaranteed overtime pay after a forty-hour workweek, at least one day off per week, and at least three days off with full pay per year.\n\n\n- Appeals Court Ruling Allows Government to Use GPS to Track People's Moves\n\nA federal court in California has issued a ruling that's raising widespread alarm among advocates for civil liberties. Earlier this month, the U.S. Court of Appeals for the Ninth Circuit said law enforcement agents can sneak onto a person's property, plant a GPS device on their vehicle, and track their every movements. The court's ruling means the spying is legal in California and eight other Western states.\n\n\n- Alexander Zaitchik on &quot;Common Nonsense: Glenn Beck and the Triumph of Ignorance&quot;\n\nGlenn Beck organized a much-publicized &quot;Restoring Honor&quot; rally on Saturday in front of the Lincoln Memorial in Washington DC. Beck's fans reportedly number in the millions and Saturday's rally drew nearly 100,000 supporters. We speak with Alexander Zaitchik, author of Common Nonsense: Glenn Beck and the Triumph of Ignorance.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:af659154b30bef561a9c42ef98f81e848fbdad76","amp;dn":"Democracy+Now+-+02+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af659154b30bef561a9c42ef98f81e848fbdad76","infoHashBuffer":{"type":"Buffer","data":[175,101,145,84,179,11,239,86,26,156,66,239,152,248,30,132,143,189,173,118]},"announce":[],"urlList":[]}}