{"title":"Gladiator(2000)DVDRip.AC3(ENG)-DROCK","uid":6371956,"size":733354811,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af956ea0ee668a0d0d3d87c99e1cba86dc630734&amp;dn=Gladiator%282000%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1304707922,"description":"A man robbed of his name and his dignity strives to win them back, and gain the freedom of his people, in this epic historical drama from director Ridley Scott. In the year 180, the death of emperor Marcus Aurelius (Richard Harris) throws the Roman Empire into chaos. Maximus (Russell Crowe) is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus (Joaquin Phoenix) ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences. His battle skills serve him well, and he becomes one of the most famous and admired men to fight in the Colosseum. Determined to avenge himself against the man who took away his freedom and laid waste to his family, Maximus believes that he can use his fame and skill in the ring to avenge the loss of his family and former glory. As the gladiator begins to challenge his rule, Commodus decides to put his own fighting mettle to the test by squaring off with Maximus in a battle to the death. Gladiator also features Derek Jacobi, Connie Nielsen, Djimon Hounsou, and Oliver Reed, who died of a heart attack midway through production. \n\nRipped with Handbrake.\n\nLength: 2 Hours 35 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:af956ea0ee668a0d0d3d87c99e1cba86dc630734","amp;dn":"Gladiator%282000%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af956ea0ee668a0d0d3d87c99e1cba86dc630734","infoHashBuffer":{"type":"Buffer","data":[175,149,110,160,238,102,138,13,13,61,135,201,158,28,186,134,220,99,7,52]},"announce":[],"urlList":[]}}