{"title":"Glee Cast - Faithfully (2nafish)","uid":5810589,"size":88199172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b003924fce17cc3483bcdf4dece268f798412f75&amp;dn=Glee+Cast+-+Faithfully+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283611393,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Faithfully&quot; is a popular song and power ballad by the band Journey, and the second single from their album Frontiers. It peaked at #12 on the Billboard Hot 100, giving the band their second consecutive top twenty hit from Frontiers. The music and lyrics were written by keyboardist Jonathan Cain. While the song was relatively successful on the charts, it has gone onto become one of their most recognizable songs, and has enjoyed lasting popularity.\n\n&quot;Journey&quot;, also known as &quot;Journey to Regionals&quot;, is the twenty-second episode and first season finale of the American television series Glee. The episode was written and directed by series creator Brad Falchuk, and premiered on the Fox network on June 8, 2010. In &quot;Journey&quot;, New Directions performs at Regionals in front of celebrity judges Josh Groban, Olivia Newton-John, Rod Remington (Bill A. Jones) and Sue Sylvester (Jane Lynch). Club member Quinn (Dianna Agron) gives birth to her daughter, Beth, whom rival glee club coach Shelby Corcoran (Idina Menzel) adopts. Co-captains Finn (Cory Monteith) and Rachel (Lea Michele) reunite, and director Will Schuester (Matthew Morrison) professes his love for guidance counselor Emma Pillsbury (Jayma Mays). Although New Directions comes in last in the competition, Sue persuades Principal Figgins (Iqbal Theba) not to disband the club for another year.\n\nThe episode features cover versions of nine songs, seven of which are included on the EP Glee: The Music, Journey to Regionals, released on June 8, 2010. The album charted at number one in America, setting the record for the shortest span between first weeks at the top of the Billboard 200 with different releases, charting only three weeks after the soundtrack album Glee: The Music, Volume 3 Showstoppers also reached number one. While &quot;Journey&quot; is the first episode of Glee to have none of its musical performances released as singles, all six EP tracks charted on the Billboard Hot 100 and the Canadian Hot 100.\n\nWhen cheerleading coach Sue Sylvester announces that she will be one of the judges at Regionals, along with Josh Groban, Olivia Newton-John, and local news anchor Rod Remington, the glee club members worry that New Directions will soon be disbanded. Principal Figgins stands by his condition that glee club must place at Regionals to continue, despite club director Will Schuester's protestation that Sue is attempting to sabotage them. Will turns to guidance counselor Emma Pillsbury, who reveals that she has begun dating her dentist, Carl Howell.\n\nRachel kisses Finn when he encourages her to be more optimistic. At Regionals, Aural Intensity is first to perform, singing a mash-up of &quot;Magic&quot; by Olivia Newton-John and &quot;You Raise Me Up&quot; by Josh Groban. Will gives New Directions a pep talk, and Finn professes his love for Rachel just before going on stage. The club pays tribute to Journey, performing &quot;Faithfully&quot;, a mash-up of &quot;Any Way You Want It&quot; and &quot;Lovin' Touchin' Squeezin'&quot;, and &quot;Don't Stop Believin'&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b003924fce17cc3483bcdf4dece268f798412f75","amp;dn":"Glee+Cast+-+Faithfully+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b003924fce17cc3483bcdf4dece268f798412f75","infoHashBuffer":{"type":"Buffer","data":[176,3,146,79,206,23,204,52,131,188,223,77,236,226,104,247,152,65,47,117]},"announce":[],"urlList":[]}}