{"title":"Statler Brothers","uid":5793231,"size":157906336,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b01bdd859d28eb4d31fc4bb822588c0ea7dfcce0&amp;dn=Statler+Brothers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"freedomp","files":55,"time":1282935222,"description":"The Statler Brothers are an American country music group founded in 1955 in Staunton, Virginia.\n\nOriginally, performing gospel music at local churches, the group billed themselves as &quot;The Four Stars&quot; and later as &quot;The Kingsmen&quot;.[1] In 1963, when the song &quot;Louie, Louie&quot; by the garage rock band also called The Kingsmen became famous, the group elected to bill themselves as The Statler Brothers. Despite the newest name, just two of its four members are brothers, and none of them are named &quot;Statler&quot;. The band, in fact, named themselves after a brand of facial tissue (they have joked that they could have turned out to be the Kleenex Brothers[2]). Don Reid sang lead and is the younger brother of Harold Reid, who sang bass. The other members were baritone Phil Balsley and tenor Jimmy Fortune, who replaced original Statler Lew DeWitt in the early 1980s due to the latter's ill health.[3] DeWitt died on August 15, 1990 of heart and kidney disease, complications of Crohn's disease.[4]\n\nThe band's style was closely linked to its gospel roots. Harold Reid said of the group's style &quot;We took gospel harmonies and put them over in country music&quot;.[1]\n\nThe group remained closely tied to their roots in gospel music, with a majority of their records containing at least one gospel song. They produced several albums containing only gospel music, and recorded a tribute song to the Blackwood Brothers, who influenced their music.[1]\n","torrent":{"xt":"urn:btih:b01bdd859d28eb4d31fc4bb822588c0ea7dfcce0","amp;dn":"Statler+Brothers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b01bdd859d28eb4d31fc4bb822588c0ea7dfcce0","infoHashBuffer":{"type":"Buffer","data":[176,27,221,133,157,40,235,77,49,252,75,184,34,88,140,14,167,223,204,224]},"announce":[],"urlList":[]}}