{"title":"HISTORY OF POP AND ROCK MUSIC - part 260","uid":5809300,"size":452930039,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b0a6f1c0d674aa934464c8168bedc3d5f85198d0&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+260&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1283561242,"description":"                  PART  260\n\n\n        THE BEATLES  -  Long Tall Sally  (1964)\n        THE BARBARIANS  -  Hey Little Bird  (1964)\n        THE ROLLING STONES - Around &amp; Around  (1964)\n        THE ROLLING STONES -  Off The Hook  (1964)\n        THE ROLLING STONES -  I'm All Right  (1964)    \n\n        \n\n\n     &quot;Long Tall Sally&quot; is a rock and roll 12-bar blues song written by Robert &quot;Bumps&quot; Blackwell, Enotris Johnson and Richard Penniman (known as &quot;Little Richard&quot;), recorded by Little Richard and released March 1956 on the Specialty Records label.The single reached number one on the Billboard rhythm and blues chart, staying at the top for six of 19 weeks, while peaking at number six on the pop chart. It received the Cash Box Triple Crown Award in 1956. The song as sung by Little Richard is #56 on Rolling Stone's list of The 500 Greatest Songs of All Time. It became one of the singer's best-known hits and has become a rock and roll standard covered by hundreds of artists.\n     The Barbarians were an American garage band of the 1960s with a few nationally charted hits. They had their biggest hit with the novelty single &quot;Are You a Boy or Are You a Girl?&quot;. They received their biggest break when featured on The T.A.M.I. Show (performing &quot;Hey Little Bird&quot;) alongside other artists such as The Rolling Stones, The Supremes, Lesley Gore, Chuck Berry, James Brown &amp; The Famous Flames, The Miracles, and Marvin Gaye.\n     &quot;Around and Around&quot; is a 1958 rock song written by Chuck Berry.The Rolling Stones covered the song on their second US album 12 X 5 in 1964 and performed it as part of their first, October 1964, appearance on the Ed Sullivan Show.\n     &quot;Off The Hook&quot; is a song written and composed by Mick Jagger and Keith Richards, from their album &quot;The Rolling Stones, Now!&quot; It is the third American studio album by The Rolling Stones, released in 1965. &quot;The Rolling Stones, Now!&quot; is generally considered a very strong album and a highlight of their early American releases. Upon its February issuing, &quot;The Rolling Stones, Now!&quot; reached #5 in the US and became another gold seller for The Rolling Stones. In 2003, the album was ranked number 181 on Rolling Stone magazine's list of the 500 greatest albums of all time.  \n    &quot;I'm Alright&quot; is a song by Bo Diddley, covered by The Rolling Stones from their album &quot;Got Live If You Want It!&quot;.\n\n\n From Wikipedia, the free encyclopedia   ","torrent":{"xt":"urn:btih:b0a6f1c0d674aa934464c8168bedc3d5f85198d0","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+260","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0a6f1c0d674aa934464c8168bedc3d5f85198d0","infoHashBuffer":{"type":"Buffer","data":[176,166,241,192,214,116,170,147,68,100,200,22,139,237,195,213,248,81,152,208]},"announce":[],"urlList":[]}}