{"title":"When I'm Gone - Eminem (720p) [mildpoison]","uid":5782936,"size":148726192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b1075bb9a8cd1958a0a65cb9114c9951fcd3c030&amp;dn=When+I%5C%27m+Gone+-+Eminem+%28720p%29+%5Bmildpoison%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mildpoison","files":2,"time":1282482785,"description":"                                When I'm Gone - Eminem\n\n\nAbout the Artist\n\nMarshall Bruce Mathers III (born October 17, 1972), better known by his stage name Eminem (often styled &quot;EMINÃ†Å½M&quot;), is an American rapper, record producer, and actor. Eminem quickly gained popularity in 1999 with his major-label debut album, The Slim Shady LP, which won a Grammy Award for Best Rap Album. The following album, The Marshall Mathers LP, became the fastest-selling solo album in United States history. It brought Eminem increased popularity, including his own record label, Shady Records, and brought his group project, D12, to mainstream recognition.\nThe Marshall Mathers LP and his third album, The Eminem Show, also won Grammy Awards, making Eminem the first artist to win Best Rap Album for three consecutive LPs. He then won the award again in 2010 for his album Relapse, giving him a total of 11 Grammys in his career. In 2002, he won the Academy Award for Best Original Song for &quot;Lose Yourself&quot; from the film, 8 Mile, in which he also played the lead. &quot;Lose Yourself&quot; would go on to become the longest running No. 1 hip-hop single. Eminem then went on hiatus after touring in 2005. He released his first album since 2004's Encore, titled Relapse, on May 15, 2009. Eminem is the best-selling artist of the decade on the US Nielsen SoundScan, and has sold more than 80 million albums worldwide to date, making him one of the best-selling music artists in the world. In 2010, Eminem released his seventh studio album Recovery. It became Eminem's sixth consecutive number-one album in the US and achieved international commercial success, charting at number one in several other countries. It stayed at number-one on the US Billboard 200 chart for five consecutive weeks.\n\n\nDescription\n\n&quot;When I'm Gone&quot; is a song by American hip hop musician Eminem, featured on his 2005 compilation album Curtain Call: The Hits. When released as a single on December 6, 2005, the song charted at number eight on the American Billboard Hot 100 singles chart, number 22 on the Hot Rap Tracks chart, number four on the UK Singles Chart and number one on the Australian ARIA Singles Chart.\n\nPlot\n\nThe song is about Eminem's career's effect on his relationship with his wife Kim. It talks about him not being there for his daughter, Hailie, and (in a sort of metaphoric &quot;dream&quot;) Hailie confronts him at a concert in Sweden and demands to know why he was so cruel towards Kim (his ex-wife). She ends the confrontation by telling Eminem that he loves his fame, career, and fans more than his own family. After she leaves, Eminem turns around and sees a gun. He picks it up, screams &quot;Die Shady!&quot; and shoots his Slim Shady alter-ego. After that, he wakes up, realizing that it was only a dream. It's spring, Hailie's playing in the yard, and he kisses Kim.\n\n\nLyrics\n\n[Introduction]\nYeah...\nIt's my life...\nMy own words I guess...\n\n[Verse 1]\nHave you ever loved someone so much, you'd give an arm for?\nNot the expression, no, literally give an arm for?\nWhen they know they're your heart\nAnd you know you were their armour\nAnd you will destroy anyone who would try to harm 'her\nBut what happens when karma, turns right around and bites you?\nAnd everything you stand for, turns on you to spite you?\nWhat happens when you become the main source of her pain?\n&quot;Daddy look what I made&quot;, Dad's gotta go catch a plane\n&quot;Daddy where's Mommy? I can't find Mommy where is she?&quot;\nI don't know go play Hailie, baby, your Daddy's busy\nDaddy's writing a song, this song ain't gonna write itself\nI'll give you one underdog then you gotta swing by yourself\nThen turn right around in that song and tell her you love her\nAnd put hands on her mother, who's a spitting image of her\nThat's Slim Shady, yeah baby, Slim Shady's crazy\nShady made me, but tonight Shady's rocka-by-baby...\n\n[Chorus]\nAnd when I'm gone, just carry on, don't mourn\nRejoice every time you hear the sound of my voice\nJust know that I'm looking down on you smiling\nAnd I didn't feel a thing, So baby don't feel my pain\nJust smile back\nAnd when I'm gone, just carry on, don't mourn\nRejoice every time you hear the sound of my voice\nJust know that I'm looking down on you smiling\nAnd I didn't feel a thing, So baby don't feel no pain\nJust smile back...\n\n[Verse 2]\nI keep having this dream, I'm pushin' Hailie on the swing\nShe keeps screaming, she don't want me to sing\n&quot;You're making Mommy cry, why? Why is Mommy crying?&quot;\nBaby, Daddy ain't leaving no more, &quot;Daddy you're lying\n&quot;You always say that, you always say this is the last time\n&quot;But you ain't leaving no more, Daddy you're mine&quot;\nShe's piling boxes in front of the door trying to block it\n&quot;Daddy please, Daddy don't leave, Daddy - no stop it!&quot;\nGoes in her pocket, pulls out a tiny necklace locket\nIt's got a picture, &quot;this'll keep you safe Daddy, take it withcha'&quot;\nI look up, it's just me standing in the mirror\nThese fuckin' walls must be talking, cuz man I can hear 'em\nThey're saying &quot;You've got one more chance to do right&quot; - and it's tonight\nNow go out there and show that you love 'em before it's too late\nAnd just as I go to walk out of my bedroom door\nIt's turns to a stage, they're gone, and this spotlight is on\nAnd I'm singing...\n\n[Chorus]\nAnd when I'm gone, just carry on, don't mourn\nRejoice every time you hear the sound of my voice\nJust know that I'm looking down on you smiling\nAnd I didn't feel a thing, So baby don't feel my pain\nJust smile back\nAnd when I'm gone, just carry on, don't mourn\nRejoice every time you hear the sound of my voice\nJust know that I'm looking down on you smiling\nAnd I didn't feel a thing, So baby don't feel no pain\nJust smile back...\n\n[Verse 3]\nSixty thousand people, all jumping out their seat\nThe curtain closes, they're throwing roses at my feet\nI take a bow and thank you all for coming out\nThey're screaming so loud, I take one last look at the crowd\nI glance down, I don't believe what I'm seeing\n&quot;Daddy it's me, help Mommy, her wrists are bleeding,&quot;\nBut baby we're in Sweden, how did you get to Sweden?\n&quot;I followed you Daddy, you told me that you weren't leavin'\n&quot;You lied to me Dad, and now you make Mommy sad\n&quot;And I bought you this coin, it says 'Number One Dad'\n&quot;That's all I wanted, I just want to give you this coin\n&quot;I get the point - fine, me and Mommy are going&quot;\nBut baby wait, &quot;it's too late Dad, you made the choice\n&quot;Now go out there and show 'em that you love 'em more than us&quot;\nThat's what they want, they want you Marshall, they keep.. screamin' your name\nIt's no wonder you can't go to sleep, just take another pill\nYeah, I bet you will. You rap about it, yeah, word, k-keep it real\nI hear applause, all this time I couldn't see\nHow could it be, that the curtain is closing on me\nI turn around, find a gun on the ground, cock it\nPut it to my brain and scream &quot;die Shady&quot; and pop it\nThe sky darkens, my life flashes, the plane that I was supposed to be on crashes and burns to ashes\nThat's when I wake up, alarm clock's ringin', there's birds singin'\nIt's Spring and Hailie's outside swinging, I walk right up to Kim and kiss her\nTell her I miss her, Hailie just smiles and winks at her little sister\nAlmost as if to say..\n\n[Chorus/Outro]\nAnd when I'm gone, just carry on, don't mourn\nRejoice every time you hear the sound of my voice\nJust know that I'm looking down on you smiling\nAnd I didn't feel a thing, So baby don't feel my pain\nJust smile back\nAnd when I'm gone, just carry on, don't mourn\nRejoice every time you hear the sound of my voice\nJust know that I'm looking down on you smiling\nAnd I didn't feel a thing, So baby don't feel no pain\nJust smile back...\n\n[Curtains closing and sounds of clapping]  \n\n\nDetails\n\nGeneral\nFormat                           : MPEG-4\nFile size                        : 142 MiB\nDuration                         : 6mn 5s\nOverall bit rate                 : 3,256 Kbps\n\nVideo\nFormat                           : AVC\nDuration                         : 6mn 5s\nBit rate mode                    : Variable\nBit rate                         : 3,092 Kbps\nWidth                            : 1,280 pixels\nHeight                           : 688 pixels\nDisplay aspect ratio             : 1.860\nFrame rate mode                  : Constant\nFrame rate                       : 23.976 fps\nScan type                        : Progressive\nStream size                      : 135 MiB (95%)\n\nAudio\nFormat                           : AAC\nDuration                         : 6mn 4s\nBit rate mode                    : Variable\nBit rate                         : 160 Kbps\nChannel(s)                       : 2 channels\nChannel positions                : Front: L R\nSampling rate                    : 48.0 KHz\nStream size                      : 6.96 MiB (5%)","torrent":{"xt":"urn:btih:b1075bb9a8cd1958a0a65cb9114c9951fcd3c030","amp;dn":"When+I%5C%27m+Gone+-+Eminem+%28720p%29+%5Bmildpoison%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1075bb9a8cd1958a0a65cb9114c9951fcd3c030","infoHashBuffer":{"type":"Buffer","data":[177,7,91,185,168,205,25,88,160,166,92,185,17,76,153,81,252,211,192,48]},"announce":[],"urlList":[]}}