{"title":"KISS Meets The Phantom of the Park [1978-VHS2DVD]","uid":6313847,"size":4619699316,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b11b864e1fca8111fd245bc0d7a2582c39096d84&amp;dn=KISS+Meets+The+Phantom+of+the+Park+%5B1978-VHS2DVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1302631199,"description":"KISS Meets the Phantom of the Park [VHS2DVD]\nTV 1978 96min\n\nThe dynamic rock group KISS makes its feature film debut in a spine-tingling mystery that matches KISS's extra-ordinary powers against a demented genius inventor. Peter Criss (Cat Man), Ace Frehley (Space Ace), Gene Simmons (The Demon) and Paul Stanley (Star Child), collectively known as KISS, are scheduled for a sell-out concert at California's Magic Mountain amusement park when park-goers begin to vanish without a trace. Behind it all is Abner Devereaux (Anthony Zerbe), the eccentric creator of the park's life-like cybernetic creatures. When Melissa (Deborah Ryan) turns to KISS to help her find her missing boyfriend, Devereaux feels threatened and creates cybernetic KISS look-alikes! Featured is some of KISS's best music performed with stunning visual effects!\n\n\nI could only find poorly transferred versions of this movie on torrent sites, with small resolutions and audio/video sync issues. The DVD version of this movie on Amazon.com is noted as a bootleg according to feedback. So I decided to transfer my original VHS to DVD and add menus. Enjoy! -gF 4/2011","torrent":{"xt":"urn:btih:b11b864e1fca8111fd245bc0d7a2582c39096d84","amp;dn":"KISS+Meets+The+Phantom+of+the+Park+%5B1978-VHS2DVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11b864e1fca8111fd245bc0d7a2582c39096d84","infoHashBuffer":{"type":"Buffer","data":[177,27,134,78,31,202,129,17,253,36,91,192,215,162,88,44,57,9,109,132]},"announce":[],"urlList":[]}}