{"title":"Sanctum 2011 With Greek Sub","uid":6476395,"size":1513290896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b14bdcb569e32e9d6bf914afb273370e74241b8c&amp;dn=Sanctum+2011+With+Greek+Sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blaxos","files":1,"time":1308322875,"description":"Release Date: 02/04/2011 \nRating: R \nRuntime: 1 hr 43 mins \nGenre: Drama \nDirector: Alister Grierson \nCast: Richard Roxburgh, Rhys Wakefield, Ioan Gruffudd, Alice Parkinson \n \nAn intrepid team of explorers gets trapped in a complex underground cave system when a tropical storm makes it impossible to escape the same way they entered in this claustrophobic adventure drama from director Alister Grierson and executive producer James Cameron. Inspired by actual events, Sanctum tells the tale of Frank McGuire (Richard Roxburgh), a master diver intent on being the first to explore the Esa-ala cave system in the South Pacific. Shortly after Frank descends into the caves with a team that includes his teenage son, Josh (Rhys Wakefield), and expedition bankroller Carl Hurley (Ioan Gruffudd), a massive storm collapses the entrance to the system, forcing the adventurers to plunge deeper into the darkness in search of an alternate exit. With supplies quickly dwindling and water levels rapidly rising, Frank and his team surmise that their best hope for survival is to follow an underground river thought to empty into the ocean. But given that few explorers have ever even dared set foot in the Esa-ala system, no one quite knows for sure whether they're racing toward freedom, or another dead end. \n","torrent":{"xt":"urn:btih:b14bdcb569e32e9d6bf914afb273370e74241b8c","amp;dn":"Sanctum+2011+With+Greek+Sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b14bdcb569e32e9d6bf914afb273370e74241b8c","infoHashBuffer":{"type":"Buffer","data":[177,75,220,181,105,227,46,157,107,249,20,175,178,115,55,14,116,36,27,140]},"announce":[],"urlList":[]}}