{"title":"Autosport Magazine UK 19/08/2010","uid":5776120,"size":77090050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b18231b641d4bf6ac926ab22c82a26ac8bf8945b&amp;dn=Autosport+Magazine+UK+19%2F08%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thorhammer2000","files":-1,"time":1282268938,"description":"NEWS\n10 Rubens is old gold. Williams leans on Barrichello for return to winning ways\n12 Prodrive gives up on F1. David Richards has got too much on his plate for now\n14 Rookie testing anguish. Alguersuari says F1 newboys should be given more time to make their mark\n18 British F3 says no. Domestic series won't join the Europeans in 2011\n20 Fabulous 50 for 1000km. AUTOSPORT-backed Le Mans Series round at Silverstone draws superb entry\n22 HHF hangs up his hat. 'Too-slow' Frentzen quits Aussie V8 race, and the sport \n24 UK target for Mini. Prodrive challenger could make debut on BRC event\n\nREPORTS\n51 World of Sport. NASCAR; Swedish Touring Cars; German F3; Danish TC\n54 British F3 Silverstone. Vergne wins, and clinches the title two rounds early\n57 Silverstone supports. Second win for Josh Hill, as Ashburn closes on GT crown\n\nFEATURES \n26 Williams. Racing still courses through the blood of F1's purist - and purest - squad\n32 Stefan Bellof. Remembering a lost talent, 25 years after his death\n38 Jochen Rindt. You wouldn't have bet on Rindt/Gregory at Le Mans\n40 Mini in the WRC. They're bigger than they used to be, and there's nothing small about their ambitions for rally success\n44 Great car: Mini Cooper S. A 1960s phenomenon as popular as the Beatles\n46 Lydd. Brands Hatch, Lydden, Buckmore Park... There's another great track in Kent\n\nSPORTS EXTRA\n73 Racing back at Donington. It's 1977 all over again as racing is revived at one of the UK's favourite venues\n74 Audis for British GT. Anglo-American United team to field squad of R8s in UK \n80 Reports. Brands Hatch Great &amp; British; Pembrey BARC; Oullon Park BRSCC; Nurburgring Oldtimer Grand Prix\n86 National focus. We send a 28-year-old Porsche 917 fan to attend a Ginetta Junior academy\n\nREGULARS\n93 Photo finish. Pat Moss wins the Tulip Rally, 1962\n94 Race of my life. Johnny Cecotto, US Grand Prix West, 1983\n\nOCRd by Acrobat Pro 8.2","torrent":{"xt":"urn:btih:b18231b641d4bf6ac926ab22c82a26ac8bf8945b","amp;dn":"Autosport+Magazine+UK+19%2F08%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b18231b641d4bf6ac926ab22c82a26ac8bf8945b","infoHashBuffer":{"type":"Buffer","data":[177,130,49,182,65,212,191,106,201,38,171,34,200,42,38,172,139,248,148,91]},"announce":[],"urlList":[]}}