{"title":"Split Enz - Second Thoughts (1976)","uid":5795275,"size":265990000,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b182cad7df1365bbc7f6b118ec114d55c11dce24&amp;dn=Split+Enz+-+Second+Thoughts+%281976%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fireman63ed","files":-1,"time":1283015353,"description":"Second Thoughts is a 1976 album by New Zealand art rock band Split Enz. It was recorded in London with Roxy Music's guitarist Phil Manzanera producing the album. Four of the songs on the album were reworked versions of songs from their 1975 debut album Mental Notes. Two other songs on the album had been first recorded during the Mental Notes sessions, but left off and re-recorded for Second Thoughts. There were two new songs, both written by Phil Judd, and a re-recording of an early Judd/Finn composition (&quot;129&quot;), which for the Second Thoughts version, was re-named &quot;Matinee Idyll&quot;.\n\nThe album was called Mental Notes when released outside Australasia and also featured a reworked version of the Mental Notes cover (for comparison see original and remake). Wally Wilkinson's image was replaced with that of Robert Gillies, and some band members are shown with newer haircuts: Phil Judd was now bald, and Tim Finn had his sides shaved.\n\nTim Finn, Robert Gillies and Eddie Rayner have said that the band felt the songs needed to be redone. But both Phil Judd and Noel Crombie have been quoted as saying that the re-recording of the Mental Notes tracks was a waste of time. On his My Space forum Phil has been quoted as saying that Tim Finn was obsessed with making the songs sound better, while he had new songs that he wanted to record.","torrent":{"xt":"urn:btih:b182cad7df1365bbc7f6b118ec114d55c11dce24","amp;dn":"Split+Enz+-+Second+Thoughts+%281976%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b182cad7df1365bbc7f6b118ec114d55c11dce24","infoHashBuffer":{"type":"Buffer","data":[177,130,202,215,223,19,101,187,199,246,177,24,236,17,77,85,193,29,206,36]},"announce":[],"urlList":[]}}