{"title":"Beethoven - The Complete Piano Concertos - Daniel Barenboim","uid":5778743,"size":1580280343,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b3c0c839231cecc235461ca22b3a2c9c5b096311&amp;dn=Beethoven+-+The+Complete+Piano+Concertos+-+Daniel+Barenboim&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mappari","files":20,"time":1282340910,"description":"Music Videos\n: Classical : DVD quality\nIf Daniel Barenboim is not the world\\'s greatest living classical musician he is certainly the most versatile. In a career spanning more than 50 years, his name is attached to many of the celebrated recordings of opera, symphony, small ensemble and piano solo. With the latter half of his career marked by distinction at the podium, one may forget that he is still an accomplished concert pianist. Here we are treated to both talents as Barenboim conducts the Staatskapelle Berlin and plays all five of Beethoven\\'s piano concerti. From the accompanying booklet we find that Barenboim first recorded these works in 1967 at the age of 24 under Otto Klemperer. Now he is revisiting them 40 years later on the occasion of his 65th birthday.\n\nThe challenges of serving as conductor and soloist are undoubtedly considerable, but Barenboim, performing entirely from memory and without a score, makes it look easy and natural. Even while fully engaged in his role as soloist, Barenboim never loses command of the orchestra. Sometimes his direction is in the momentary freedom of a sweeping gesture of his left hand. At other times it\\'s the subtlety of his nod or the quickness of his eye. The Staatskapelle is perfectly attuned to these nuances and their playing is always on cue and never hesitant.\n\nAmong the many highlights: the wonderful exchange between piano and clarinet in the Largo of the first concerto, a thrilling account of the Rondo Vivace in the final movement of the fourth and all the beauty and majesty of the Emperor.\n\nThe performance was recorded before a live audience during a three-day piano festival in Bochum, Germany in 2007. The concerts took place in the Jahrhunderthalle, which features an architectural design from a converted steel mill. The minimalist interior with high ceiling and exposed steel beams forgoes the traditional elegance that adorns many concert halls (and the stuffy pretence that goes with it). Aesthetically, the Jahrhunderthalle stands as a venue that emphasizes comfort and clean sight lines above all. The sold-out audience is appreciative and respectful of the music. They are often in view, but rarely heard (even between movements) until their applause at the end of each work. They are smartly (if not formally) attired people who know good classical music when they hear it.\n\nSome of the performances took place during daylight hours allowing the large rear windows to cast a gorgeous natural light on the audience as well as the performers who are further illuminated by soft stage lighting that highlights the musicians and their instruments where needed and without any harsh shadows.\n\nThe full program runs at approximately 3 hours and 20 minutes.\n\n\n\nEnjoy and Seed!! ","torrent":{"xt":"urn:btih:b3c0c839231cecc235461ca22b3a2c9c5b096311","amp;dn":"Beethoven+-+The+Complete+Piano+Concertos+-+Daniel+Barenboim","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c0c839231cecc235461ca22b3a2c9c5b096311","infoHashBuffer":{"type":"Buffer","data":[179,192,200,57,35,28,236,194,53,70,28,162,43,58,44,156,91,9,99,17]},"announce":[],"urlList":[]}}