{"title":"Sergio Mendes &amp; Brasil '77 - Home Cooking (1976) [Bossa Nova][m","uid":5821560,"size":84302297,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b4724490fda7c2b0e905e6530548217e08fba360&amp;dn=Sergio+Mendes+%26+Brasil+%5C%2777+-+Home+Cooking+%281976%29+%5BBossa+Nova%5D%5Bm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"schon55","files":16,"time":1284077675,"description":"Sergio Mendes &amp; Brasil '77 - Home Cooking\nOriginal Release Date: 2007 \nAudio CD: June 5, 2007 \nLabel: Collector's Choice \nQuality: CBR 320 kbps\n\nWhat an oasis this album was for long-time Mendes fans, after the relatively barren Bell and early Elektra years. Sergio, working with a stellar rhythm section (including Wonderlove's Michael Sembello), and the superb vocals of Lise Miller, Marietta Waters and Bonnie Bowden, expertly delves into a &quot;heavier&quot; Latin sound (almost Santana-like at times) while preserving the lighter Bossa Nova sound for which he justifiably became world-famous. \n\n&quot;Homecooking&quot; has a number of standout moments, notably the opener, &quot;Sunny Day,&quot; which repeats the title chant over an increasingly infectious and complex rhythm arrangement, and an absolutely incredible cover of Elton John and Bernie Taupin's &quot;Where to Now, St. Peter?&quot;, which surely should have been a monster hit for Sergio in a just universe. But virtually every song on the album has its charms, including Gilberto Gil's &quot;Hey People Hey&quot; and &quot;Cut that Out,&quot; Bossa nova legend Carlos Lyra's &quot;It's So Obvious that I Love You,&quot; Joao Donato's haunting ode to Yoruba, &quot;Emorio,&quot; and Sembello's own proto-mystical anthem to self-determination &quot;It's Up to You.&quot; \n\nSergio had been through some extremely lean years, career-wise, by the time this album came out. &quot;Too long it took you to be happy again,&quot; goes the lyric in &quot;Hey People Hey,&quot; and it seems autobiographical. But Sergio and company sound ecstatic in this release, a great reworking of the classic Brasil '66 sound coupled with mid-70s multi-keyboards and a more propulsive rock beat, and that sound is contagious. Highly recommended to all Sergio fans. ~ JM\n\nAfter a handful of albums recorded with his latin jazzy oriented Brasil 77 such as Pais Tropical,Love Music and Vintage 74 Sergio Mendes stepped up to the plate with a brand new group called the New Brasil 77 including guitarists Michael Sembello (Stevie Wonder)and Dennis Budimir (Joni Micthell)as well as the justly renowned Louis Johnson.From that you may gather Mendes was going for a more funk/soul oriented sound and that is exactly what comes out of this.&quot;Sunny Day&quot; actually brings to mind some of the recent work of the Santana band only with the great female singers Sergio seems to always get.But if you want SERIOUS funk you'll have to go further then the light latin inflect &quot;Shakara&quot; and the monster title track that ends up album,with some of the most dangerous funk rhythm guitar you'll hear from the music of 1976.Known for his good taste in cover songs Sergio again chooses wisely,focusing this time on songs that were unsung classics but not obvious hits-in this case a bouncy version of Elton John's &quot;Where To Now St.Peter?&quot; and a creamy version of Edgar Winter's &quot;Tell Me In A Whisper&quot; from his uqually unsung Jasmine Nightdreams,also from the same period and more then worth checking out.&quot;Hey People Hey&quot; and Sembello's &quot;It's Up To You&quot; set the standard for the rest of this album-upbeat funk pop grooves with nice musical backdrops are to be found on &quot;It's So Obvious That I Love You&quot;,&quot;Emorio&quot; and &quot;Cut That Out&quot; as well.For fans of this band-somewhat of an all star mid 70's R&amp;B funk band it is certainly nice to see this in print in a non import fasion so it's afforable and people can have a chance at hearing it again!  Whatever the case this is a great album!  ~ Andre S Grindle\n\nSergio Mendes &amp; Brasil '77 - Home Cooking Tracks:\n01  Sunny Day \n02  Hey People Hey \n03  It's So Obvious That I Love You \n04  EmoriÃƒÂ´\n05  Shakara\n06  Where to Now St. Peter?\n07  Cut That Out \n08  Tell Me in a Whisper \n09  It's Up to You \n10  Home Cooking ","torrent":{"xt":"urn:btih:b4724490fda7c2b0e905e6530548217e08fba360","amp;dn":"Sergio+Mendes+%26+Brasil+%5C%2777+-+Home+Cooking+%281976%29+%5BBossa+Nova%5D%5Bm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4724490fda7c2b0e905e6530548217e08fba360","infoHashBuffer":{"type":"Buffer","data":[180,114,68,144,253,167,194,176,233,5,230,83,5,72,33,126,8,251,163,96]},"announce":[],"urlList":[]}}