{"title":"The Attractive Young Rabbi - S01 to 03 - Audio Comedy - MP3 - Sl","uid":5766493,"size":424753311,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b4cf58bdf102e8bba91bbda947603b769058ef56&amp;dn=The+Attractive+Young+Rabbi+-+S01+to+03+-+Audio+Comedy+-+MP3+-+Sl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"_Slimoo_","files":16,"time":1281928369,"description":"The Attractive Young Rabbi  - Series 01, 02, &amp; 03 - Audio Comedy - BBC7 \n16 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\nBarry Grossman's sitcom -- apparently one of the few series to be commissioned on the basis of an unsolicited submission to the BBC script unit -- was picket-fence stuff dealing with the clash of cultures in a north London Jewish community.  \n\nThe settled existence of Orthodox rabbi Abraham Fine is disturbed by the appearance of a brand-new Reform synagogue led by the vivacious Su Jacobs, a youthful and decidedly non-traditional rabbi, who sets about introducing the Hillsend area to the wonders of the world-wide web and her profound views on the importance of cosmetics.  \n\nThe storylines poked a certain amount of fun at both leading characters, mainly through the agency of Abraham's long-suffering wife Sadie, unarguably the true wise teacher of the series, who befriended Su and strove to keep the peace with varying degrees of success.  \n\nCast:\nTracy-Ann Oberman as Rabbi Su Jacobs\nDavid de Keyser as Rabbi Abraham Fine\nDoreen Mantle as Sadie Fine\n\n\n\nThe Attractive Young Rabbi - S01 - E01 - The New Synagogue\nThe Attractive Young Rabbi - S01 - E02 - The TV Stars\nThe Attractive Young Rabbi - S01 - E03 - The Visitor\nThe Attractive Young Rabbi - S01 - E04 - The Engagement\n\nThe Attractive Young Rabbi - S02 - E01 - The Barmitzvah\nThe Attractive Young Rabbi - S02 - E02 - Direct Action\nThe Attractive Young Rabbi - S02 - E03 - The Wedding\nThe Attractive Young Rabbi - S02 - E04 - The Lift\nThe Attractive Young Rabbi - S02 - E05 - Brief Encounter\nThe Attractive Young Rabbi - S02 - E06 - Babies\n\nThe Attractive Young Rabbi - S03 - E01 - The Eager Young Student\nThe Attractive Young Rabbi - S03 - E02 - A Woman's Work\nThe Attractive Young Rabbi - S03 - E03 - Abraham's Brother\nThe Attractive Young Rabbi - S03 - E04 - Crime Wave\nThe Attractive Young Rabbi - S03 - E05 - Mixed Fortunes\nThe Attractive Young Rabbi - S03 - E06 - A Very Nice Girl\n\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:b4cf58bdf102e8bba91bbda947603b769058ef56","amp;dn":"The+Attractive+Young+Rabbi+-+S01+to+03+-+Audio+Comedy+-+MP3+-+Sl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4cf58bdf102e8bba91bbda947603b769058ef56","infoHashBuffer":{"type":"Buffer","data":[180,207,88,189,241,2,232,187,169,27,189,169,71,96,59,118,144,88,239,86]},"announce":[],"urlList":[]}}