{"title":"RegDoctor 2.26 [ak]","uid":6375390,"size":1970811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b525afc7c88b34f60f77fd23baff983f1648d049&amp;dn=RegDoctor+2.26+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1304841769,"description":"RegDoctor 2.26\n\nAutomatically fix Windows registry problems and improve system performance. Stop computer crashes! Registry problems are the common cause of Windows crashes, error messages, and degraded performance! RegDoctor can safely and quickly clean and repair Windows registry problems with a few simple mouse clicks! RegDoctor uses an intelligent, high-performance detection engine to accurately identify missing and invalid references in your Windows registry. Identified registry problems are listed and rated by risk level using an easy to understand color-coded system for your information.\n\nYou can choose to have RegDoctor automatically repair all identified problems, or more selectively choose which problems to repair immediately. RegDoctor also offers a Restore feature to create registry backup files, giving you the capability to safely undo any registry changes. The auto-start feature of RegDoctor helps to support its regular use. By using RegDoctor regularly to clean and repair your registry, your system should not only be more stable but it will also help Windows and your software run faster.\n\nHome Page - http://www.itcompany.com/regdoctor.htm\n\n\n\n","torrent":{"xt":"urn:btih:b525afc7c88b34f60f77fd23baff983f1648d049","amp;dn":"RegDoctor+2.26+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b525afc7c88b34f60f77fd23baff983f1648d049","infoHashBuffer":{"type":"Buffer","data":[181,37,175,199,200,139,52,246,15,119,253,35,186,255,152,63,22,72,208,73]},"announce":[],"urlList":[]}}