{"title":"King Of Fighters Maximum Impact 2 [PAL][PS2][English][www.consol","uid":5816319,"size":1909621090,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b57ab60e7807d5c3c0af58f952c4de2e7f6a0cc6&amp;dn=King+Of+Fighters+Maximum+Impact+2+%5BPAL%5D%5BPS2%5D%5BEnglish%5D%5Bwww.consol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":3,"time":1283853802,"description":"Este King Of Fighters, pertenece a la gran escuela de juegos de lucha en 3D que sacrifican gran parte de la complejidad por ajustarse a unos cÃƒÂ¡nones antiguos. Es decir, el juego es ahora mÃƒÂ¡s un \\&quot;machaca-botones\\&quot; en la tradiciÃƒÂ³n de Bloody Roar o Rival School. Aunque sigue manteniendo gran parte de la tÃƒÂ©cnica de los KOF pasados, los golpes han sido un tanto banalizados con la inclusiÃƒÂ³n de Combos infinitos, y sobre todo, por unos personajes totalmente desalineados. Una de las claves de los antiguos King of Fighter, es que ningÃƒÂºn personaje tenÃƒÂ­a ventaja sobre el otro, y era frecuente ver a Kyo derrotado por algÃƒÂºn jugador avispado en usar a Chang. Esto ÃƒÂºltimo se ha perdido en Maximum Impact, y algunos luchadores tienen el triple de golpes que los demÃƒÂ¡s, creando un muy mal precedente a la hora de jugar (El caso de Rock Howard, es paradigmÃƒÂ¡tico, ya que cuenta con demasiados golpes en comparaciÃƒÂ³n con el resto de luchadores).\n\nLos clÃƒÂ¡sicos movimientos de paso lateral o el esquive han sido adaptados brillantemente a las tres dimensiones, y ahora pueden servir para esquivar gran parte de los golpes. Estos serÃƒÂ¡n necesarios, ya que el juego discurre a una velocidad rapidÃƒÂ­sima, lo que le hace un gran sucesor de juegos como Bloody Roar, y reaviva la llama de este tipo de juegos de lucha en 3D. Esta rapidez puede ser considerada como un sacrilegio para el fan clÃƒÂ¡sico de la franquicia, que verÃƒÂ¡ recortado gran parte del sistema estratÃƒÂ©gico de bloqueos y contraataque del original. Pero fuera de estas disquisiciones avanzadas, Maximum Impact es un juego que da lo que promete, y resulta una adaptaciÃƒÂ³n bastante resultona de los antiguos juegos de SNK.\n\nEl juego cuenta con una buena catelera de modos, aÃƒÂºn faltando el online. En el modo principal se pueden realizar las clÃƒÂ¡sicas batallas tres contra tres, y hay un uno contra uno, que sigue mÃƒÂ¡s fielmente la escasa historia del juego. Aparte, se han incluido el clÃƒÂ¡sico modo Trial, y un modo Challenge que sirve para obtener nuevos afiches para los personajes. Este ÃƒÂºltimo modo es una especie de \\&quot;adaptaciÃƒÂ³n\\&quot; del visto ya en Virtua Fighter 4, y es un buen mÃƒÂ©todo de dar una mayor duraciÃƒÂ³n y reto al juego. Las misiones van desde golpes especÃƒÂ­ficos, a requisitos para vencer a un enemigo, haciÃƒÂ©ndose bastante variado. AsÃƒÂ­, obtendrÃƒÂ¡s gorras o vestuarios alternativos para todos los personajes del juego, lo que da un componente de coleccionismo interesante.","torrent":{"xt":"urn:btih:b57ab60e7807d5c3c0af58f952c4de2e7f6a0cc6","amp;dn":"King+Of+Fighters+Maximum+Impact+2+%5BPAL%5D%5BPS2%5D%5BEnglish%5D%5Bwww.consol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b57ab60e7807d5c3c0af58f952c4de2e7f6a0cc6","infoHashBuffer":{"type":"Buffer","data":[181,122,182,14,120,7,213,195,192,175,88,249,82,196,222,46,127,106,12,198]},"announce":[],"urlList":[]}}