{"title":"The Rolling Stones - Some Girls (1978) WMA320","uid":6315316,"size":101965882,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b87f374ca4331e3b1c183a0a03222b0b40057c4c&amp;dn=The+Rolling+Stones+-+Some+Girls+%281978%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1302685796,"description":"The &quot;Miss You&quot; bass line alone is worth the price of this disc. It's got world devastating infectious power. I like the Stones more sinister, nasty stuff most, but this one tune never, ever gets old. If &quot;Happy&quot; off of Exile on Main Street is the height of joy - I can't think of a more boisterously celebratory sound in the Stones' catalog - then &quot;Miss You&quot; is their K2. (Note: K2 is the second highest peak on the face of the globe after Everest...) The rest of the songs here are fine, solid music with a few standout moments, like the radio friendly &quot;Beast of Burden&quot; that is the epitome of &quot;timeless&quot;, or &quot;Far Away Eyes&quot; which could have easily nestled in on Exile. &quot;Just My Imagination (Running Away With Me)&quot; predicts, in a minor way, the gorgeous mood of 'Waiting on a Friend&quot;, but without the island accent. &quot;Before They Make Me Run&quot; has Keith crooning as well as ever, propelled on Wyman's snappy bass line and Charlie's tight popping beat. And &quot;Some Girls'&quot; sly rhythm creeps deep under your skin and works some strange mojo there. It grows on you like the sweetest poison ivy. \n\nThe Stones are playing just easy and loose on all the rest of the tracks, and seemingly enjoying themselves very much, in spite of rumors to the contrary. \n\nThe sound quality is questionable as the compression is annoyingly audible; much of the original's softer, hazy balance is stripped out. The mid 90s remaster is much, much better, truer to the original. You might find this remaster to be a butchered sacrilege, or possibly a welcome refinement. There's no accounting for taste. With its pronounced, shrill highs and booming, over-sharp bass, this remaster really tests my patience.\n\nby Edward Z. Rosenthal\n\nTRACKLIST:\n\n01 - Miss You.wma                                                     \n02 - When The Whip Comes Down.wma                                     \n03 - Just My Imagination.wma                                          \n04 - Some Girls.wma                                                   \n05 - Lies.wma                                                         \n06 - Far Away Eyes.wma                                                \n07 - Respectable.wma                                                  \n08 - Before They Make Me Run.wma                                      \n09 - Beast Of Burden.wma                                              \n10 - Shattered.wma     \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:b87f374ca4331e3b1c183a0a03222b0b40057c4c","amp;dn":"The+Rolling+Stones+-+Some+Girls+%281978%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87f374ca4331e3b1c183a0a03222b0b40057c4c","infoHashBuffer":{"type":"Buffer","data":[184,127,55,76,164,51,30,59,28,24,58,10,3,34,43,11,64,5,124,76]},"announce":[],"urlList":[]}}