{"title":"Mick Jagger - God Gave Me Everything (2nafish)","uid":5798340,"size":132030468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b8b24f1a252808fa29adf111165c62818161b464&amp;dn=Mick+Jagger+-+God+Gave+Me+Everything+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283163393,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Very Best of Mick Jagger, the first overview of Mick Jagger's solo career, was released worldwide on 1 October 2007 and the following day in the United States on WEA/Rhino Records.\n\nThe collection includes singles, album tracks, and collaborations with John Lennon, David Bowie, Bono, Lenny Kravitz, Peter Tosh, Ry Cooder, David A. Stewart and Jeff Beck among others. It includes three previously-unreleased songs:\n\n    * &quot;Too Many Cooks&quot;, produced by John Lennon and recorded by Jagger in 1973 in Los Angeles. The track features guitarists Danny Kortchmar and Jesse Ed Davis, keyboardist Al Kooper, bassist Jack Bruce, drummer Jim Keltner and, on backing vocals, singer-songwriter Harry Nilsson. Neither Lennon nor Bill Wyman, who was present at the session, appear on the track.\n    * &quot;Checking Up on My Baby&quot;, recorded in 1992 with L.A. blues band, The Red Devils.\n    * &quot;Charmed Life&quot;, recorded while Jagger was working on Wandering Spirit with producer Rick Rubin. Jagger had sketched it out (with his daughter Karis Jagger on backing vocals), but then decided the track didn't fit with the rest of the album. The version on Very Best is remixed by producer Ashley Beadle. The song was also released as a promo single with various remixes, and reached the Top 20 on Billboard's Hot Dance Singles chart in early 2008.\n\nA special edition with DVD was also released with more than 72 minutes of content, including an extensive interview with Mick Jagger from early/mid 2007, nine videos, and extras.\n\nJagger has promoted the album through interviews including a special for Rolling Stone, a comprehensive Q&amp;A with fans on the BBC web site and TV appearances. He also re-launched his web site with audio, video, photos and more information about this compilation and his solo work in general.\n\nThe album debuted in the British chart at #57 with sales of nearly 4,000 copies and in the American chart at #77 selling 11,846 copies during the first week.\n\nSir Michael Philip &quot;Mick&quot; Jagger (born 26 July 1943) is an English musician, singer-songwriter and record producer, best known as the lead vocalist of The Rolling Stones. Jagger has also acted in and produced several films.\n\nThe Rolling Stones started in the early 1960s as a rhythm and blues cover band with Jagger as frontman. Jagger and guitarist Keith Richards developed a songwriting partnership, and by the mid-1960s the group had evolved into a major rock band. Frequent conflict with the authorities (including alleged drug use and his romantic involvements) ensured that during this time Jagger was never far from the headlines, and he was often portrayed as a counterculture figure. In the late 1960s Jagger began acting in films (starting with Performance and Ned Kelly), to mixed reception.\n\nIn the 1970s, Jagger, with the rest of the Stones, became tax exiles, consolidated their global position and gained more control over their business affairs with the formation of the Rolling Stones Records label. During this time, Jagger was also known for his high-profile marriages to Bianca Jagger and later to Jerry Hall. In the 1980s Jagger released his first solo album. He was knighted in 2003. In 2006, Jagger was ranked by Hit Parader as the fifteenth greatest heavy metal singer of all time, despite not being associated with the genre.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b8b24f1a252808fa29adf111165c62818161b464","amp;dn":"Mick+Jagger+-+God+Gave+Me+Everything+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8b24f1a252808fa29adf111165c62818161b464","infoHashBuffer":{"type":"Buffer","data":[184,178,79,26,37,40,8,250,41,173,241,17,22,92,98,129,129,97,180,100]},"announce":[],"urlList":[]}}