{"title":"Democracy Now - 19 aug 2010","uid":5775139,"size":453063032,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b8ff4afbe5b048f3932ad405e731bb55d080256e&amp;dn=Democracy+Now+-+19+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1282238533,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 19, 2010\n\n- US Withdraws Last Combat Brigade from Iraq, But 56,000 Troops Remain\n- Hundreds Protest Deadly US Raid in Afghanistan\n- US: Afghan Ban on Armed Contractors Could Threaten Aid\n- US Boosts Pakistan Aid to $150M\n- Lori Berenson Reimprisoned in Peru\n- US Still Holding Gitmo Prisoner Cleared for Release in 2004\n- ACLU Files Suit over Torture, Jailing of US Citizen in UAE\n- Howard Dean Opposes Islamic Community Center Near Ground Zero\n- US Accused of Pressuring India to Drop Bhopal Claims\n- US Deported Record 393,000 in 2009\n- Justice Dept. Threatens to Sue Arizona Sheriff for Rebuffing Investigators\n- Bailed-Out GM Files Papers for Public Offering\n\n\nSpecial reports\n\n- US Activist Lori Berenson and Baby Son Returned to Peruvian Prison Just 3 Months After Release on Parole\n\nThe US activist Lori Berenson has been sent back to a Peruvian prison just three months after she was freed on parole. Berenson had served nearly fifteen years following her 1996 conviction for collaborating with the rebel group the TÃƒÂºpac Amaru Revolutionary Movement, or MRTA. We go to Lima to speak with Lori Berenson's mother, Rhoda Berenson.\n\n\n- With 28,000 Killed Since 2006, Movement for Drug Legalization in Mexico Takes Hold\n\nThe Mexican government's policy against drug trafficking over the past few years has been to increasingly militarize the conflict with the only tangible result being a skyrocketing death toll. Now a growing movement in Mexico to legalize drugs, particularly marijuana, is taking shape. Four proposals that aim for varying degrees of decriminalization or legalization of drugs are on the docket in Mexico's House of Deputies, and another is circulating in the Senate. Meanwhile, former Mexican President Vicente Fox, who was a key US ally in the war on drugs, has backed the legalization of drugs, saying prohibition has failed to reduce violence and corruption.\n\n\n- Obama Signs $600M Bill to Increase Militarization of US-Mexico Border\n\nPresident Obama has signed into law a $600 million bill to deploy some 1,500 new border patrol agents and law enforcement officials along the border, as well as two aerial surveillance drones. The bill was quickly passed by Congress in a rare display of bipartisanship. We speak to Arnoldo GarcÃƒÂ­a of the National Network for Immigrant and Refugee Rights.\n\n\n- Filipina American Torture, Abduction Survivor Melissa Roxas: Graphic Torture Video a Rare Glimpse into Widespread Abuses in the Philippines\n\nGraphic footage of a man being tortured by police has sparked widespread public outrage in the Philippines and a government probe. The graphic cell phone video shows a man lying naked and bloody on the floor of an alleged police precinct in Manila. A plainclothes police officer is seen whipping him and tugging at a rope tied to the victim's genitals while screams are heard. Over the past decade, torture, forced disappearance, political killings and imprisonment without trial have become commonplace in the Philippines. We speak to Melissa Roxas, a Filipina American who was abducted and tortured last year in the Philippines.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b8ff4afbe5b048f3932ad405e731bb55d080256e","amp;dn":"Democracy+Now+-+19+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ff4afbe5b048f3932ad405e731bb55d080256e","infoHashBuffer":{"type":"Buffer","data":[184,255,74,251,229,176,72,243,147,42,212,5,231,49,187,85,208,128,37,110]},"announce":[],"urlList":[]}}