{"title":"Billy Taylor &amp; Gerry Mulligan - Live at MCG (1993) [Jazz][mp3 32","uid":5816606,"size":168614294,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b930fe8e6813146c47f6baf83369b0224c04d2cc&amp;dn=Billy+Taylor+%26+Gerry+Mulligan+-+Live+at+MCG+%281993%29+%5BJazz%5D%5Bmp3+32&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"schon55","files":19,"time":1283867195,"description":"Billy Taylor &amp; Gerry Mulligan - Live at MCG \nOriginal Release Date: 2007 \nAudio CD: August 28, 2007 \nLabel: Mcg Jazz \nQuality: CBR 320 kbps\n\nBilly Taylor was already in his early seventies and Gerry Mulligan not far behind when the pianist and baritone saxophonist performed together for the first time in a series of 1993 dates at the Manchester Craftsmen's Guild in Pittsburgh, PA. The two had been close friends for years, though, and their on-stage meeting has an aura of inevitability about it: there's a symbiotic relationship at work here from the first moments that only grows tighter as the program moves along. By this time, each musician had half a century of experience behind him, accustomed to  working in any number of diverse configurations, but together they keep things loose and easy here, not looking to prove anything to anyone - only to enjoy each other's company. Working with drummer Carl Allen and bassist  Chip Jackson, Mulligan and Taylor largely stick with the standards, playing them straight-ahead and unadorned, yet injecting each with a sense of tenderness and integrity. There's a palpable sense of mutual respect as they trade riffs on tunes that, in less capable hands, would just sound old and tired. Duke Ellington's &quot;Come Sunday,&quot; Johnny Mercer's &quot;Laura,&quot; and the classic &quot;Body and Soul&quot; are all spacious and bluesy, Taylor bringing a moodiness to it that Mulligan is all too happy to feed off. The opening &quot;Stompin' at the Savoy&quot;is a chipper, midtempo romp setting a good-time mood that never dissipates,and the set's two originals, Taylor's &quot;Capricious&quot; and Mulligan's &quot;Line for Lyons,&quot; are dramatic swingers that give the band and its soloists a chance to open up and blow, without getting carried away. Mulligan only had a little more than two years left, and although he and Taylor never left more of a mark as partners, it's a good thing that this superb, thoroughly enjoyable document survives.  ~ Jeff Tamarkin \n\nIn late 1993 jazz masters Billy Taylor and Gerry Mulligan performed a series of concerts at Manchester Craftsmen's Guild (MCG) in Pittsburgh, PA for the first time together. The result of those performances is &quot;Billy Taylor and Gerry Mulligan, Live at MCG.&quot; During the concert weekend MCG also taped the pilot program for what became &quot;Billy Taylor's Jazz from the Kennedy Center.&quot; That NPR series went on to become one of the most successful national radio series of all time. \nBilly Taylor and Gerry Mulligan were the best of friends on and off the bandstand - which can genuinely be heard throughout this entire performance. You will hear them finishing each others phases and laughing at each other's musical jokes. Their duet on &quot;All The Things You Are&quot; is a glowing example of their shared musical heritage and life-long bond. \n\nAll of the songs on Billy Taylor and Gerry Mulligan, Live at MCG are beloved classics including the two original tunes, &quot;Line for Lyons&quot; by Gerry Mulligan and &quot;Capricious&quot; by Billy Taylor. Others including &quot;Stompin' At The Savoy&quot; &quot;Body And Soul,&quot; and Ellington's &quot;Come Sunday, make this live recording date a classic for all times. ~ Product Description - Amazon \n\nBilly Taylor &amp; Gerry Mulligan - Live at MCG Tracks:\n01  Stompin' at the Savoy \n02  Just You Just Me \n03  Darn That Dream \n04  All the Things You Are \n05  Laura \n06  Line for Lyons\n07  Body and Soul\n08  (Back Home Again In) Indiana \n09  Come Sunday \n10  Capricious ","torrent":{"xt":"urn:btih:b930fe8e6813146c47f6baf83369b0224c04d2cc","amp;dn":"Billy+Taylor+%26+Gerry+Mulligan+-+Live+at+MCG+%281993%29+%5BJazz%5D%5Bmp3+32","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b930fe8e6813146c47f6baf83369b0224c04d2cc","infoHashBuffer":{"type":"Buffer","data":[185,48,254,142,104,19,20,108,71,246,186,248,51,105,176,34,76,4,210,204]},"announce":[],"urlList":[]}}