{"title":"Gotta Be Somebody - Nickelback (HD 720p) [mildpoison]","uid":5787876,"size":95982389,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:baed627b0bec18736525cddad3fc27c5a6de03ec&amp;dn=Gotta+Be+Somebody+-+Nickelback+%28HD+720p%29+%5Bmildpoison%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mildpoison","files":3,"time":1282719119,"description":"                            Gotta Be Somebody - Nickelback\n\n\n\nAbout The Artist\n\nNickelback is a Canadian rock band from Hanna, Alberta, formed in 1995 by Chad Kroeger, Mike Kroeger, Ryan Peake and then-drummer Brandon Kroeger. While largely a rock band, the group has also experimented with various other musical styles such as pop and country, aside from their hard rock and post-grunge base. Nickelback is one of the most commercially successful Canadian groups, having sold 30 million records worldwide. Nickelback ranks as the 11th best selling music act of the 2000s, and is the 2nd best selling foreign act in the US behind The Beatles for the 2000s.\n&quot;If Today Was Your Last Day&quot; is the second major single (third overall) from Nickelback's sixth studio album Dark Horse. It was originally planned as the first single, to hit all U.S. radio formats September 30th, 2008, but was scrapped as the first single in favour of &quot;Gotta Be Somebody&quot;. Instead it was released on March 31, 2009 as the second U.S. single, and it had been released as the third single in Canada from around November 2008.\n\n\nDescription\n\n&quot;Gotta Be Somebody&quot; is the first official single released from Nickelback's sixth studio album, Dark Horse. Originally, the lead single from the album was set to be &quot;If Today Was Your Last Day&quot; but was changed instead to &quot;Gotta Be Somebody&quot;. The song was digitally delivered to all formats on September 29, 2008.\n\nIt was used in a video package for the 2008 WWE Tribute to the Troops show.\n\n\nPlot\n\nIn October 2008, it was reported that an official video from the commercial shoot had been shot with director Jessy Terrero. However, after claims that the band was dissatisfied with the video, it was scrapped, and it was unknown whether a new video would be made. It was then reported that a new video had been shot in Vancouver with long-time collaborator Nigel Dick. The video debuted at AOL on Monday, December 15, 2008. This was nearly three months following the release of the single, with the late release due to the band having to redo the video for the song.\nThe video for &quot;Gotta Be Somebody&quot; starts out in Outer Space, showing various planets before zooming in on Earth. Nickelback is shown playing at the Colosseum in Rome, which is empty. During the chorus, an earthquake comes and cracks the ground the band is standing on. The band is then shown playing on the Brooklyn Bridge in New York City. Again, an earthquake begins during the chorus and the band is finally shown playing an outdoor concert to fans in a Southwestern United States desert inside an Aircraft boneyard.\nThe video swept the 2009 MuchMusic Video Awards, winning awards for best video, best rock video and best post production.\n\n\n\nLyrics\n\nThis time, I wonder what it feels like\nTo find the one in this life, the one we all dream of\nBut dreams just aren't enough\nSo I'll be waiting for the real thing, I'll know it by the feeling\nThe moment when we're meeting, will play out like a scene\nStraight off the silver screen\nSo I'll be holding my breath, right up 'til the end\nUntil that moment when, I find the one that I'll spend forever with\n\nCause nobody wants to be the last one there\nCause everyone wants to feel like someone cares\nSomeone to love with my life in their hands\nThere's gotta be somebody for me like that\nCause nobody wants to go it on their own\nAnd everyone wants to know they're not alone\nThere's somebody else that feels the same somewhere\nThere's gotta be somebody for me out there\n\nTonight, out on the street, out in the moonlight\nAnd dammit this feels too right, it's just like dÃƒÂ©ja vu\nMe standing here with you\nSo I'll be holding my breath, could this be the end?\nIs it that moment when, I find the one that I'll spend forever with\n\nCause nobody wants to be the last one there\nCause everyone wants to feel like someone cares\nSomeone to love with my life in their hands\nThere's gotta be somebody for me like that\nCause nobody wants to go it on their own\nAnd everyone wants to know they're not alone\nThere's somebody else that feels the same somewhere\nThere's gotta be somebody for me out there\n\nYou can't give up, (when you're looking for) a diamond in the rough (cause you never know)\nWhen it shows up, (make sure you're holding on)\nCause it could be the one, the one you're waiting on\nCause nobody wants to be the last one there\nAnd everyone wants to feel like someone cares\nSomeone to love with my life in their hands\nThere's gotta be somebody for me, oh\n\nNobody wants to go it on their own\nAnd everyone wants to know they're not alone\nThere's somebody else that feels the same somewhere\nThere's gotta be somebody for me out there\nNobody wants to be the last one there\nCause everyone wants to feel like someone cares\nThere's somebody else that feels the same somewhere\nThere's gotta be somebody for me out there [/color]\n\n\nDetails\n\nGeneral\nFormat                           : Matroska\nFile size                        : 91.5 MiB\nDuration                         : 4mn 9s\nOverall bit rate                 : 3,075 Kbps\n\nVideo\nFormat                           : AVC\nDuration                         : 4mn 9s\nBit rate                         : 2,948 Kbps\nWidth                            : 1,280 pixels\nHeight                           : 720 pixels\nDisplay aspect ratio             : 16:9\nFrame rate                       : 25.000 fps\nBit depth                        : 8 bits\nScan type                        : Progressive\nStream size                      : 85.0 MiB (93%)\n\nAudio\nFormat                           : Vorbis\nDuration                         : 4mn 9s\nBit rate mode                    : Constant\nBit rate                         : 160 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nVideo delay                      : -40ms\nStream size                      : 4.76 MiB (5%)","torrent":{"xt":"urn:btih:baed627b0bec18736525cddad3fc27c5a6de03ec","amp;dn":"Gotta+Be+Somebody+-+Nickelback+%28HD+720p%29+%5Bmildpoison%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baed627b0bec18736525cddad3fc27c5a6de03ec","infoHashBuffer":{"type":"Buffer","data":[186,237,98,123,11,236,24,115,101,37,205,218,211,252,39,197,166,222,3,236]},"announce":[],"urlList":[]}}