{"title":"Black and White (1933)","uid":5773485,"size":26062848,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bbe492185886961ad26087a0a8bfa4746ffd6d39&amp;dn=Black+and+White+%281933%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"albert88_photo","files":1,"time":1282192457,"description":"Directed by I. Ivanov-Vano and L. Amalrik.\nMezrabpomfilm.\n\nBased on Black and White, a poem by Vladimir Mayakovsky.\nMayakovsky is often called the loudspeaker of the Bolshevik Revolution.\nYet he was also a most talented poet, whose works are widely quoted\neven today. As a graphic artist, he was one of the founders of the Okna\nRosta (Rosta Windows) a massive media publicity blitz which used\nposters to spread word of the Revolution via the Russian telegraphic\nagency.\n\nThe animation in Black and White is based on his drawings.\nIn 1922, Mayakovsky received special permission to travel to America.\nEn route he stopped in Cuba where Americans controlled the sugar and\ntobacco industries. Black and White tells the story of Willie, the shoe\nshine boy, who makes the fatal mistake of asking the White Sugar King\nMister Bragg, Why should white sugar be made by a black man?\nOnly fragments of the film were found, without restorable sound. It was\ndecided to underscore the fragments with excerpts from Sometimes I\nfeel like a Motherless Child, recorded by Paul Robeson in 1949 at the\nTchaikovsky Theatre in Moscow. The son of an American slave,\nRobeson was an athlete, actor, singer, cultural scholar, author, and\npolitical activist. He spoke fluent Russian. Although he never officially\njoined the Communist party, he supported the USSR politically which\nbrought him to the attention of the House Un-American Activities\nCommittee, and ultimately probably cost him his American career.\n\nIn 1952 Robeson was awarded the Stalin Peace Prize. He translated the\nSoviet national anthem into English. His rendition, also recorded in\nMoscow in 1949, underscores the end credits of this episode.\nOleg Vidov (actor/producer): The Soviet propaganda machine glorified\nRobeson almost as an achievement of the International Revolution. But\nfor the Soviet people who attended his concerts or heard him on radio, he\nwas a good friend from America, the country which helped us to defeat\nthe Nazis. During a time of oppression and Stalin terror, here came this\ngood-spirited, free person from the United States. Unlike us, he could\ntravel freely and bring us songs in English. He also taught us to sing\nOle Man River in Russian.\n","torrent":{"xt":"urn:btih:bbe492185886961ad26087a0a8bfa4746ffd6d39","amp;dn":"Black+and+White+%281933%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe492185886961ad26087a0a8bfa4746ffd6d39","infoHashBuffer":{"type":"Buffer","data":[187,228,146,24,88,134,150,26,210,96,135,160,168,191,164,116,111,253,109,57]},"announce":[],"urlList":[]}}