{"title":"RUSE The Art Of Deception [R.Free] [X360] ","uid":5812113,"size":7201694073,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:bda0dd886736ca4a230509052f92bbeb0e4da586&amp;dn=RUSE+The+Art+Of+Deception+%5BR.Free%5D+%5BX360%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Morck22","files":75,"time":1283687975,"description":"Region Free!!!!\n\n\nDesarrollado por Eugen Systems, R.U.S.E. ha sido creado para aportar un soplo de aire fresco al gÃƒÂ©nero de la estrategia, introduciendo diversas tÃƒÂ©cnicas de engaÃƒÂ±o que te permitirÃƒÂ¡n confundir a tu enemigo y llevar a tu naciÃƒÂ³n hacia la victoria. Camuflar tus tropas, manipular a tu oponente con unidades seÃƒÂ±uelo, sabotear su logÃƒÂ­stica... La estrategia es intuiciÃƒÂ³n y tambiÃƒÂ©n movimientos bien pensados a la vez. R.U.S.E. ofrece grÃƒÂ¡ficos y efectos visuales de ÃƒÂºltima generaciÃƒÂ³n, el impresionante IRISZOOM Engine, combates inmersivos y una interfaz simplificada que permite determinar la estrategia mÃƒÂ¡s adecuada para tu naciÃƒÂ³n y para derrotar a tus enemigos.\nCaracterÃƒÂ­sticas:\nDimensiÃƒÂ³n: DimensiÃƒÂ³n es uno de los aspectos fundamentales de R.U.S.E. El motor IRISZOOM Engine es capaz de representar mapas varios cientos de veces mÃƒÂ¡s grandes que en cualquier ETR tradicional, lo cual eleva la estrategia a una escala sin precedentes y aÃƒÂ±ade una gran profundidad al sistema de engaÃƒÂ±o. Con el zoom podrÃƒÂ¡s comandar tus unidades como jefe al mando, y tambiÃƒÂ©n gestionar tus tropas a nivel tÃƒÂ¡ctico como oficial de campo, lanzando por ejemplo una ofensiva falsa sobre el cuartel general de tu oponente, mientras ocultas cuidadosamente tu infanterÃƒÂ­a en los pueblos para emboscar los tanques cercanos\n# EngaÃƒÂ±o: El engaÃƒÂ±o es la esencia de la jugabilidad de R.U.S.E., de la misma forma que sucede en un conflicto real: las tÃƒÂ©cnicas de engaÃƒÂ±o tales como el espionaje, los seÃƒÂ±uelos y el silencio de radio jugaron un papel esencial durante la II Guerra Mundial, y continÃƒÂºan haciÃƒÂ©ndolo en otros conflictos modernos. R.U.S.E. incorpora las tarjetas de engaÃƒÂ±o, tambiÃƒÂ©n conocidas como estratagemas, que te permitirÃƒÂ¡n aplicar una tÃƒÂ©cnica de engaÃƒÂ±o en un sector especÃƒÂ­fico del mapa. Las estratagemas se dividen en tres categorÃƒÂ­as: RevelaciÃƒÂ³n: estratagemas, como el Plan espÃƒÂ­a o el Descifrado, son ÃƒÂºtiles cuando quieres comprender o descubrir las acciones de tu enemigo.\n# OcultaciÃƒÂ³n: el silencio de radio o la red de camuflaje te permitirÃƒÂ¡n ocultar tus tropas o edificios del radar de tu oponente.\n# Falseo: la ÃƒÂºltima categorÃƒÂ­a de estratagemas se usa para engaÃƒÂ±ar a tu enemigo y hacerle creer lo que tÃƒÂº quieras que crea. El SeÃƒÂ±uelo ofensivo simula un ataque para confundir a tu adversario.\nMultijugador: Sin duda engaÃƒÂ±ar a otra persona es el reto definitivo, asÃƒÂ­ que el multijugador juega un papel esencial en la experiencia que supone R.U.S.E. Hasta 8 jugadores podrÃƒÂ¡n jugar en lÃƒÂ­nea en enormes campos de batalla. Los jugadores podrÃƒÂ¡n configurar partidas con sus propias preferencias gracias a una multitud de parÃƒÂ¡metros (nÃƒÂºmero de estratagemas disponibles, condiciones de victoria, tiempo de juego, modo 1939, 1942 ÃƒÂ³ 1945,...)","torrent":{"xt":"urn:btih:bda0dd886736ca4a230509052f92bbeb0e4da586","amp;dn":"RUSE+The+Art+Of+Deception+%5BR.Free%5D+%5BX360%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda0dd886736ca4a230509052f92bbeb0e4da586","infoHashBuffer":{"type":"Buffer","data":[189,160,221,136,103,54,202,74,35,5,9,5,47,146,187,235,14,77,165,134]},"announce":[],"urlList":[]}}