{"title":"Democracy Now - 28 jun 2011","uid":6501986,"size":453079860,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bed67feffe949b8861f51f103d1117544d044654&amp;dn=Democracy+Now+-+28+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1309279986,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 28, 2011\n\n- Thousands of Greeks Begin 48-Hour General Strike\n- Japan: 15 Tons of Radioactive Water Leaked Into Ground Near Facility\n- Los Alamos Nuclear Weapons Lab Remains Closed As Massive Wildfire Approaches\n- Israel Continues To Threaten Gaza Flotilla Activists\n- Libya Government Denounces International Arrest Warrants For Gaddafi and Aides\n- Syrian Opposition Leaders Gather In Rare Public Meeting\n- Number of Afghan U.S. War Refugees Reaches 250,000, Double Previous Year\n- U.S. Drones Kill 21 in Pakistan\n- Federal Judge Blocks Key Parts of Controversial Georgia Immigration Law\n- Trial Begins For Former Khmer Rouge Leaders\n- Wisconsin Bans Planned Parenthood Funds, Indiana Issues Injunction Against Blocking It From Medicaid\n- Flood Waters Begin to Recede in North Dakota Following Widespread Destruction\n\n\nSpecial reports\n\n- &quot;A Perfect Product of the Religious Right&quot;: Deconstructing Michele Bachmann's GOP Presidential Bid\n\nThe rising star of the Tea Party movement, Minnesota congresswoman Michele Bachmann, has launched her bid for the Republican 2012 presidential nomination. On the eve of her announcement, Bachmann was tied with Mitt Romney in The Des Moines Register's Iowa Poll, the first survey of voters who plan to attend the Republican caucuses. The former tax lawyer identifies as a conservative Christian and is a fierce opponent of abortion and gay marriage. Bachmann also supports teaching intelligent design in public schools, and she's claimed that global warming is a hoax. She has largely built her campaign around accusing Obama of favoring government intervention, pushing the U.S. toward socialism and having &quot;anti-American views&quot; and is particularly fierce critic of Obama's health-care overhaul. While Bachmann is known for advocating a limited government, she has recently come under scrutiny for allegedly accepting hundreds of thousands of dollars in agricultural subsidies for her family farm in Wisconsin. We are joined by journalist Karl Bremer, who has covered Michele Bachmann's political career for the last decade from Stillwater, Minnesota, which is where the Bachmanns currently reside. We also speak with journalist Michelle Goldberg, author of &quot;Kingdom Coming: The Rise of Christian Nationalism.&quot;\n\n\n- As Obama Quietly Pushes for a Nuclear Weapons Renaissance, Wildfire Threatens Los Alamos Nuclear Lab\n\nIn New Mexico, an out-of-control wildfire that began Sunday has already burned nearly 80-square miles and is a mile or less from Los Alamos National Laboratory, home to a nuclear weapons plutonium facility. Pieces of ash from the fire have dropped onto the laboratory grounds, sparking &quot;spot&quot; fires. A senior investigator with the Project on Government Oversight said a fire at the facility would be a &quot;disaster&quot; that could result in large and lethal releases of radiation. Officials insist explosive materials on the laboratory's grounds are safely stored in underground bunkers made of concrete and steel. But the group, Concerned Citizens for Nuclear Safety, told the Associated Press that the fire appeared to be about 3.5 miles from a dumpsite where as many as 30,000 55-gallon drums of plutonium-contaminated waste were stored in fabric tents above ground. The group said the drums were awaiting transport to a low-level radiation dump site in southern New Mexico. We speak with Greg Mello, the director of the Los Alamos Study Group, a citizen-led nuclear disarmament group based in New Mexico. &quot;Los Alamos National Laboratory is becoming the center of plutonium manufacturing for the country,&quot; Mello says, even though &quot;it is a place with a lot of natural hazards, not just fires, but also earthquakes.&quot;\n\n\n- It Takes People On the Outside: Prestigious Author Alice Walker to Confront Israeli Naval Blockade of Gaza on U.S. Aid Ship\n\nIsrael continues to threaten a group of international activists planning to sail to Gaza this week with humanitarian aid. Israeli Foreign Minister Avigdor Lieberman said participants in the 10-boat flotilla are seeking &quot;confrontation and blood.&quot; Last year, Israeli forces killed nine people aboard the Gaza-bound Mavi Marmara. Meanwhile, activists say one of the 10 boats scheduled to sail to Gaza has been sabotaged in a Greek port. Saboteurs reportedly cut off the propeller shaft of a ship shared by Swedish, Norwegian and Greek activist. Organizers say the boat will be repaired in time to sail to Gaza. One of the other ships that will try to reach Gaza from Greece is the &quot;Audacity of Hope.&quot; It's set to carry up to 50 U.S. citizens carrying letters to Gaza residents. One of the ship's passengers is the acclaimed author, poet and activist Alice Walker. She has written many books, including &quot;The Color Purple,&quot; for which she was awarded the Pulitzer Prize for fiction. On Monday, Alice Walker spoke at a Freedom Flotilla news conference in the Greek capital of Athens. &quot;I am going to Gaza because my government has failed to understand or care about the Gazan people, but worse than that, it is ignorant of our own history in the United States,&quot; Walker said. &quot;For instance, when black people were enslaved for 300 years, it took a lot of people in the outside of our communities to help free us.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bed67feffe949b8861f51f103d1117544d044654","amp;dn":"Democracy+Now+-+28+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bed67feffe949b8861f51f103d1117544d044654","infoHashBuffer":{"type":"Buffer","data":[190,214,127,239,254,148,155,136,97,245,31,16,61,17,23,84,77,4,70,84]},"announce":[],"urlList":[]}}