{"title":"Folder Marker Pro v3.2.0 Portable","uid":6465137,"size":27787506,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bf6d904bc1b53d59419f1f2693dcccb5efe2421d&amp;dn=Folder+Marker+Pro+v3.2.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307937975,"description":"Folder Marker Pro 3.2.0 Portable\n\n\nFolder Marker Home lets you mark your folders with color-coded and image-coded icons with one mouse click, which makes them easy to find and retrieve. Simply select the folder you want to mark, right-click on its icon, select a color-coded icon from the drop-down menu and it will be assigned to the folder at once.\n\nUsers can take advantage of great customization flexibility. You can, for example, modify a right-click menu of a folder by adding new menu items and categories and assigning icons to them. You also have the ability to add new items to Folder Marker's icon set. Simply drop an ICL file to the appropriate folder and a new tab with folders from this file will appear. The user can choose to make folders, customized with Folder Marker Home, distributable. This means a color-coded icon remains unchanged even if the folder is copied onto a new computer or the system has been re-installed. Also, you can apply a selected icon to all sub-folders in a given folder.\n\nKey features:\n- Folder Marker Home can modify the 'Mark Folder' menu. You can have your own menu with your own icons, specially made for your personal needs. It is VERY convenient.\n- Folder Marker Home has two additional options for folder icon changes: &quot;Make customized folder distributable&quot; (portable) and &quot;Apply selected icon to all subfolders&quot;\n- Folder Marker Home can change a folder's color. For this purpose you have 36 icons of normal, dark and light colors.\n- Folder Marker Home can mark folders by priority (high, normal, low), by degree of work complete (done, half-done, planned), by work status (approved, rejected, pending) and by the type of information contained in a folder (work files, important files, temp files, private files).\n- Folder Marker Home changes folder icons within a popup menu of the folders. To mark a folder, you don't even need to run the program! Moreover, the popup menu contains convenient category submenus.\n- Folder Marker Home contains a User Icons tab where you can add an unlimited quantity of your favorite icons and mark folders with them. It's easy!\n- Folder Marker Home can work with several folders at once and supports 32-bits icons.\n\nOS : Win XP/2000/Vista/Win 7\nLanguage : Multilingual\n\n\nHome Page - http://www.foldermarker.com\n","torrent":{"xt":"urn:btih:bf6d904bc1b53d59419f1f2693dcccb5efe2421d","amp;dn":"Folder+Marker+Pro+v3.2.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6d904bc1b53d59419f1f2693dcccb5efe2421d","infoHashBuffer":{"type":"Buffer","data":[191,109,144,75,193,181,61,89,65,159,31,38,147,220,204,181,239,226,66,29]},"announce":[],"urlList":[]}}