{"title":"LeAnn Rimes - Swingin' (Live) (2nafish)","uid":5807708,"size":155514884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bfc4e2ba1d6b32230c30bb69bc59fea2a0fd4eff&amp;dn=LeAnn+Rimes+-+Swingin%5C%27+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283510118,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo except PG logo at beginning.\n\n\n&quot;Swingin'&quot; is the title of a song co-written and recorded by American country music singer John Anderson. Released in 1983, it was included on his album Wild &amp; Blue. The song was the second of five Number One singles in Anderson's career, spending one week at the top of the Hot Country Songs charts. It also received a gold certification from the Recording Industry Association of America, and received a Single of the Year award from the Country Music Association. Anderson re-recorded the song for his 1994 album Country 'til I Die on BNA Records. This re-recording served as the b-side to the album's title track, which was also the first single from it.\n\nLeAnn Rimes released her version of the song to country radio on June 14, 2010 as the first single from her album Lady and Gentlemen. Rimes debuted her version of the song on the 2010 CMT Music Awards  on June 9, 2010. The song debuted at #60 on the Hot Country Songs chart for July 17, 2010. It spent four weeks on the chart and peaked at #57.\n\nLady and Gentlemen is the upcoming eleventh studio album from American country artist LeAnn Rimes. It is set to be released on October 5, 2010 via Asylum-Curb Records.\n\nLady and Gentleman is a country covers album, consisting of Rimes' favorite classic country love songs, all originally recorded by men.\n\nIn an interview with CMT, Rimes commented on the work she has done with Lady and Gentleman commenting &quot;It's cool that there is this buzz about it, so I can't wait for people to hear it and see that it's as good as they're thinking it's going to be, And I say that as humbly as possible because I think it's such a great record. People don't make records like this anymore.&quot; She also commented on her father, who raised her on country music. &quot;My dad was the one who raised me on that country music. I listened to a lot of those types of men that he grew up on. Patsy Cline was the only female that I remember listening to over and over again. Otherwise, it was Johnny Cash and Willie Nelson and Hank Williams. I think it was my dad who turned me to the light.&quot;\n\nLeAnn Rimes, (born August 28, 1982) is an American singer-songwriter and actress, best known for her work in country music. She is best known for her rich vocals similar to country music singer Patsy Cline, and her rise to fame at the age of 13, becoming the youngest country music star since Tanya Tucker in 1972.\n\nRimes made her breakthrough into country music in 1996. Her debut album, Blue, reached Number 1 on the Top Country Albums chart and was certified &quot;multi-platinum&quot; in sales by the Recording Industry Association of America. The album's lead single of the same name (originally intended to be recorded by Patsy Cline in the early 1960s) became a Top 10 hit. With immediate success, Rimes attained widespread national acclaim for her similarities to Cline's vocal style. When Rimes released her sophomore studio effort in 1997, You Light up My Life: Inspirational Songs, Rimes went more towards country pop material, which would set the trend for a string of albums that would be released into the next decade. LeAnn Rimes is the youngest person to win a Grammy.\n\nSince her debut, Rimes has won many major industry awards, which include two Grammys, three ACMs, one CMA, twelve Billboard Music Awards, and one American Music award. In addition, Rimes has also released ten studio albums and four compilation albums through her record label of 13 years, Asylum-Curb, and placed over 40 singles on American and international charts since 1996.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bfc4e2ba1d6b32230c30bb69bc59fea2a0fd4eff","amp;dn":"LeAnn+Rimes+-+Swingin%5C%27+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfc4e2ba1d6b32230c30bb69bc59fea2a0fd4eff","infoHashBuffer":{"type":"Buffer","data":[191,196,226,186,29,107,50,35,12,48,187,105,188,89,254,162,160,253,78,255]},"announce":[],"urlList":[]}}