{"title":"Fire Storm Over Dresden","uid":6376750,"size":674321300,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c03d34679136311785b2318b17de280a7aa0590d&amp;dn=Fire+Storm+Over+Dresden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Borzoi","files":1,"time":1304886049,"description":"\nOn the night of February 13th, 1945.., there began the most controversial bombing-raids of World War II,  which dwarfed the bombing of Hiroshima and Nagasaki !!  This event.., was the fire-bombing of Dresden.  It's a controversy which stills rages today.  This documentary, which takes into account the latest historical evidence.., makes a great attempt to shed new light on this event.\n\nContemporary witnesses, previously unheard.., describe the events and the terror the night of the bombing.\n\nThis film, which in the beginning.., combines archive images of pre-war Dresden.., followed with a evening of remembrance 45 years later in the Palace of Culture (made in 1990).  Using information from Winston Churchill's diaries.., the outspoken historian David Irving paints a comprehensive picture of the time.., the background to the bombing-raid, and the strategies employed to carry out this atrocity...\n\nAbove all.., this film was made as a memorial to the loss of human life AND the great works of art lost...\n\nThis documentary is about 77 minutes long and has &quot;watchable&quot; quality of  A9 / V8\n\nAs always.., after watching.., do your best to &quot;pass it on&quot;.....\n\n\n!!! Truth Does Not Fear Investigation !!!\n\nAlso something VERY important to remember is..,  &quot;He who Wins the War.., also Writes the History&quot;\n\nYes / No ??\n\n","torrent":{"xt":"urn:btih:c03d34679136311785b2318b17de280a7aa0590d","amp;dn":"Fire+Storm+Over+Dresden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c03d34679136311785b2318b17de280a7aa0590d","infoHashBuffer":{"type":"Buffer","data":[192,61,52,103,145,54,49,23,133,178,49,139,23,222,40,10,122,160,89,13]},"announce":[],"urlList":[]}}