{"title":"PMDG_BAe_JS4100_SP1.rar","uid":5793176,"size":215884021,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c0c2dfd0183faa41269d6bf2f644ecb50abd2d54&amp;dn=PMDG_BAe_JS4100_SP1.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZiP2150","files":1,"time":1282932642,"description":" The crack was not made by me, so credits go to whoever made the original &quot;PMDG_BAe_JS4100.DLL&quot;.\n I`m not a coder or anything like that, this is just something i`ve figured by myself and i made this account just to share it with the comunity, so if anything goes wrong blame it on yourself :D\n With that being said , let`s continue with the release notes : \nVersion 1.10.1016  Released 11OCT09\n-----------------\n- Modified Engine Start Sounds to ease transition.\n- Eliminated reported VNAV CTD error in FMS.\n- Eliminated &quot;CTD on Exit&quot; error.\n- Updated J41 Configuration Tool to correct for various visual anomalies.\n- Modified J41 to account for sensor package on HKG Flying Service J41 Livery. (available from download page.)\n- Updated FSX ATC callsigns.\n- Added Custom Keyboard Commands for various cockpit controls\n- Corrected inverter error that prevented AHRS from dumping alignment when all busses were de-powered and batteries turned off.\n- Various visual and artwork fixes to VC and external model.\n TO INSTALL follow these steps in the exact same order :\n1. Remove any previous instalations of this plane along with any liveries \n2. Install &quot;PMDG BAe JS4100.exe&quot;\n3. copy &quot;PMDG_BAe_JS4100.DLL&quot; to &quot;C:\\Program Files\\Microsoft Games\\Microsoft Flight Simulator X\\Gauges&quot; or whatever instalation path you have for the /Gauges folder\n4. Launch a FSX flight using the plane you just installed then exit FSX \n5. Install &quot;PMDG BAe JS4100 SP1.exe&quot;&quot;\n6. Go to  &quot;C:\\Program Files\\Microsoft Games\\Microsoft Flight Simulator X\\SimObjects\\Airplanes&quot; and copy the entire folder named &quot;PMDG_JS4100&quot; to a diferent location\n7. Uninstall the plane , start a flight with fsx, exit the sim then restart your PC\n8. Repeat steps 2-4 then replace &quot;C:\\Program Files\\Microsoft Games\\Microsoft Flight Simulator X\\SimObjects\\Airplanes\\PMDG_JS4100&quot; with the folder you copyed earlier\n9. Enjoy your flights !!!\n I`m using a cracked FSX with cracked Acceleration, under Win 7 ultimate, this may or may not work with other instalations but it worked fine for me. \n P.S. i`m not looking for any kind of recognition, if you enjoyed the torrent leave some kind of feedback, or not, keep the flaming for yourself because i`ve already stated i`m not a coder, cracker or whatever, i`m just a dude who looked for a SP for this plane for ages now, and figured i could help others in my position. \n Sorry if i`m double posting but i can`t find my original torrent anywhere....","torrent":{"xt":"urn:btih:c0c2dfd0183faa41269d6bf2f644ecb50abd2d54","amp;dn":"PMDG_BAe_JS4100_SP1.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c2dfd0183faa41269d6bf2f644ecb50abd2d54","infoHashBuffer":{"type":"Buffer","data":[192,194,223,208,24,63,170,65,38,157,107,242,246,68,236,181,10,189,45,84]},"announce":[],"urlList":[]}}