{"title":"Tom And Jerry Classic Collection - 12 Vol - DVDRip - x264 - MKV ","uid":5759738,"size":3804217023,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c22410030b17910e7e9b0bd27162e6c0a3627b2f&amp;dn=Tom+And+Jerry+Classic+Collection+-+12+Vol+-+DVDRip+-+x264+-+MKV+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RiddlerA","files":-1,"time":1281688224,"description":"Tom And Jerry Classic Collection - 12 Vol - DVDRip - x264 - MKV\n\n\nPlot Info :\n\nTom and Jerry was created by William Hanna and Joseph Barbera, considered by many the greatest cartoonists in the history, and its production involved a lot of people including Chuck Jones and Fred Quimby, the most important members of the crew after Hanna and Barbera. \n\nBasically, the show is about a cat called Tom whose passion is chasing a mouse called Jerry. However, Jerry isn't a typical mouse. He is very smart and knows how to hide from Tom. Using several dangerous tools, weapons and artifacts, such as guns, axes, knifes and explosives, the cat and the mouse try to get rid of each other. \n\nWhile it may sound to many like a pointless action show at a first glance, the show is more than just seeing two animals trying to kill each other. The smart way in that the pursuits are handled make this apparently &quot;pointless&quot; show in a funny comedy which is, at the same time, packed with a good (but still healthy and suitable for all ages) amount of action and adventure. \n\nThis show has managed to become one of the most famous and influential shows in the history of cartoons. Being produced between 1940 and 1980, with a massive production between 1941 and 1967, a whole generation grew up watching Tom and Jerry, becoming a classic. \n\nSomething strange of Tom and Jerry is that the main two characters (Tom &amp; Jerry) almost never speak, and when they do, it's usually something like &quot;Aha!&quot;, &quot;Don't believe him&quot;, or simply a loud scream. Because of this, the show is almost entirely based on its visual quality and the characters movements. Also, the show needed good sound effects and background music. In the Gene Deitch's episodes, the lack of music was an important factor that greatly decreased the quality of the episodes.\n\n\n                        \n                        Small Size Excellent Quality.\n\n\n\nRelease Info :\n\n\nEACH EPISODE @ 20MB\n15 EPISODES / PER VOLUME \n15 EPISODES @ 20MB / PER VOLUME = [300MB] \n12 VOLUMES = 180 EPISODES\n\n[FORMAT]: ......................[ Matroska\n[GENRE]: .......................[ Drama | Horror | Mystery | Sci-Fi | Thriller \n[FILE SIZE]: ...................[ 300 MB\n[NO OF CDs]: ...................[ 12\n[RESOLUTION]: ..................[ 448 x 336\n[ASPECT RATIO]: ................[ 4:3\n[Video Bitrate]: ...............[ 350 kbps\n[FRAME RATE]: ..................[ 23.976 fps\n[LANGUAGE]: ....................[ English\n[SUBTITLES]: ...................[ No, are u kidding\n\n\n\nInstall K lite Codec or Combined Codec Pack in case of any problem in opening the file\n\n\n                          \n                       Enjoy &amp; Seed After Downloading.\n\n\n\n\nA few FAQs Regarding my uploads :\n\n\n\n1. What is x264? \n\n\nx264 is an open-source encoder for the H.264 codec used for High-Definition movies on HD-DVDs and Blu-Ray Discs. It has a high compression which is way superior to xvid. That means you get more quality at equal bitrates. A 700MB x264 rip will be sharper and more detailed than a 700MB xvid rip from the same source. x264 is the future in DVDrips!\n\n02. What is a .mkv file? \n\n\nMKV means &quot;matroska video&quot; and it is a &quot;extensible open standard Audio/Video container&quot; (AVI is a container, too!). This file format combines several videostreams, audiostreams, subtitles, chapters and information in only one file. It supports new standards like 6-channel AAC (Advanced Audio Coding) audio or x264 video.\n","torrent":{"xt":"urn:btih:c22410030b17910e7e9b0bd27162e6c0a3627b2f","amp;dn":"Tom+And+Jerry+Classic+Collection+-+12+Vol+-+DVDRip+-+x264+-+MKV+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c22410030b17910e7e9b0bd27162e6c0a3627b2f","infoHashBuffer":{"type":"Buffer","data":[194,36,16,3,11,23,145,14,126,155,11,210,113,98,230,192,163,98,123,47]},"announce":[],"urlList":[]}}