{"title":"Repo_Men_2010_UNRATED_FULL_DVD9_PAL","uid":5756573,"size":8209146119,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c23fae3ae91999fefabf761999cadbec5e338625&amp;dn=Repo_Men_2010_UNRATED_FULL_DVD9_PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1281582360,"description":"Repo Men 2010\n\nSize: 7.64 Gb ( 8 016 046 KBytes )DVD-9\nEnabled regions: 1, 2, 3, 4, 5, 6, 7, 8\nGenre:Action | Sci-Fi | Thriller\nCast:Jude Law , Forest Whitaker , Alice Braga , Liev Schreiber\nIMDB Rating 6.3\nAudio:\nEnglish (Dolby AC3, 6 ch)Magyar (Dolby AC3, 6 ch)Russian (Dolby AC3,6ch) English(Dolby AC3, 2 ch)\nSubtitles:\nEnglish Russian Magyar Ukrainian Estonian Latvian Lithuanian \n\n\nIn the future, artificial internal organs will be widely available, but their high cost will lead to a thriving, if bloody, repossession business--at least that's the idea in Repo Men, whose title characters must carry scalpels, and not scruples. When clients default--and, at 19 percent interest rates, it happens all the time--it's up to Remy (Jude Law) and Jake (Forest Whitaker), the two most swashbuckling field operatives at the Union company, to reclaim the merchandise. The film's reviewers largely seemed to miss the wicked humor that underlies Repo Men's kooky futuristic world, as Remy's domestic situation is portrayed with typical backyard barbecues and typical nagging wife who wants hubby to ask his boss about that promotion, already. Everything's amusingly typical, that is, except for the fact that Remy regularly charges into people's apartments and grabs their kidneys. It would be nice to report that director Miguel Sapochnik was able to maintain the initial air of satire (RoboCop comes to mind at least as often as an obvious inspiration such as Brazil), but this movie begins to stumble in its middle section, as Remy himself becomes a subject for organ replacement. (His efforts at self-medicating procedures, especially a climactic surgery sequence, leave Patrick Swayze's similar efforts in Road House far behind.) Sudden shifts to a woman-in-peril scenario--with capable Alice Braga as the target of Union's organ hunters--make for an even more puzzling turn, and the jumbled rhythm of the second act suggests a certain amount of postproduction futzing around. The soundtrack is rife with Guy Ritchie-style song cues, some of which are fun, and Liev Schreiber has a good time smirking his way through his role as Remy's cold-hearted boss. The biggest problem here is that once the movie is over, a great many things don't make any logical sense, and a last-minute switcheroo only muddies the waters. Which are pretty bloody to begin with. --Robert Horton\n\n","torrent":{"xt":"urn:btih:c23fae3ae91999fefabf761999cadbec5e338625","amp;dn":"Repo_Men_2010_UNRATED_FULL_DVD9_PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c23fae3ae91999fefabf761999cadbec5e338625","infoHashBuffer":{"type":"Buffer","data":[194,63,174,58,233,25,153,254,250,191,118,25,153,202,219,236,94,51,134,37]},"announce":[],"urlList":[]}}