{"title":"Inside The Bermuda Triangle - Audio Documentary - MP3 - Slimoo","uid":5764506,"size":129490116,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c2693b656a446c7316ab7cdf609a7c9e9d8aab0e&amp;dn=Inside+The+Bermuda+Triangle+-+Audio+Documentary+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"_Slimoo_","files":10,"time":1281841941,"description":"Inside The Bermuda Triangle - The Mysteries Solved - Audio Documentary - BBC Radio 4 via DVB-T\n10 x 15 Minute Episodes - 128k - Mp3 - Slimoo\n\nInvestigative journalist Tom Mangold journeys inside the Bermuda Triangle to try to get to the truth about this mysterious area.\n\n\n\nThe &quot;Bermuda or Devil's Triangle&quot; is an imaginary area located off the southeastern Atlantic coast of the United States, which is noted for a high incidence of unexplained losses of ships, small boats, and aircraft. \n\nThe apexes of the triangle are generally accepted to be Bermuda, Miami, Fla., and San Juan, Puerto Rico. \nHowever, The U. S. Board of Geographic Names does not recognize the Bermuda Triangle as an official name and does not maintain an official file on the area.\n\nAn area called the &quot;Devil's Sea&quot; by Japanese and Filipino seamen, located off the east coast of Japan, also exhibits the same magnetic characteristics. It is also known for its mysterious disappearances\n\n\n\n1/10. What is the genesis of the Bermuda Triangle story and why does it persist?\n2/10. In 1948, British South American Airways flight Star Tiger vanished into the Triangle\n3/10. Tom visits Lloyds Register in London to fathom two enduring maritime mysteries\n4/10. Tom meets the most recent of the many Bermuda Triangle authors\n5/10. Tom's scepticism is challenged by a pilot's experience in the Triangle. \n6/10. Tom tracks down one of the original Bermuda Triangle authors.\n7/10. Tom pursues the truth about Charles Berlitz and speaks to his daughter, Lin Hilton\n8/10. Links between the disappearance of hundreds of seamen and the mythical kingdom of Atlantis\n9/10. Revisiting the story of British South American Airways and the last flight of Star Ariel\n10/10. Tom concludes his rigorous investigation by visiting Bermuda itself\n\n\nBermuda Triangle &gt; http://en.wikipedia.org/wiki/Bermuda_Triangle\n\n\nInside The Bermuda Triangle - The Mysteries Solved - 01 of 10 \nInside The Bermuda Triangle - The Mysteries Solved - 02 of 10\nInside The Bermuda Triangle - The Mysteries Solved - 03 of 10 \nInside The Bermuda Triangle - The Mysteries Solved - 04 of 10\nInside The Bermuda Triangle - The Mysteries Solved - 05 of 10 \nInside The Bermuda Triangle - The Mysteries Solved - 06 of 10\nInside The Bermuda Triangle - The Mysteries Solved - 07 of 10 \nInside The Bermuda Triangle - The Mysteries Solved - 08 of 10\nInside The Bermuda Triangle - The Mysteries Solved - 09 of 10 \nInside The Bermuda Triangle - The Mysteries Solved - 10 of 10\n\n\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 13mn 36s\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n \n\n\n[","torrent":{"xt":"urn:btih:c2693b656a446c7316ab7cdf609a7c9e9d8aab0e","amp;dn":"Inside+The+Bermuda+Triangle+-+Audio+Documentary+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2693b656a446c7316ab7cdf609a7c9e9d8aab0e","infoHashBuffer":{"type":"Buffer","data":[194,105,59,101,106,68,108,115,22,171,124,223,96,154,124,158,157,138,171,14]},"announce":[],"urlList":[]}}