{"title":"Doctor Laser - One Of Worlds Last Holographers DIVX AVI","uid":5784878,"size":374835968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4476b8a4317e66bf2999b12daea3f5623ce6d5f&amp;dn=Doctor+Laser+-+One+Of+Worlds+Last+Holographers+DIVX+AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ottoskorzeny","files":-1,"time":1282569940,"description":"Doctor Laser: Inside the Wondrous Lab of One of the World's Last Holographers\n\nIn the heyday of holography, back in the 1970s, there were four schools dedicated to the holographic arts around the world, and five studios in New York City alone. Today, there are only a few left in the world. And no one is holding the candle higher than Doctor Laser.\n\nIn this episode of Motherboard, the winner of our Make Your Own Documentary contest Pam Tietze, gets up close and personal with one of the last dogged practitioners of the holographic arts.\n\nJason Sapan, as his birth certificate calls him, is sort of like a laser Doc Brown, and his cluttered New York studio-laboratory (replete with devoted interns) feels something like a time machine, a living ode to a seemingly obsolete art. But listen to him tell it -- and take a look around his studio -- and you might agree that there's no more accurate way of representing the world than with holography.\n\nThe walls bear witness to his cachet at the height of the holographic era: Andy Warhol, Pierre Cardin, Cher, Bill Clinton, Sally Jesse Raphael, Ed Koch and Isaac Asimov have all sat for Doctor Laser.\n\nHis laser lighting has been used at the original Studio 54, on CBS, in print advertising for Macy's and Revlon, on Broadway, for book and magazine covers, and graphics at the original Studio 54, and a number of music videos, including a starring role in one by Flock of Seagulls, which landed him the first on-air credit in a video on MTV. In 2001, the producers of Vanilla Sky asked him to help them design a saxophone-playing hologram. (Rest assured: had nothing to do with this.)\n\nWhile moving holograms that float in midair remain the stuff of science-fiction, Doctor Laser has pieced together a reality that's much stranger: that studio in Midtown Manhattan, tucked into a former blacksmith's forge, is a veritable wonder cabinet of dancing 3D imagery, flashing lasers and homemade holography equipment. He revels in that DIY-ness.\n\n&quot;To be able to take the ordinary, and work with whatever's at hand, and turn it into a technological miracle&quot; is what excites him most. &quot;'You could have picked this up at Radio Shack. Why are you building it yourself, Doctor?' he says, imitating one of his gaggle of mad, devoted interns. &quot;Because I can.&quot;\n\nBut being one of the last people at the party is tough, and in spite of current 3D obsessions, getting the world to come back to the party seems even harder. But he's not giving up. He's even confident he can get President Obama to become the first sitting president to pose for a hologram. &quot;Delusion isn't always a bad thing,&quot; he says. Neither is illusion -- especially when it's made with homemade lenses and lasers.\n\n\nNOTE: I am posting this here because the original web site deliberately made it a pain in the ass to download and watch offline.  Why?  So I am uploading to a sensible distribution method to save others the time I had to waste streamripping it.  Seed and enjoy!","torrent":{"xt":"urn:btih:c4476b8a4317e66bf2999b12daea3f5623ce6d5f","amp;dn":"Doctor+Laser+-+One+Of+Worlds+Last+Holographers+DIVX+AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4476b8a4317e66bf2999b12daea3f5623ce6d5f","infoHashBuffer":{"type":"Buffer","data":[196,71,107,138,67,23,230,107,242,153,155,18,218,234,63,86,35,206,109,95]},"announce":[],"urlList":[]}}