{"title":"Leonard Cohen - Songs from the Road [mp3-vbr-2010]","uid":5767411,"size":120875369,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c49f37738c7410f33e36b0471ff6b7226a34f203&amp;dn=Leonard+Cohen+-+Songs+from+the+Road+%5Bmp3-vbr-2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"trfkad","files":-1,"time":1281964504,"description":"\n1. Lover, Lover, Lover (Ramat Gan Stadium, Tel Aviv, Israel September 24, 2009)\n2. Bird On The Wire (Clyde Auditorium, Glasgow, Scotland November 6, 2008)\n3. Chelsea Hotel (Royal Albert Hall, London, England November 17, 2008)\n4. Heart With No Companion (Oberhausen King Pilsener Arena, Oberhausen, Germany November 2, 2008)\n5. That Don t Make It Junk (O2 Arena, London, England November 13, 2008)\n6. Waiting For The Miracle (HP Pavilion, San Jose, California November 13, 2009)\n7. Avalanche (Gothenburg Scandinavium, Gothenburg, SwedenOctober 12, 2008)\n8. Suzanne (MENA Arena, Manchester, EnglandNovember 30, 2008)\n9. The Partisan (Hartwall Arena, Helsinki, Finland October 10, 2008)\n10. Famous Blue Raincoat (O2 Arena, London, England November 13, 2008)\n11. Hallelujah (Coachella Music Festival, Indio, California April 17, 2009)\n12. Closing Time (John Labatt Centre, London, Ontario May 24, 2009) \n\n\nArtist: Leonard Cohen\nTitle: Songs From The Road\nStore Date: 14 sep 2010\nUpload Date: 16 aug 2010\nLabel: Sony\nGenre: Songwriting\nCover: front\nBitrate: vbr kb/s, joint stereo \n\n\nFollowing the celebration of his 40th year as a Columbia artist in 2007 and coinciding with his induction into the Rock And Roll Hall Of Fame in March 2008, Cohen thrilled his fans by announcing his first tour dates in 15 years. He s gone on to play the most prestigious and beautiful venues in virtually every corner of the globe, mesmerizing and charming audiences with performances that were hailed as some of the best of his career. When legend Cohen takes to the stage, raved Ireland s The Independent (June 2008), it s no less than a cultural event of Biblical dimensions. One dozen of Leonard Cohen s most famous songs from those recent world tour performances at auditorium halls, festivals, arenas, and stadiums from Tel Aviv to London, from across Europe to the California desert and his native Canada are now collected on SONGS FROM THE ROAD. The 12-song program filmed in high definition and recorded in 5.1 surround sound will be issued in three separate packages: CD+DVD in a beautiful softpak with a 12-page book, Blu-ray, and 2-LP 180-gram audiophile vinyl in a gatefold jacket. \n\n\n","torrent":{"xt":"urn:btih:c49f37738c7410f33e36b0471ff6b7226a34f203","amp;dn":"Leonard+Cohen+-+Songs+from+the+Road+%5Bmp3-vbr-2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c49f37738c7410f33e36b0471ff6b7226a34f203","infoHashBuffer":{"type":"Buffer","data":[196,159,55,115,140,116,16,243,62,54,176,71,31,246,183,34,106,52,242,3]},"announce":[],"urlList":[]}}