{"title":"Denny Gerrard - Sinister Morning (1970) (VinylRip 24-96) [FLAC]","uid":6315175,"size":815252126,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c51cb58b2495ba6ef2d27d390635e2b4fc58eefd&amp;dn=Denny+Gerrard+-+Sinister+Morning+%281970%29+%28VinylRip+24-96%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zibbik","files":14,"time":1302681632,"description":"Artist: Denny Gerrard\nTitle: Sinister Morning\nGenre: Folk Rock,Psych Pop\nOrigin: UK\n(Deram Nova 1970) 24-bit/96kHz Vinyl Rip\n\nIt wasn't long after arriving in the U.K. that South African student Denny Gerrard began making his mark on the music scene. In 1965, Jimmy Page picked him to become one half of the duo the Fifth Avenue, while Rolling Stones' manager Andrew Loog Oldham brought him in as arranger for his project the Variations. Gerrard then linked up with Barry Younghusband, and as Warm Sounds they promptly unleashed the Top 30 hit &quot;Birds and Bees.&quot; Swiftly bored with pop the duo soon split, and Gerrard moved into production, overseeing High Tide's critically acclaimed 1969 debut album, Sea Shanties.\n\nNo surprise then, that when the South African began work on his own debut, self-produced, full-length, High Tide were by his side. However, the resulting album, Sinister Morning, was far more a reflection of Gerrard's vision than Tide's sound. Much of the set has a folkie feel, accentuated by the prolific use of Gerrard's acoustic guitar and harmonica. Only on &quot;Native Sun&quot; is the band given a real chance to rock out, with the rest of the set given over to more mid-tempo numbers. These gave Gerrard the opportunity to explore his roots and showcase his arrangement skills. His epiphany is found on the final track, a haunting, seven-plus minute instrumental, whose rich &quot;Atmosphere&quot; is conjured up by his acoustic guitar and Simon House's delicate organ and rich violin. J.J. Mackey provides the spoken word segments that, sadly, are virtually buried in the mix. The album's other epic track, &quot;True Believer&quot; takes folk to church, with House's hymnal organ juxtaposed against a rich, Americana tapestry. &quot;Autumn Blewn,&quot; in contrast, counterpoints '60s R&amp;B with C&amp;W, with Gerrard's harmonica adding a folkie feel to the intricate piece. &quot;Rough Stuff&quot; also has an R&amp;B bend, but a down-home, Southern rock tinge, while &quot;Stop or Drop It&quot; is even more rousing, as Gerrard plays his pusillanimous acoustic guitar off against Tony Hill's electric leads. Although kept on a tight leash, High Tide still bring an energy to the set, turning up the heat on virtually all the songs, particularly the poppy &quot;Hole in My Shadow,&quot; which was probably intended for singledom. The production gives the entire album a warm sound. The only flaw within is Gerrard's decision to over-utilize layered vocals instead of true harmonies, and paying far less attention to his vocals than he did to the rest of the album's sound. Released on Decca's mid-price imprint Nova, the album surprisingly sank without a track, but swiftly became a much sought-after collector's item. Jo-Ann Greene AMG\n\nTrack listing:\n\nA1. Native Sun - 3.56 min\nA2. True Believer - 7.07 min\nA3. Hole In My Shadow - 3.22 min\nA4. Last But One - 4.07 min\nB1. Rough Stuff - 2.59 min\nB2. Stop Or Drop It - 2.52 min\nB3. Autumn Blewn - 2.54 min\nB4. Eye For Eye - 4.36 min\nB5. Atmosphere - 7.12 min \n","torrent":{"xt":"urn:btih:c51cb58b2495ba6ef2d27d390635e2b4fc58eefd","amp;dn":"Denny+Gerrard+-+Sinister+Morning+%281970%29+%28VinylRip+24-96%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c51cb58b2495ba6ef2d27d390635e2b4fc58eefd","infoHashBuffer":{"type":"Buffer","data":[197,28,181,139,36,149,186,110,242,210,125,57,6,53,226,180,252,88,238,253]},"announce":[],"urlList":[]}}