{"title":"Ansiedad (Anxiety)","uid":5768554,"size":720628235,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c651fa62cf9b451ab390cb847ce254457821e794&amp;dn=Ansiedad+%28Anxiety%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubusdemonoid","files":-1,"time":1282018210,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 60 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can\\'t continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nIn Spanish - NO subtitles, sorry.  :-[ \n\nThe Mexican Ansiedad (Anxiety) is a showcase for three top South-of-the-Border talents. The film stars Argentine tango singer Libertad Lamarque, &quot;pop&quot; vocalist Pedro Infante and songwriter Agustin Lara. With this line-up, a plot seemed unnecessary, but plot there was. Lamarque plays a recently widowed singer, saddled with a troublesome son (Infante). Her other son (Lara) is a prim-and-proper businessman, albeit one with a potentially injurious &quot;get rich quick&quot; mindset. Along the way, Lamarque is allowed to execute a delightful dance number with a bevy of tropical beauties.\n\nFrom IMDB:\nWhere to begin? Perhaps by simply stating &quot;this is a fine film.&quot; The black and white photography invites the viewer into an odd story of family intrigue capped by entertaining singing and song. I guess Ansiedad could be classified as a musical, but since all musical numbers are not stylized into the story (all music is on stage within the film reality - the characters are singers by trade) Ansiedad could be classified simply as drama. Hidden within this film is commentary on class structure, pursuing what one loves, and personal redemption. Pedro Infante turns in three fine performances. First as concerned father and husband of Libertad Lamarque, then as grownup twin sons. Apt camera angles and editing combines his twin roles simultaneously into several scenes. Not that I'm an expert, but this film stands as a fine example of the golden age of Mexican cinema. \n\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\t\t","torrent":{"xt":"urn:btih:c651fa62cf9b451ab390cb847ce254457821e794","amp;dn":"Ansiedad+%28Anxiety%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c651fa62cf9b451ab390cb847ce254457821e794","infoHashBuffer":{"type":"Buffer","data":[198,81,250,98,207,155,69,26,179,144,203,132,124,226,84,69,120,33,231,148]},"announce":[],"urlList":[]}}