{"title":"Stan Kenton Orchestra - Stompin' At Newport (1957) (FLAC)","uid":6374215,"size":170491186,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c796d6ff862acc93c57c713b4a2200d30adc3294&amp;dn=Stan+Kenton+Orchestra+-+Stompin%5C%27+At+Newport+%281957%29+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiddler22","files":15,"time":1304794498,"description":"\n\nReviewby Alex Henderson (AMG):\nWhen you're a serious jazz collector, it is both frustrating and exciting to think about all the live recordings that are tucked away in people's private collections. It is frustrating to think of all the Lester Young, Ella Fitzgerald, John Coltrane, and Duke Ellington performances that were taped but will never see the light of day commercially; however, some live jazz recordings that have been gathering dust for decades eventually find their way to the general public. Stompin' at Newport, for example, boasts a Stan Kenton set that remained in the can for no less than 45 years; the performances were recorded at 1957's Newport Jazz Festival, but did not become commercially available until 2002. For decades, these performances remained in the private collection of the late Norman Granz, who directed 1957's Newport Festival. But eventually, Fantasy got the chance to release them on CD. Stompin' at Newport is unlikely to convert anyone who isn't already a confirmed Kenton addict; nonetheless, his hardcore followers will find the material to be solid and pleasing. Kenton's 1957 band is in fine form on familiar items such as &quot;The Peanut Vendor,&quot; &quot;Intermission Riff,&quot; and &quot;Artistry in Rhythm,&quot; and the big band leader/pianist sees to it that some impressive soloists are featured -- people like tenor saxophonist Bill Perkins on &quot;Yesterdays,&quot; alto saxophonist Lennie Niehaus on &quot;The End of a Love Affair,&quot; and trumpeter Sam Noto on &quot;Everything Happens to Me.&quot; Another highlight of the concert is Johnny Richards' &quot;La Suerte de los Tontos,&quot; a Latin-flavored gem that appeared on Kenton's superb Cuban Fire! session of 1954. Although not essential and not recommended to casual listeners, Stompin' at Newport is an album that seasoned Kenton fans will be happy to add to their collections. \n\n Personnel:\n Ed Leddy, Sam Noto, Lee Katzman, Phil Gilbert &amp; Bill Catalano - Trumpets\n Kent Larsen, Archie LeCoque, Don Reed, Jim Amlotte &amp; Kenny Shroyer - Trombones\n Lennie Niehaus, Bill Perkins, Wayne Dunstan, Steve Perlow &amp; Bill Robinson - Saxophones\n Stan Kenton - Piano\n Red Kelly - Bass\n Jerry McKenzie - Drums\n\n01. The Opener\n02. Artistry In Rhythm \n03. Stompin At The Savoy\n04. Yesterdays \n05. Intermission Riff \n06. 23 Degrees North 82 Degrees West \n07. Everything Happens To Me  \n08. The Peanut Vendor\n09. The End Of A Love Affair\n10. Young Blood \n11. La Suerte De Los Tontos (Fortune Of Fools)\n12. The Big Chase\n\n ","torrent":{"xt":"urn:btih:c796d6ff862acc93c57c713b4a2200d30adc3294","amp;dn":"Stan+Kenton+Orchestra+-+Stompin%5C%27+At+Newport+%281957%29+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c796d6ff862acc93c57c713b4a2200d30adc3294","infoHashBuffer":{"type":"Buffer","data":[199,150,214,255,134,42,204,147,197,124,113,59,74,34,0,211,10,220,50,148]},"announce":[],"urlList":[]}}