{"title":"Unsolved Mysteries Disc 12","uid":5820923,"size":4690907401,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c800c3296740bd5ac07b35b6507280def9c407e5&amp;dn=Unsolved+Mysteries+Disc+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slasherman","files":-1,"time":1284043419,"description":" &lt;a href=&quot;http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_000-2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_000-2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_002-4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_002-4.jpg&lt;/a&gt;\n\nOnly murder, wanted and unexplained deaths..real crime stuff.\nThe quality is very poor. Old vhs tapes which has been compressed into small file size. Typical vhs noise on most.\n\nTime: About 6 hours\n\nHow to burn:\nI have chosen .iso file.\nIf you use ImgBurn: WRITE IMAGE FILE TO DISC\nI tested it at 6x write speed and it worked perfectly...\nRemember to keep the .iso file on your pc so you can seed.\n\nDisc 12\n- &quot;Surprise&quot; - I don't want to give away what this first one is about but its something I think you guys will appreciate.\n- Gertrude Pruitt- An elderly woman who handed out fruitcakes and defrauded unsuspecting investors out of their money. Police are looking for her.\n- Eugene Bailey- Former Florida mayor who was shot &amp; left for dead while his friend was murdered. The man convicted of his assault is on the run.\n- Carlos Garcia- Man who conned fellow Hispanics that were members of his church out of money. He's on the run.\n- John Bryson Vogel- One of the most prolific counterfeiter's in United States history is sought.\n- Howard Drummond- An elderly eccentric man who seemed to live like a pauper passes away leaving a fortune. Searching for his heirs.\n- Darlie Routier- Convicted of murdering her two sons and sentenced to death. Some people think she is innocent.\n- James &quot;Whitey&quot; Bulger - is wanted by police on extortion and racketeering charges. Nicknamed the &quot;Godfather of the Irish Mob&quot;.\n- Richard McNair has escaped from prison and is wanted by the police.\n- Reggie diPalma worked with an Explorer Scout troop in Connecticut and also molested some of his charges. He's been convicted but is on the run.\n- Curandero - Phony Mexican folk healer is wanted for bilking people who had trusted him out of their money. Real name is Jorge Cortez.\n- Gene Flannes conned retirees in Arkansas out of their money. Searching for him.\n- John Branion- a well respected doctor was convicted of murdering his wife. Many people think he is innocent.\n- Coma - Four young children in same family have mysteriously fallen into a coma. Two of them have died. Family looking to the medical community for help in diagnosing this mystery illness.\n- Monica Bonilla- is a missing girl abducted by her father who was found thanks to the Nyleen Kay Marshall segment.\n- Josephine White is a conwoman who tricks unsuspecting strangers out of their money using the &quot;pigeon drop&quot; scam.\n- Dr. Fraud is accused of impersonating a doctor and conning people out of money using coins he claims are valuable.\n- Mail bombs- Mail bombs are sent to televangelists Pat Robertson and John Osteen. Police searching for those responsible.\n- JD Method is wanted for charming women and then conning them out of their money.\n- &quot;Tom Hughes&quot; was a professional hospital patient and police believe used the scam to obtain pain pills. He has since died and police are trying to find out his true identity.\n- Tom Roche, biker, went missing one day without a trace. An anonymous letter writer claims he killed Tom.\n- Dede Rosenthal disappeared mysteriously from her apartment. A few people have claimed to have seen her and her family is desperate to find her.\n- &quot;Cachimba&quot; is sought for a hit and run that killed 11 year old Pedro Santiago Jr. RS also profiles two other hit and run drivers police are searching for.\n- Rudolf Hess was Hitler's right hand man. He was imprisoned and later died mysteriously. Was it really Hess that was in prison and was he murdered to silence him?\n- Dr. Ted Loseff a respected physician died unexpectedly. Police initially said it was a suicide but Ted's mother thinks he was murdered by a hit his wife put out on him.\n- Port Chicago Mutiny - 50 black Navymen were convicted of mutiny after refusing to load dangerous ammunitions. They want their name cleared.\n- Kenneth Robert Stanton is a serial child molester. He has been placed on the FBI's 10 Most Wanted List.\n- David Cox was one of the Marines whose story was told in the movie &quot;A Few Good Men&quot;. He was outspoken about the movie and was later murdered and police are looking for his killer.\n- Marlene Santana was abducted at gunpoint from her mother when she was 3 days old. Family is still searching for her. RS profiles other abducted children.\n- Aimee Willard, a college standout, was raped and murdered. Police are searching for her killer.\n- Jeannie Boylan is profiled as a highly acclaimed composite sketch artist. She is working on a sketch of the suspect in the murder of Jonathan Francia.\n- Amber Swartz was abducted while out playing in her yard. Her mother thinks that Tim Bindner is responsible and he is suspected by some in the abductions of several little girls.\n- Rena Paquette was murdered. Twenty years later her son Danny Paquette was also murdered. Could it have been because they knew too much about a murder that took place?\n- Eric Kessler is a conman accused of bilking middle aged women out of hundreds of thousands of dollars. Police are searching for him.\n- Sarah Powell stays home from school one day and awakes tied up with her house ransacked and suffering from amnesia. Looking for suspects.\n\nVideo Attributes:\n  Video compression mode: MPEG-1\n  TV system: 525/60 (NTSC)\n  Aspect Ratio: 4:3\n  Source picture resolution: 352x240 (525/60)\n  Frame Rate: 30.00\n  Bitrate: 4.11Mbps\t\t\n\nIf you need more information or want to discuss the cases you can do it on this excellent forum http://www.sitcomsonline.com/boards/forumdisplay.php?f=322\nSpecial thanks to crystaldawn who is a UM genius.\n","torrent":{"xt":"urn:btih:c800c3296740bd5ac07b35b6507280def9c407e5","amp;dn":"Unsolved+Mysteries+Disc+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c800c3296740bd5ac07b35b6507280def9c407e5","infoHashBuffer":{"type":"Buffer","data":[200,0,195,41,103,64,189,90,192,123,53,182,80,114,128,222,249,196,7,229]},"announce":[],"urlList":[]}}