{"title":"Cobra - Frederick Forsyth.(ebook)","uid":6325813,"size":6435049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c80033ce0a0d627832baf0425ef82100596d84ed&amp;dn=Cobra+-+Frederick+Forsyth.%28ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1303113377,"description":"El presidente de EE. UU. decide desmantelar el trÃƒÂ¡fico de cocaÃƒÂ­na en su paÃƒÂ­s y le encarga un plan a Cobra, un ex agente tan eficaz como despiadado. El plan funciona pero con tanto dinero en juego, Ã‚Â¿hay alguien en quien se pueda confiar? El negocio de la cocaÃƒÂ­na mueve billones de dÃƒÂ³lares cada aÃƒÂ±o. Su consumo causa un nÃƒÂºmero incalculable de muertes y su dominio crece a un ritmo implacable.\n\nUn dÃƒÂ­a el presidente de Estados Unidos decide invertir todos sus esfuerzos en acabar con este negocio y le encarga esta tarea, aparentemente imposible, a Paul Deveraux, un ex agente de la CIA extremadamente inteligente, dedicado y tan audaz como despiadado. Si alguien en el mundo puede hacer este trabajo, es ÃƒÂ©l. Deveraux acepta el reto de desarticular los carteles de la droga, pero impone algunas condiciones: tendrÃƒÂ¡ a su disposiciÃƒÂ³n todo el dinero, los agentes y los recursos que considere necesarios. Y la misiÃƒÂ³n no finalizarÃƒÂ¡ hasta que haya alcanzado su objetivo. No hay lÃƒÂ­mites ni reglas y nadie harÃƒÂ¡ preguntas despuÃƒÂ©s.\n\n\n\nLa guerra ha estallado y han desaparecido las normas del combate. Desde las pistas de aterrizaje de la selva amazÃƒÂ³nica hasta los barrios bajos de BogotÃƒÂ¡, pasando por las espaciosas oficinas gubernamentales de Washington, Paul Deveraux, alias Cobra, descubre la escalofriante realidad del imperio mÃƒÂ¡s poderoso: el de la droga.","torrent":{"xt":"urn:btih:c80033ce0a0d627832baf0425ef82100596d84ed","amp;dn":"Cobra+-+Frederick+Forsyth.%28ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c80033ce0a0d627832baf0425ef82100596d84ed","infoHashBuffer":{"type":"Buffer","data":[200,0,51,206,10,13,98,120,50,186,240,66,94,248,33,0,89,109,132,237]},"announce":[],"urlList":[]}}