{"title":"A Formula Book of English Official Historical Documents","uid":6499832,"size":2641530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8f2fae32bb47861598bdf8629e7251de6f5616d&amp;dn=A+Formula+Book+of+English+Official+Historical+Documents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1309207168,"description":"Hubert Hall, &quot;A Formula Book of English Official Historical Documents (Cambridge Library Collection - History) (Volume 1)&quot;\nPublisher: Cambridge University Press | 2010 | ISBN: 1108010229 | PDF | 192 pages | 2.52 MB\n\nThis 1908 work supplements Hall's Studies in English Official Historical Documents. It gives examples of a wide range of English diplomatic documents from the seventh to the nineteenth centuries. These are arranged according to type and purpose, the majority in Latin, but others in French or English. The intention is to assist the user of such archival materials, by familiarising them with the format and language used in each kind of document, and explaining why and how they were written. The 211 transcriptions were made by palaeography students at the London School of Economics, and classified and edited with extensive notes by Mr Hall. They are not literal transcriptions, as contractions have been expanded, and the punctuation and capitalisation modernised. To save space, standard formulas have not been repeated each time. Despite the lack of any illustrations of originals, the book filled a need long felt by students of history. ","torrent":{"xt":"urn:btih:c8f2fae32bb47861598bdf8629e7251de6f5616d","amp;dn":"A+Formula+Book+of+English+Official+Historical+Documents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8f2fae32bb47861598bdf8629e7251de6f5616d","infoHashBuffer":{"type":"Buffer","data":[200,242,250,227,43,180,120,97,89,139,223,134,41,231,37,29,230,245,97,109]},"announce":[],"urlList":[]}}