{"title":"Robert Jordan - Het Rad des Tijds 8 - Het pad der dolken TBS","uid":6464549,"size":666260220,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c9decc3ba5299007bb6c16dd1b614e8cb7c9d634&amp;dn=Robert+Jordan+-+Het+Rad+des+Tijds+8+-+Het+pad+der+dolken+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1307915394,"description":"Audioboek - Robert Jordan - Het Rad des Tijds Boek 8 - HET PAD DER DOLKEN\n\n\nBeschrijving\n Nu de stad Ebo Dar is ingenomen door de Seanchaanse invallers trekken Nynaeve, Elayne en Aviendha naar Caemlin, waar Elayne een troon wacht. In Illian zweert Rhand dat hij de Seanchanen zal verdrijven, zoals hij al eerder heeft gedaan. Maar tekenen van waanzin onder zijn volgelingen dwingen hem tot een verstrekkend, misschien wel noodlottig, besluit. Intussen zet Perijn zijn leven op het spel om zijn geliefde Faile te redden, en de opstandige Aes Sedai, aangevoerd door de jeugdige Egwene Alveren, worden geconfronteerd met een leger dat hun de pas afsnijdt.\n \n\n\n\nRecensie(s)\nNBD|Biblion recensie\n In een semi-middeleeuwse magische wereld werd het uiterste Kwaad meer dan 4.000 jaar geleden verslagen tijdens het 'Breken' van de wereld. Het einde van de huidige eeuw is nakend en oude voorspellingen zeggen dat drie mensen het mystieke patroon van het Rad des Tijds (dat de wereld domineert) zullen herschikken tijdens een finale strijd, de apocalypse. Rhand Altor, de 'Herrezen Draak' en nu koning van de wereld, is in bestendig conflict gewikkeld tegen de manipulator achter de schermen, het Kwaad, de 'Duistere'. De Seanchanen hebben de stad Ebo Dar ingenomen en Rhand wil hen verdrijven, maar vindt waanzin onder zijn eigen geleiders. Egwene probeert nog steeds de Aes Sedai te herenigen als strijdmacht. Intussen beleven ook heel wat nevenpersonages (Rhands vrienden zoals Perrij en Nynaeve) hun eigen avonturen. Deel 8 in de continue cyclus 'Het rad des tijds', een vlot leesbaar fantasy-epos met sterk getekende personages (zij het dat er wat te veel zijn) en andere schepsels. Extreem complexe plot (kennis van de vorige delen is een noodzaak en de appendix moet veel gebruikt worden) met ettelijke verwikkelingen. Kleine druk.\n \n(Biblion recensie, Redactie) \n\nTBS","torrent":{"xt":"urn:btih:c9decc3ba5299007bb6c16dd1b614e8cb7c9d634","amp;dn":"Robert+Jordan+-+Het+Rad+des+Tijds+8+-+Het+pad+der+dolken+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9decc3ba5299007bb6c16dd1b614e8cb7c9d634","infoHashBuffer":{"type":"Buffer","data":[201,222,204,59,165,41,144,7,187,108,22,221,27,97,78,140,183,201,214,52]},"announce":[],"urlList":[]}}