{"title":"El Pan De Cada Dia.(1 de 3).(Docu.Spanish).","uid":5763799,"size":629155840,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:ca0f29c74c4de370b42d7fb77b45ffa51108621b&amp;dn=El+Pan+De+Cada+Dia.%281+de+3%29.%28Docu.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":-1,"time":1281809766,"description":"Historias de la Edad de Piedra\n\n1 - El pan de cada dia \n2 - SueÃƒÂ±o urbano\n3 - Oleadas de cambios\n\n\nRetrocedemos hasta mÃƒÂ¡s de 15.000 aÃƒÂ±os hasta el final de la Edad de Hielo. Fue un tiempo de cambio en todo el planeta. Durante 50.000 aÃƒÂ±os vastas capas de hielo habÃƒÂ­an cubierto el Viejo Mundo, Eurasia y AmÃƒÂ©rica.\nSegÃƒÂºn van disminuyendo las capas de hielo, la rza humana va avanzando. Los cambios climÃƒÂ¡ticos han creado nuevos habitantes. Han resurgido animales y plantas, algo de lo que se aprovechan nuestros ancestros. Para el homo sapiens cambios suponen cambios, de la familia al grupo, del grupo a la tribu, de la tribu a sociedades en el inicio de la civilizaciÃƒÂ³n\nHistorias de la Edad de Piedra explora un perÃƒÂ­odo crucial de la Historia que nos ayuda a saber cÃƒÂ³mo hemos llegado a ser como somos hoy. En tres episodios de una hora dibuja el entramado de los grandes cambios que nos transportaron de la Edad de Piedra a las primeras civilizaciones: Del comienzo de la agricultura que terminÃƒÂ³ con la forma de vida nÃƒÂ³mada, la creaciÃƒÂ³n de los primeros asentamientos y el descubrimiento del metal.\nn tres episodios de una hora, Histotorias de la edad de piedra traza la cadena de enormes cambios que nos transportaron de la Edad de Hielo a las primeras civilizaciones; del comienzo de la agricultura que terminÃƒÂ³ con la forma de vida nÃƒÂ³mada anterior, la creaciÃƒÂ³n de los primeros asentamientos y el descubrimiento del metal. Este perÃƒÂ­odo supuso un punto y aparte en nuestra especie.\n","torrent":{"xt":"urn:btih:ca0f29c74c4de370b42d7fb77b45ffa51108621b","amp;dn":"El+Pan+De+Cada+Dia.%281+de+3%29.%28Docu.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca0f29c74c4de370b42d7fb77b45ffa51108621b","infoHashBuffer":{"type":"Buffer","data":[202,15,41,199,76,77,227,112,180,45,127,183,123,69,255,165,17,8,98,27]},"announce":[],"urlList":[]}}