{"title":"Country Got Soul Vol.1","uid":5778775,"size":59830341,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca624c8d2b9ec4bbe93a88e22b2af12c4c8342c4&amp;dn=Country+Got+Soul+Vol.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thehealer","files":15,"time":1282341599,"description":"Think that white men can't do soul? Think that the country-soul thang started with \n\nLambshop's 'Nixon'? Think that all the current compilations out there are just \n\nstuff you've already got, but in a different order?\n\nWell, if you answered 'yes' to any of the above, then you need 'Country Got Soul',\n\na fantastic new compilation on Ross Allen's Causals Records, which has been compil-\n\ned by Jeb Lloy Nichols. If you love either soul or country (and let's face it, if\n\nyou think country is all Garth Brooks and line dancing, then you're a philistine),\n\nor particularly both, then it's a dream ticket.\n\nWhat it is, is a collection of tracks by a hole heap of artist (the likes of Tony\n\nJoe White, Dan Penn, Donnie Fritts, Eddie Hinton), all of whom you've probably nev-\n\ner heard from, who produced some amazing music back in the late sixties and early\n\nseventies. There was a small scene happening in the likes of Mempis and Muscle \n\nShoals, Tennessee, mixing up the twang of the country music coming from the mount-\n\nains and the blues coming from the Delta, with some real grit, fun and soul. The \n\nresult is some of the best old music heard in a long time - from the funky reinter-\n\npretation of 'Hey Good Lookin' (Charlie Rich) to the rallying call of ' I Hate Hate\n\n' (Razzy) to the euphoric soul of 'The Feeling Is Right' ( Bobby Hatfield), it's \n\nall a real treat. The perfect late summer record and the antidote to all the weak\n\nr'n'b littering charts. These good ol' swamp white boys have a thing or two to \n\nteach us all.","torrent":{"xt":"urn:btih:ca624c8d2b9ec4bbe93a88e22b2af12c4c8342c4","amp;dn":"Country+Got+Soul+Vol.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca624c8d2b9ec4bbe93a88e22b2af12c4c8342c4","infoHashBuffer":{"type":"Buffer","data":[202,98,76,141,43,158,196,187,233,58,136,226,43,42,241,44,76,131,66,196]},"announce":[],"urlList":[]}}