{"title":"kennedy kirkpatrick madeira sprague","uid":6369693,"size":73576276,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cc7be4f50de43bb317b60d1d5caeeead751246d9&amp;dn=kennedy+kirkpatrick+madeira+sprague&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Burstcouch","files":11,"time":1304635464,"description":"Description just copy/paste from Amazon..\n\nComing From Somewhere Else, the first of hopefully many in the &quot;Rocketown Writers Series,&quot; gives four songwriters an opportunity writers rarely receive. Gordon Kennedy, Wayne Kirkpatrick, Phil Madeira and Billy Sprague have taken their behind-the-scenes, one-of-a-kind gifts, put them back in their original boxes and on the shelf for your listening pleasure. In other words, these four have re-recorded their own songs-made classics by other artists-in their own way. Oh yeah, and they produced the project themselves as well.\n\nIncluded are three Dove Award-winning Songs of the Year: Sprague's gripping &quot;Via Dolorosa,&quot; a signature classic for Sandi Patty; Kirkpatrick's &quot;Place in This World,&quot; a career song for Michael W. Smith; and &quot;Man After Your Own Heart,&quot; a crystal collaboration between Kirkpatrick and Sprague, the Gary Chapman-recorded standout from My Utmost for His Highest. The title track, it should be noted, is the one previously unreleased song on the album, an anthemic throwback to late-'70s, early-'80s harmony-stacked rock. It's a sure-fire sway fest.Largely a relaxing, acoustic-based set, Coming From Somewhere Else showcases these songs in a greenhouse of sorts, allowing the lyric to break ground in organic honesty, unaffected by another\\'s vocal or musical interpretation. The result is a collection of songs already proven to be great-&quot;Change the World&quot; (Eric Clapton),&quot;Grand Canyon&quot; (Susan Ashton) and &quot;Everywhere I Look&quot; (Phil Keaggy) to name a few more-that, mined in simplicity, come from a somehow truer place.'Tis a gift to be simple. -- Melissa Riddle (c) 2000 CCM Communications, Inc. \n\n(This actually turned out to be the one and only release in the &quot;Rocketown Writers Series&quot; sadly)\n\nCD Length: 40:38\n\n\n1. Coming from Somewhere Else\n2. That Kind of Love\n3. Grand Canyon\n4. Hunger and Thirst\n5. Man After Your Own Heart\n6. Place in This World\n7. You Move Me\n8. Everywhere I Look\n9. Via Dolorosa\n10. Change the World","torrent":{"xt":"urn:btih:cc7be4f50de43bb317b60d1d5caeeead751246d9","amp;dn":"kennedy+kirkpatrick+madeira+sprague","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc7be4f50de43bb317b60d1d5caeeead751246d9","infoHashBuffer":{"type":"Buffer","data":[204,123,228,245,13,228,59,179,23,182,13,29,92,174,238,173,117,18,70,217]},"announce":[],"urlList":[]}}