{"title":"Trailer Park Boys - S02E01.HDTV.XviD-The.Buzzsaw","uid":6486170,"size":181361950,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd9a7434e260400aaf88229aeb580c39ce02148c&amp;dn=Trailer+Park+Boys+-+S02E01.HDTV.XviD-The.Buzzsaw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The.Buzzsaw","files":-1,"time":1308726339,"description":"                             Buzzsaw Tv Proudly Presents\n\n                                &quot;Trailer Park Boys&quot;\n\n                           Season Two Episode One (S02E01)\n                    &quot;What In The Fuck Happened To Our Trailer Park&quot;\n\n\n&quot;Trailer Park Boys&quot; - Completely original, brilliantly written, beautifully acted, perpetually shocking and always quotable, Trailer Park Boys is simply one of the top 5 comedy television series of all time.\n\nTrailer Park Boys is about life between prison terms. Always trying to play the angles, always done-in by forces beyond their control, and always in the middle of a gunfight, Ricky and Julian are decent, hard- working guys trying to cope with the New World Economic Order. It's not that the boys don't know right from wrong, it's just that &quot;right&quot; rarely presents itself.\n\nTrailer Park Boys is a top notch comedy series about love, friends and family-or perhaps it's about everything that can go wrong with love, friends and family. At the center of Trailer Park Boys are Ricky and Julian, two guys whose lives were shaped by their experiences growing up in the Trailer Park. Their childhood was typical of most trailer park kids - stealing, fighting, smoking, drinking, scamming and listening to Van Halen. The Boys have had their share of trouble with the law. Most of their adult lives have been spent behind bars of one kind or another. In fact, as this inaugural season begins, both Ricky and Julian are just getting out of jail. They blame each other for this most recent incarceration and, now, as Julian prepares to start all over again, he refuses to talk to Ricky. Julian wants and tries throughout the series to go straight - but old habits die hard. And that's just fine with Ricky.","torrent":{"xt":"urn:btih:cd9a7434e260400aaf88229aeb580c39ce02148c","amp;dn":"Trailer+Park+Boys+-+S02E01.HDTV.XviD-The.Buzzsaw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd9a7434e260400aaf88229aeb580c39ce02148c","infoHashBuffer":{"type":"Buffer","data":[205,154,116,52,226,96,64,10,175,136,34,154,235,88,12,57,206,2,20,140]},"announce":[],"urlList":[]}}