{"title":"Kid Rock - Feel Like Makin' Love (2nafish)","uid":5756724,"size":171843588,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cdb31d1783c240e11753fea1d1c80964dab8ea4f&amp;dn=Kid+Rock+-+Feel+Like+Makin%5C%27+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1281591747,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Feel Like Makin' Love&quot; is a song by English supergroup Bad Company. It is the second and most popular song off their 1975 album Straight Shooter. As a single, this song reached #10 on the Billboard Hot 100. The song was named the 78th best hard rock song of all time by VH1.\n\nIt was covered by Kid Rock on his self-titled 2003 release. His version peaked at #3 on the Mainstream Rock Tracks charts.\n\nKid Rock is an eponymous album by Kid Rock and his fourth Atlantic Records album. It was released in 2003. It was critically acclaimed by Rolling Stone Magazine, they named it one of the 50 Greatest Albums of 2003. The album saw two covers: the Bob Seger number &quot;Hard Night For Sarah,&quot; which had been never released since Bob Seger wrote in in 1979, and Bad Company's &quot;Feel Like Makin' Love&quot;. &quot;Single Father&quot; landed him on the country chart for a second straight album. It charted as Rock's 3rd best country single and was written by country musician David Allan Coe. The album was his poorest selling release since he broke into the mainstream in 1998.\n\nThe album's lead single was a cover of Bad Company's  &quot;Feel Like Makin' Love&quot;. It was released October 2, 2003 to radio and peaked at #33 on the Mainstream Rock charts. In January 2004 he released the dark southern metal song &quot;Jackson, Mississippi&quot; to rock stations and the country love ballad &quot;Cold and Empty&quot; to AC and Pop stations. Jackson peaked at #14 on the Mainstream Rock charts while Cold and Empty peaked at #20 on the AC charts. The song failed to chart on either the Top 40 or Hot 100. In July 2004 he followed the same route releasing dual singles again, releasing the acoustic ballad &quot;I Am&quot; to rock radio and the country ballad &quot;Single Father&quot; to country radio. I Am peaked at #28 on the Mainstream Rock charts. Single Father would become Kid Rock's second charting country song, after Picture. It would peak at #50.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:cdb31d1783c240e11753fea1d1c80964dab8ea4f","amp;dn":"Kid+Rock+-+Feel+Like+Makin%5C%27+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdb31d1783c240e11753fea1d1c80964dab8ea4f","infoHashBuffer":{"type":"Buffer","data":[205,179,29,23,131,194,64,225,23,83,254,161,209,200,9,100,218,184,234,79]},"announce":[],"urlList":[]}}