{"title":"Democracy Now - 13 may 2011","uid":6389390,"size":451538834,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cddc551d887c5d0835e9ae6e5f4ef487c4bb9672&amp;dn=Democracy+Now+-+13+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1305304684,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 13, 2011\n\n- 80 Die in Pakistan, &quot;Retaliation&quot; For Bin Laden Killing\n- Japan Admits Partial Meltdown at Nuclear Plant\n- Oil Company CEOs Defend Profits and Government Subsidies\n- ICC Prepares to Issue Arrest Warrants For Libyan Officials\n- Obama May Skirt War Powers Law to Continue Libya Bombing\n- Amnesty Praises Uprisings in Middle East, Warns of Violent Response\n- U.N.: 850 Dead So Far in Syrian Crackdown on Protesters\n- Saudi Troops to Remain in Bahrain After Emergency Rule Ends\n- John McCain: Torture Did Not Lead to Bin Laden\n- U.K. Official: Iraq War Dossier Was Designed to &quot;Make A Case For War&quot;\n- Ron Paul Announces Third Presidential Run\n- Thousands Protest Budget Cuts on Wall Street\n- 12 Nuclear Resisters Convicted For Trespassing at Nuclear Bomb Plant\n\n\nSpecial reports\n\n- &quot;Friday of Decisiveness in Yemen&quot;: Tens of Thousands Protest as President Saleh Defiantly Rejects Demands to Resign\n\nTens of thousands of Yemenis have taken to the streets today for what organizers have called the &quot;Friday of Decisiveness,&quot; days after Yemeni forces opened fire on demonstrators. The death toll from weeks of protests has surpassed 160. The violence comes as Qatar has pulled out of international talks on a deal that would see Saleh voluntarily resign. We are joined on the phone by Iona Craig, a Times of London correspondent, based in the Yemeni capital, Sana'a.\n\n\n- Al Jazeera Journalist Dorothy Parvaz Remains Missing After Being Detained in Syria, Then Deported to Iran\n\nAl Jazeera English reporter Dorothy Parvaz, an American-Canadian-Iranian citizen, was detained in Syria on April 29 when she arrived to cover the ongoing unrest. She has not been seen since. On Wednesday, Al Jazeera reported she had been deported to Iran, although there has been no direct contact with her. The Committee to Protect Journalists is calling for her immediate release from Iranian authorities. We are joined by Kim Barker, the sister of Parvaz's fiancÃƒÂ©, Todd Barker, who introduced the couple. She has known Parvaz for 12 years-they met as colleagues at the Seattle Times. Kim Barker is now a ProPublica reporter who has reported from Pakistan and Afghanistan. &quot;Dorothy is an amazing journalist, and an amazing human being,&quot; Kim Barker says.\n\n\n- &quot;Making Art In America Is A Political Statement In Itself&quot;: Grammy Award-winning Singer Steve Earle On Music, Writing and Acting\n\nSinger-songwriter, actor and author Steve Earle joins us in the studio to talk about his art and perform two songs from his new album, &quot;I'll Never Get Out of This World Alive.&quot; He is being awarded an honorary degree today from the City University of New York School of Law. Last year, he was honored by the National Coalition to Abolish the Death Penalty for his years of involvement with the anti-death penalty movement. &quot;Making art in America is a political statement in itself,&quot; Earle says. &quot;I am maybe not so much a political songwriter as I am a political person.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cddc551d887c5d0835e9ae6e5f4ef487c4bb9672","amp;dn":"Democracy+Now+-+13+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cddc551d887c5d0835e9ae6e5f4ef487c4bb9672","infoHashBuffer":{"type":"Buffer","data":[205,220,85,29,136,124,93,8,53,233,174,110,95,78,244,135,196,187,150,114]},"announce":[],"urlList":[]}}