{"title":"Herbie Mann -  AmericaBrazil","uid":6371754,"size":115725630,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ce079cbe4f3c6fc22bf6e4362f91dd1265ddf49d&amp;dn=Herbie+Mann+-++AmericaBrazil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"nuovonadrachal","files":7,"time":1304699660,"description":"Format: Musepack\n\nAmerica/Brasil is a rollicking, celebratory album that keeps Herbie Mann on the winning streak he started with the release of Peace Pieces in 1995. Recorded during a week of concerts to mark his 65th birthday in April 1995, this disc is much stronger than its immediate predecessor, Celebration, also taken from the same week of live concert performances at New York's Blue Note jazz club. The material here is superb, and the playing top-notch. As the title implies, the emphasis here is on Mann's Brazilian side, but there are touches of the non-Brazilian with Bill Evans' &quot;Peri's Scope&quot; and Miles Davis' &quot;All Blues.&quot; &quot;Summertime&quot; is recast in an Afro-Cuban mode with Paquito D'Rivera sharing the solo space on alto sax. However, lengthy Brazilian showstoppers are placed at the beginning, middle, and end of this wonderful disc. The opening &quot;Keep the Spirits Singing&quot; is propelled by the polyrhythmic pulse of percussionists Cyro Baptista and &quot;CafÃƒÂ©,&quot; and the 17-minute title track finale features trumpeters Randy Brecker and Claudio Roditi, trombonist Jim Pugh, and guitarist Romero Lubambo. Even with the all-star cast assembled for this special week of concerts, it's Herbie Mann himself whose playing shines the brightest throughout this recording, celebrating his past and affirming his place in the present as the finest flutist working in jazz.\n\nReview by Jim Newsom","torrent":{"xt":"urn:btih:ce079cbe4f3c6fc22bf6e4362f91dd1265ddf49d","amp;dn":"Herbie+Mann+-++AmericaBrazil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce079cbe4f3c6fc22bf6e4362f91dd1265ddf49d","infoHashBuffer":{"type":"Buffer","data":[206,7,156,190,79,60,111,194,43,246,228,54,47,145,221,18,101,221,244,157]},"announce":[],"urlList":[]}}