{"title":"Asterix at the Olimpic Games [pcgame-multi5] [Tntvillage]","uid":5781019,"size":3960057856,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ce7b5bc70f13c157640c4eaf7a8fd4eed407f5fe&amp;dn=Asterix+at+the+Olimpic+Games+%5Bpcgame-multi5%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1282403286,"description":"Asterix at the Olimpic Games [pcgame-multi5] [Tntvillage]\n\n[img]http://img294.imageshack.us/img294/3029/coth.jpg[/img]\n\nSimulazione Sportiva - 1 DVD - Multi5 (Eng-Fre-Ita-Ger-Spa)\nData di uscita: 16 novembre 2007\n\nVisit this link: \n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220668&amp;view=findpost&amp;p=12278648&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220668&amp;view=findpost&amp;p=12278648&lt;/a&gt;\n\n.::.Recensione.::.\n\nPANORAMICA\nSono ritornati per farci divertire ancora una volta con le loro battute sarcastiche e soprattutto per &quot;suonare&quot; a suon di pugni gli acerrimi nemici romani, dal loro buffo accento che vi farÃƒÂ  sbellicare dalle risate. Chi sono? Ma Asterix e Obelix, ovviamente!\nLa trama si rifÃƒÂ  al prossimo movie previsto nelle sale cinematografiche per l'inizio del prossimo anno. Un amico di Asterix e Obelix, un certo Alafolix, si ÃƒÂ¨ invaghito perdutamente di Irina, una principessa promessa in sposa al figlio di Giulio Cesare, Bruto. Ma non tutto ÃƒÂ¨ perduto! La principessa, infatti, sarÃƒÂ  data in sposa al vincitore dei giochi olimpici, quindi, Alafolix non puÃƒÂ² far altro che vincerli anche con l'aiuto dei suoi super-amici. Nel frattempo, strani accadimenti stanno succedendo nel regno causati da Bruto con l'aiuto di Alambiccus, un potente stregone che lavora al servizio per i romani e i primi effetti si sono potuti appurare giÃƒÂ  su Panoramix. OccorrerÃƒÂ , quindi, aiutare l'amico innamorato e al contempo fermare questa imminente catastrofe che si sta scagliando sul mondo.\nIl terreno di battaglia sarÃƒÂ , stavolta, fornito dalle varie arene predisposte per i giochi olimpici dove i nostri amici si cimenteranno per raggiungere la vetta. Il titolo, perÃƒÂ², non ÃƒÂ¨ solo un gioco dalle varie gare da disputare ma anche un'avventura in cui potrete girovagare nei dintorni delle arene alla ricerca di informazioni utili. Ovviamente potrete sia utilizzare Obelix che Asterix e per non cadere nell'uso di un solo personaggio, all'interno del gioco sono stati predisposti particolari punti in cui solo uno di loro puÃƒÂ² essere sfruttato per oltrepassare quel punto o superare quell'enigma. I personaggi, infatti, hanno caratteristiche e abilitÃƒÂ  proprie: Obelix ÃƒÂ¨ una figura possente e potrÃƒÂ  sfruttare a proprio vantaggio la sua immensa forza ma al contempo non potrÃƒÂ  arrampicarsi nei vari appigli, compito, quindi, che verrÃƒÂ  lasciato all'agile e snello Asterix.\n\n[img]http://img686.imageshack.us/img686/1909/32118268.jpg[/img]  [img]http://img594.imageshack.us/img594/5315/95177965.jpg[/img]\n\nA questa &quot;avventura&quot; si aggiungerÃƒÂ  la possibilitÃƒÂ  di poter affrontare le varie prove dei giochi olimpici. Le sfide saranno diverse e includeranno il salto in lungo, il tiro alla fune, la corsa vera e propria, la palla rana, corsa alle bighe e tante altre ancora. Potrete scegliere anche il personaggio con cui partecipare a queste sfide tra lo stesso Asterix, Obelix e anche l'amico Alafolix.\nUna volta sbloccate le varie prove olimpiche, quest'ultime potranno anche essere giocate in una speciale modalitÃƒÂ  denominata modalitÃƒÂ  Olimpica in cui potrete scatenarvi soprattutto giocando con qualche amico. Il titolo, infatti, propone anche un multiplayer in cui potrete sia giocare l'avventura vera e propria con un amico sia divertirvi nel partecipare alle varie sfide olimpiche.\n\n[img]http://img641.imageshack.us/img641/7162/83145435.jpg[/img]  [img]http://img192.imageshack.us/img192/369/35746692.jpg[/img]\n\nCOMPARTO TECNICO\nIl titolo propone una grafica in pieno stile cartoonesco, analoga, quindi, alla versione animata di Asterix e Obelix. Una grafica non spettacolare ma che al contempo esprime un certo fascino che attira chi lo gioca. Gli ambienti sono realizzati con una palette grafica dai colori molto vivaci e l'interazione che si ha ÃƒÂ¨ piuttosto buona. Potrete, infatti, distruggere vari oggetti sparsi lungo il cammino e raccimolare al contempo monete preziose per ottenere i vari sbloccabili presenti (la cosa molto carina ÃƒÂ¨ che una volta distrutti essi rimarranno tali). I personaggi sono ricreati degnamente, non solo i protagonisti ma anche gli amici Galli e i sempre &quot;nemici&quot; Romani.\nLa longevitÃƒÂ  non ÃƒÂ¨ proprio il massimo. Del resto il titolo ÃƒÂ¨ indicato soprattutto ad un pubblico giovanile che, attirato dalla pellicola cinematografica, vogliono rivivere in prima persona l'avventura dei propri beniamini. Per cercare di sollevarla un po' sono presenti diversi obiettivi secondari da portare a termine per ottenere gli extra del gioco (come per esempio liberare tutti i piccioni).\nIl sonoro contiene effetti buoni che riproducono degnamente i vari suoni nel gioco. Ottimo il parlato, in italiano, soprattutto quello legato alle voci dei romani che vi faranno sbellicare dalle risate in piÃƒÂ¹ di un'occasione.\n\n[img]http://img534.imageshack.us/img534/315/87089082.jpg[/img]  [img]http://img690.imageshack.us/img690/7073/33365068.jpg[/img]\n\nCONCLUSIONI\nUn titolo che combina in sÃƒÂ¨ sport ed avventura. Indicato soprattutto per un pubblico giovane e per coloro che, vista la pellicola cinematografica, vorranno cimentarsi in prima persona nell'avventura. Nel complesso il titolo ÃƒÂ¨ sicuramente piÃƒÂ¹ che discreto.\n\nVisit thelink:\n\nInstallazione:\n1. montare o masterizzare il file immagine.\n2. installare il gioco e scegliere la lingua.\n3. Aprire la cartella CURA del driver virtuale, copiare il file AsterixJO.exe e incollarlo nella directory di installazione del gioco.\n... e buon divertimento\n\nIl gioco ÃƒÂ¨ stato testato su windows XP SP3\n\nRequisiti minimi di sistema:\nSistema operativo Windows XP/Vista\nProcessore 2 GHz (2.2 GHZ per Vista)\n512 MB di RAM (1 GB di RAM per Vista)\nScheda video 3D 128 MB\nScheda audio compatibile DirectX\n9 GB di spazio su HD\n\nControllato con Avira Aggiornato al 16/08/2010\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:ce7b5bc70f13c157640c4eaf7a8fd4eed407f5fe","amp;dn":"Asterix+at+the+Olimpic+Games+%5Bpcgame-multi5%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce7b5bc70f13c157640c4eaf7a8fd4eed407f5fe","infoHashBuffer":{"type":"Buffer","data":[206,123,91,199,15,19,193,87,100,12,78,175,122,143,212,238,212,7,245,254]},"announce":[],"urlList":[]}}