{"title":"Nicholas and Alexandra [Romanov] - Robert K. Massie [Pulizer Pri","uid":5779097,"size":523574625,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cef5c9533771dd66c7c05702aa6e767daee51976&amp;dn=Nicholas+and+Alexandra+%5BRomanov%5D+-+Robert+K.+Massie+%5BPulizer+Pri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nickoman23","files":36,"time":1282348743,"description":"This is generally considered to be the definitive biography of Tsar Nicholas II and his wife, Alexandra. Massie's expert storytelling is well-suited to the compelling story of the last Russian tsar and his consort. The history of Russia was no doubt changed by the deliberate myopia and general inadquacies of these two people. Nevertheless, Massie manages to uncover a more sympathetic side to the ill-fated duo. Massie's writing is as good as that of any acclaimed novelist - there's a fascinating and fastpaced plot, finely nuanced lead characters, an intriguing supporting cast, all against a beautiful background of a majestic bygone era.\nThis book was researched and written before the fall of the Soviet empire when the state archives were opened and new information about the Romanovs was revealed. Consequently, this book is necessarily incomplete, especially as concerns the execution of the royal family. Massie has since written another text called &quot;The Romanovs: The Last Chapter&quot; which devels deeply into the newly available data and the forensic studies that followed. Consider it an essential volume II to &quot;Nicholas and Alexandra&quot;.","torrent":{"xt":"urn:btih:cef5c9533771dd66c7c05702aa6e767daee51976","amp;dn":"Nicholas+and+Alexandra+%5BRomanov%5D+-+Robert+K.+Massie+%5BPulizer+Pri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef5c9533771dd66c7c05702aa6e767daee51976","infoHashBuffer":{"type":"Buffer","data":[206,245,201,83,55,113,221,102,199,192,87,2,170,110,118,125,174,229,25,118]},"announce":[],"urlList":[]}}