{"title":"STARGATE.SG-1.S07E09-12.SWESUB. -Lindoff.ISO","uid":5810985,"size":2881333248,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf620f306d7946d25f742dd8351794795295a972&amp;dn=STARGATE.SG-1.S07E09-12.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1283631065,"description":"Season 7, Episode 9: Avenger 2.0\n\nJay Felger, infamous for his failed projects, and Carter begin work on a computer \n\nvirus designed to disable a DHD by scrambling its symbols and corresponding \n\ncoordinates. But when Daniel, O'Neill and the other SG teams become stranded on \n\nother planets unable to dial home, Felger's Avenger virus seems to be doing \n\nsomething it wasn't designed to do: it's spreading. As the entire gate network \n\nshuts down, Felger and Carter look for a solution to repair the damage that was \n\ndone.\n\t\n\nSeason 7, Episode 10: Birthright\n\nAfter being saved by a group of free female Jaffa, SG-1 is taken to the females' \n\nhomeworld to meet their leader, Ishta. Ishtar proposes an alliance between her \n\nall-female rebel group, Haktil, and the Tau'ri. The Tau'ri offer her Tritonin to \n\nsupplant their practice of taking the symbiotes from defeated Jaffa in the service \n\nof the Goa'uld. However, since Tritonin has only had two test subjects, Teal'c and \n\nBra'tac, they are cautious to spread it among their ranks.\n\t\n\n\nSeason 7, Episode 11: Evolution: Part 1\n\nBra'tac and Teal'c encounter a heavily armed enemy with shielding protecting him \n\nfrom Goa'uld weaponry who took out two Goa'uld's personal guards. They barely \n\nmanage to defeat him and bring him back to SGC for study, but this new threat \n\nposes a greater problem for the Tau'ri.\n\t\n\n\nSeason 7, Episode 12: Evolution: Part 2\n\nThe Tau'ri and Tok'ra have used their captured super-soldier to determine his \n\nplanet of origin. Though with Daniel, Dr. Lee, and the Ancient device they found \n\nin the hands of Honduran kidnappers, SGC must find a way to retrieve them if they \n\nare to have any chance of defeating the newly encountered super-soldiers.\n\n","torrent":{"xt":"urn:btih:cf620f306d7946d25f742dd8351794795295a972","amp;dn":"STARGATE.SG-1.S07E09-12.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf620f306d7946d25f742dd8351794795295a972","infoHashBuffer":{"type":"Buffer","data":[207,98,15,48,109,121,70,210,95,116,45,216,53,23,148,121,82,149,169,114]},"announce":[],"urlList":[]}}