{"title":"Katy_Perry-London_Live-DVBS-2010-JUST","uid":6332858,"size":77275939,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0e2dd1b6754e188f3fa6a4cd20eb3624b25f739&amp;dn=Katy_Perry-London_Live-DVBS-2010-JUST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MAFIAA.","files":4,"time":1303352227,"description":"Artist.......: Katy Perry\nAlbum........: London Live\nLabel........: n/a\nGenre........: Pop\nCatnr........: n/a\nSource.......: DVBS\nRip.date.....: 2011-04-18\nStr.date.....: 2010-00-00\nQuality......: 235kbps/48.0kHz/Joint Stereo\nUrl..........: http://www.katyperry.com\n\ntrack  title                                          time\n\n1.    London Live                                  43:47\n\nRuntime  43:47\nSize    73.69\n\nRelease Notes\n\nA former Christian artist, Katy Perry rebranded herself as a larger-than-life\npop star and rose to prominence during the summer of 2008. Before she topped the\ncharts with songs like &quot;I Kissed a Girl&quot; and &quot;California Gurls,&quot; though, she\nspent the better part of a decade recording music under a different name\nKatheryn Elizabeth Hudson (or Katy Hudson, as she billed herself on her 2001\ngospel album) was born on October 25, 1984, in Santa Barbara, CA. Raised in a\nreligious household as the daughter of two pastors, she was forbidden to listen\nto secular bands as a child, although a childhood slumber party introduced her\nto the music of Alanis Morissette and Freddie Mercury. Religious music remained\nat the forefront, however, and Katy released a self-titled Christian album in\n2001 under her original name. She would later abandon the genre (and her given\nsurname) in favor of a pop career\n\nAt age 17, she began working with hitmaker Glen Ballard, who had produced and\nco-written Alanis Morissette's chart-topping Jagged Little Pill in 1995. Several\nyears later, she teamed up with the Matrix, a Grammy-nominated\nproduction/songwriting team whose rsum included collaborations with Avril\nLavigne, Shakira, and Korn. Tired of producing music for other artists, the\nMatrix had plans to record an album of their own, with Perry serving as one of\nthe group's two singers. The project was ultimately shelved, but not before\nPerry appeared in a 2004 write-up by Blender magazine, who hailed her as &quot;the\nNext Big Thing\n\nWith the Matrix's unreleased album sitting in the vaults at Sony Records, Perry\nwent back to the drawing board and began working on a solo album for Columbia\nThe project was eventually canceled, although two of its songs were later given\nto Kelly Clarkson, who scored a Top 40 hit with &quot;I Do Not Hook Up&quot; several years\nlater. Perry (who, by this point, had shed her original surname due to its\nsimilarity to actress Kate Hudson) then signed with Capitol, who encouraged\ntheir new client to write her own music and helped establish her image as a\nboisterous, tongue-in-cheek pop star. Perry's debut single, &quot;UR So Gay,\ngenerated a small buzz with its mischievous lyrics and clever music video, but\nit was &quot;I Kissed a Girl&quot; that proved to be her breakthrough hit, topping the\ncharts in 20 countries and pushing its accompanying album, 2008's One of the\nBoys, into the Top Ten in America. Perry supported her debut by joining the\nWarped Tour that summer, where she toured alongside her boyfriend at the time,\nTravis McCoy of Gym Class Heroes. Meanwhile, &quot;Hot N Cold&quot; became her second\nmulti-platinum hit, &quot;Thinking of You&quot; (one of the album's three songs written\nsolely by Perry) cracked the Top 40, and &quot;Waking Up in Vegas&quot; cracked the Top\nTen\n\nSuch success meant that Katy Perry had officially become one of the industry's\nbiggest pop stars, celebrated as much for her outsized behavior and outrageous\nfashion choices as the music itself. She continued touring through the summer of\n2009 (albeit without McCoy, whose boyfriend status had been revoked earlier that\nyear) and found time to tape an installment of MTV Unplugged, which was released\nin November. Meanwhile, she worked on a new album and started up a whirlwind\nromance with comedian Russell Brand, eventually becoming his fianc. Recording\nsessions for her album wrapped up in early 2010, and Perry scored her second\nnumber one single with California Gurls, which was released that May. The\naccompanying album, Teenage Dream, followed in August","torrent":{"xt":"urn:btih:d0e2dd1b6754e188f3fa6a4cd20eb3624b25f739","amp;dn":"Katy_Perry-London_Live-DVBS-2010-JUST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e2dd1b6754e188f3fa6a4cd20eb3624b25f739","infoHashBuffer":{"type":"Buffer","data":[208,226,221,27,103,84,225,136,243,250,106,76,210,14,179,98,75,37,247,57]},"announce":[],"urlList":[]}}