{"title":"Teach Yourself Russian Conversation.rar","uid":6334554,"size":161388751,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d10be1b21ecf7e0a5ecbc1145abe2b3d15b34287&amp;dn=Teach+Yourself+Russian+Conversation.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"123dutch","files":1,"time":1303415086,"description":"Product Description\nThis stand-alone, all-audio course can be used by those who have little or no knowledge of the language, by those who want to learn or brush up basic conversation skills, and by more advanced learners who require extra audio material to complement their current courses. \n\nThe ten units or 'conversations' cover the situations you are most likely to find yourself in while on holiday or on business abroad. They are divided into two parts, with a dialogue in each part. The dialogue in Part 2 reuses the vocabulary and phrases from Part 1 in a slightly different context. Both parts start with an introduction to the words and phrases you'll need, followed by the dialogue. Finally it's 'Over to you': you take part in the same dialogues following the English prompts, playing all the roles in turn. So you get lots of opportunity to practise! Frequent track markers divide the CDs up into short, easy-to-use clips.\n\nVocabulary and phrases in the first two CDs are kept to the basics and are introduced gradually with lots of opportunity to repeat and practise, to improve your confidence in both speaking and understanding. The third CD concentrates on helping you improve your understanding, so that you will be able to hold two-way conversations with people who speak very fast or use words and phrases you do not know. \n\nThe course comes on three 75-minute CDs and has an accompanying 48-page booklet which gives the dialogues and the translations of the dialogues, for those who like to see the written word or want additional practice. The Russian is transliterated into romanized script. The booklet also provides a basic glossary of the words and phrases used.\n\nBooklet included.","torrent":{"xt":"urn:btih:d10be1b21ecf7e0a5ecbc1145abe2b3d15b34287","amp;dn":"Teach+Yourself+Russian+Conversation.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d10be1b21ecf7e0a5ecbc1145abe2b3d15b34287","infoHashBuffer":{"type":"Buffer","data":[209,11,225,178,30,207,126,10,94,203,193,20,90,190,43,61,21,179,66,135]},"announce":[],"urlList":[]}}