{"title":"Norton 360 All-In-One Security FULL 11 YEAR KEYGEN","uid":6318129,"size":149843951,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d12ee09c0dffb87afc62a2920e1346329da0f014&amp;dn=Norton+360+All-In-One+Security+FULL+11+YEAR+KEYGEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spbrettlee1","files":1,"time":1302778657,"description":"Norton 360 All-In-One Security FULL 11 YEAR KEYGEN\n\nINSTALLATION INSTRUCTIONS\n\n1. Unrar, Burn or mount with Daemon Tools.(optional)\n\n2. DISCONNECT FROM THE INTERNET! THIS IS IMPORTANT!\n\n3. Run the installer, and run the key-gen located in the EDGE dir.\n\n4. Copy the Product Key from the key-gen to the Norton Setup then press\nthe I Agree button..\n\n5. Complete installation and finally you will get to the activation,\nit's important that you are NOT connected to the Internet!\nPress the Next button.\n\n6. A message box will come up telling you that you need Internet\nconnectivity to continue, just press the OK Button, and then press\nthe Next button.\n\n7. You will get to a part where it's trying to connect to the Internet\nfor online activation, after a while it will fail, this is fine,\nrepeat this step again.\n\n8. After attempting to do online activation two times, it will fail\nand open a browser window, close the browser window and press that\nbig fat button in the key-gen that says &quot;Click Here to Enable Phone\nActivation!&quot;.\n\n9. And if as by magic the phone activation has suddenly been enabled,\nPress the Next button.\n\n10. Now copy the 36 digit Request Code into the Request Code field in\nthe key-gen, no dashes or spaces just one long 36 digit string.\nSelect how many years you want to license the software for, and\npress the Generate button to get your Unlock Code.\n\n11. Copy the generated Unlock Code to the Norton activation screen,\nthen press the Next button.\n\n12. Enjoy a fully unlocked copy, and naturally DO NOT register this\nsoftware with Norton in Symantec company, you can now reconnect to the Internet to update the product\n\nFETURES :\n\nNorton 360 provides all-in-one protection that keeps you, your family, your PC, and your information secure. This comprehensive solution combines Symantec's proven, industry-leading security and PC tune-up technologies with new automated backup and antiphishing features, providing a full circle of protection.\n\n\nNorton 360 is a comprehensive consumer security solution that offers a full circle of protection and eliminates the need to purchase and manage multiple products.\n\n* Defends your PC against a broad range of threats\n* Safeguards against online identity theft\n* Protects important files from loss\n* Keeps your PC tuned up for peak performance\n* Provides a hassle-free user experience\n* Protects against the latest online threats\n\n\nTop Features\n\n* Removes viruses from email and instant messages\n* Blocks Internet worms at point of entry\n* Stops spyware from tracking you online\n* Authenticates popular shopping and banking Web sites\n* Protects you from phishing sites designed to steal your confidential information\n* Discovers new files and backs up that data automatically\n* Automatically back up important files to a secure online service\n* Local backup to CD, DVD or external drive\n* Automatically removes unwanted Internet clutter and temporary files that can slow down your PC's performance","torrent":{"xt":"urn:btih:d12ee09c0dffb87afc62a2920e1346329da0f014","amp;dn":"Norton+360+All-In-One+Security+FULL+11+YEAR+KEYGEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d12ee09c0dffb87afc62a2920e1346329da0f014","infoHashBuffer":{"type":"Buffer","data":[209,46,224,156,13,255,184,122,252,98,162,146,14,19,70,50,157,160,240,20]},"announce":[],"urlList":[]}}