{"title":"Stronger - Kanye West (HD 720p) [mildpoison]","uid":5782075,"size":157344180,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d163d00da3a05d46eac20008f4d18187023b8125&amp;dn=Stronger+-+Kanye+West+%28HD+720p%29+%5Bmildpoison%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mildpoison","files":2,"time":1282457572,"description":"Description\n\n\nKanye Omari West is an American rapper, singer, and record producer. West first rose to fame as a producer for Roc-A-Fella Records, where he eventually achieved recognition for his work on Jay-Z's album The Blueprint, as well as hit singles for musical artists including Alicia Keys, Ludacris, and Janet Jackson. His style of production originally used pitched-up vocal samples from soul songs incorporated with his own drums and instruments. However, subsequent productions saw him broadening his musical palette and expressing influences encompassing '70s R&amp;B, baroque pop, trip hop, arena rock, folk, alternative, electronica, synth-pop, and classical music.\n\nWest released his debut album The College Dropout in 2004, his second album Late Registration in 2005, his third album Graduation in 2007, and his fourth album 808s &amp; Heartbreak in 2008. His four albums have received numerous awards, including a cumulative twelve Grammys, and critical acclaim. All have been very commercially successful, with 808s &amp; Heartbreak becoming his third consecutive #1 album in the U.S. upon release. West also runs his own record label GOOD Music, home to artists such John Legend, Common and Kid Cudi. West's mascot and trademark is &quot;Dropout Bear,&quot; a teddy bear which has appeared on the covers of four of his five albums as well as various single covers and music videos. About.com ranked Kanye West #8 on their &quot;Top 50 Hip-Hop Producers&quot; list. On May 16, 2008, Kanye West was crowned by MTV as the year's #1 &quot;Hottest MC in the Game.&quot;\n\n\n\nPlot\n\n\nThe music video for &quot;Stronger&quot; was directed by Hype Williams and shot over nine days in Japan. It include shots filmed in Aoyama-based clothing store A Bathing Ape as well as Harajuku clothing store Billionaire Boys Club/Ice Cream. The video took over three months to complete. West first premiered a rough cut at the Tribeca Studios in New York City on June 19, 2007. It made its public premiere on June 26, 2007, on MTV Germany's TRL. The video was also shown on the BET countdown show 106 &amp; Park on June 28, 2007.\nThe video features appearances by singer and model Cassie Ventura, a real-life Japanese motorcycle gang, and the two principal actors from the film Daft Punk's Electroma dressed as Daft Punk. The video also features multiple scenes which pay homage to the 1988 anime film Akira. These include the light effects on the motorbikes, the hospital scenes and West being scanned by machines. Both West and Williams had originally planned to integrate scenes from the film into the video. West also wears a pair of Alain Mikli sunglasses, which he requested from the designer specifically for the video. The sunglasses have since become a signature of West, who for a period of time often donned them during performances. The video was nominated two 2007 MTV Video Music Awards for Video of the Year and Best Editing in a Video. It won Best Hip-Hop Video at the BET Hip-Hop Awards as well as Best Video at the MOBO Awards.\n\n\n\nLyrics\n\n\nWork it, make it, do it,\nMakes us harder, better, faster, stronger!\n\n[played in background, continuously:]\nWork it harder, make it better,\ndo it faster, makes us stronger,\nmore than ever, never over,\nOur work here is never over.\n\n[Chorus:]\nN- n- now th- that don't kill me\nCan only make me stronger\nI need you to hurry up now\n'cause I can't wait much longer\nI know I got to be right now\n'cause I can't get much wronger\nMan I've been waitin' all night now\nThat's how long I've been on you\n\nI need you right now\nI need you right now\n\nLet's get lost tonight\nYou could be my black Kate Moss tonight\nPlay secretary, I'm the boss tonight\nAnd you don't give a fuck what they all say right?\nAwesome, the Christian and Christian Dior\nDamn, they don't make 'em like this anymore\nI ask 'cause I'm not sure\nDo anybody make real shit anymore?\nBow in the presence of greatness\n'cause right now thou has forsaken us\nYou should be honored by my lateness\nThat I would even show up to this fake shit\nSo go ahead go nuts go ape shit\nEspecially in my pastel on my bape shit\nAct like you can't tell who made this\nNew gospel homey, take six, and take this, haters\n\n[Chorus]\n\nI need you right now\nI need you right now\n\nMe likey\n\nI don't know if you got a man or not,\nIf you made plans or not\nGod put me in the plans or not\nI'm trippin' this drink got me sayin' a lot\nBut I know that God put you in front of me\n\nSo how the hell could you front on me?\nThere's a thousand you's, there's only one of me\nI'm trippin', I'm caught up in the moment right?\nThis is Louis Vuitton Don night\nSo we gonna do everything that Kan like\nHeard they'd do anything for a Klondike\nWell I'd do anything for a blonde-dike\nAnd she'll do anything for the limelight\nAnd we'll do anything when the time's right\nUgh, baby, you're makin' it (harder, better, faster, stronger)\n\n[Chorus]\n\nI need you right now\nI need you right now\n\nYou know how long I've been on you?\nSince Prince was on Apollonia\nSince OJ had Isotoners\nDon't act like I never told you [x6]\nBaby, you're making it (harder, better, faster, stronger)\n\n[Chorus]\n\nI need you right now [x4]\n\nYou know how long I've been on you?\nSince Prince was on Apollonia\nSince OJ had Isotoners\nDon't act like I never told you\nNever told you [x4]\n\nNever over [x8] \n\n\n\nDetails\n\n\nGeneral\nFormat                           : DivX\nFile size                        : 150 MiB\nDuration                         : 4mn 25s\nOverall bit rate                 : 4,746 Kbps\n\nVideo\nFormat                           : MPEG-4 Visual\nDuration                         : 4mn 25s\nBit rate                         : 4,288 Kbps\nWidth                            : 1,200 pixels\nHeight                           : 672 pixels\nDisplay aspect ratio             : 16:9\nFrame rate                       : 25.000 fps\nScan type                        : Progressive\nStream size                      : 136 MiB (90%)\n\nAudio\nFormat                           : AC-3\nDuration                         : 4mn 25s\nBit rate mode                    : Constant\nBit rate                         : 448 Kbps\nChannel(s)                       : 2 channels\nChannel positions                : Front: L R\nSampling rate                    : 48.0 KHz\nStream size                      : 14.2 MiB (9%)","torrent":{"xt":"urn:btih:d163d00da3a05d46eac20008f4d18187023b8125","amp;dn":"Stronger+-+Kanye+West+%28HD+720p%29+%5Bmildpoison%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d163d00da3a05d46eac20008f4d18187023b8125","infoHashBuffer":{"type":"Buffer","data":[209,99,208,13,163,160,93,70,234,194,0,8,244,209,129,135,2,59,129,37]},"announce":[],"urlList":[]}}