{"title":"Coast To Coast Am - 08-15-10 - UFOs Breaking the Silence","uid":5767991,"size":56183386,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d16435c2365212639a20b243169f1b1a9c92e2dd&amp;dn=Coast+To+Coast+Am+-+08-15-10+-+UFOs+Breaking+the+Silence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1281988087,"description":"Date:\n\t\n\n08-15-10\n\nHost:\n\t\n\nGeorge Knapp\n\nGuests:\n\t\n\nLeslie Kean, Robert Hastings, Bruce Fenstermacher\n\nIn the first half of the show, investigative reporter Leslie Kean talked about her research into the evidence for UFOs, and her new book UFOs on the Record, which gathers together testimonies from government, aviation and military sources. One of the testimonies is from Belgium Air Force General Wilfried De Brouwer who described unexplained sightings of large triangular objects that kept returning over Belgium from 1989-90. The United States has a different approach to UFOs than other countries, she noted, typically withholding information or offering inane explanations. This was the case in the 2006 O'Hare Airport incident, when a metallic craft shot up in the air and cut a hole through clouds, and the FAA declared it was merely a weather phenomenon, she detailed.\n\nAs is being done in countries like France, Kean advocated for the US to set up a small agency or office dedicated to investigating UFO cases as they happen, making use of a network of scientists and experts in various fields. &quot;Government officials have access to all the information that's needed to do a proper investigation,&quot; whereas civilian groups have to wait three months to file a Freedom of Information request to get data such as FAA tapes, she noted. Part of the mandate for such an agency would be to report their findings to the public, she added.\n\n----------------------------------\n\nAppearing in the second half, UFO researcher Robert Hastings talked about a press conference at the National Press Club in Washington, DC that he and former US Air Force Capt. Robert Salas are organizing for September 27th. The conference will feature a number of former Air Force personnel discussing their first hand experiences of UFO incursions/tampering at US nuclear weapons facilities. Such incursions have also occurred at Russian nuclear sites. &quot;This is a monumental story that has been ignored by the media...decade after decade,&quot; he stated.\n\nIn the last hour, former Air Force officer Bruce Fenstermacher joined the conversation, and described a UFO incident that took place when he was the Missile Combat Crew Commander at Warren AFB in Cheyenne, WY in 1976. Hastings speculated that the interference at nuclear sites by UFO occupants could be their way of warning us that &quot;we are playing with fire.&quot; A free excerpt from Hastings' book, UFOs and Nukes, has been made available on UFO Digest.\nWebsite(s):\n# ufosontherecord.com\n# ufohastings.com\nBook(s):\n# UFOs: Generals, Pilots and Government Officials Go On the Record\n# UFOs and Nukes\n","torrent":{"xt":"urn:btih:d16435c2365212639a20b243169f1b1a9c92e2dd","amp;dn":"Coast+To+Coast+Am+-+08-15-10+-+UFOs+Breaking+the+Silence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d16435c2365212639a20b243169f1b1a9c92e2dd","infoHashBuffer":{"type":"Buffer","data":[209,100,53,194,54,82,18,99,154,32,178,67,22,159,27,26,156,146,226,221]},"announce":[],"urlList":[]}}