{"title":"Incas.El secreto de los ancestros.(civilizaciones perdidas).DVDR","uid":5792330,"size":628082688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4785f7c65fd94fa7fea0ebfd31dfd96c6d8ab11&amp;dn=Incas.El+secreto+de+los+ancestros.%28civilizaciones+perdidas%29.DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1282898831,"description":"7. Incas: El secreto de los ancestros\nAl mismo tiempo que dominaban un imperio sometido a las mÃƒÂ¡s severas condiciones medioambientales conocidas por el hombre, los emperadores incas gobernaban con gran esplendor, alcanzando el punto culminante de 3.000 aÃƒÂ±os de desarrollo cultural sudamericano. Ahora, puede conocer los misterios que se esconden tras su destacada ascensiÃƒÂ³n al poder y desenterrar &quot;Los secretos de los ancestros&quot;.\n\nÃƒÅ¡nase a los investigadores mientras nos revelan los enigmas de los Nazca, los creadores de cerÃƒÂ¡micas que en la antigÃƒÂ¼edad se creÃƒÂ­a que eran obra de seres extraÃƒÂ±os. Descubra el arte erÃƒÂ³tico y los exquisitos utensilios de oro de los Moche. Todo ello ha pervivido como testimonio de una sociedad muy desarrollada que desapareciÃƒÂ³ hace siglos. MaravÃƒÂ­llese ante los antiguos habitantes de Paracas, protagonistas de milagros mÃƒÂ©dicos en cirugÃƒÂ­a cerebral con la utilizaciÃƒÂ³n de utensilios primitivos de metal. Contemple tambiÃƒÂ©n la increÃƒÂ­ble obra de ingenierÃƒÂ­a, el fabuloso Machu Picchu, escondido durante siglos hasta que, en 1911, un arqueÃƒÂ³logo americano logrÃƒÂ³ cruzar la selva y descubriÃƒÂ³ su majestuosa belleza. Viaje a lo largo de los miles de kilÃƒÂ³metros del sistema de carreteras, maravÃƒÂ­llese ante la magnificencia de la arquitectura inca y observe el ritual inolvidable de la adoraciÃƒÂ³n ancestral a las momias. Reviva con nosotros el devastador encuentro entre los Incas y los conquistadores espaÃƒÂ±oles que, equipados con armas de fuego, causaron la trÃƒÂ¡gica desapariciÃƒÂ³n del hasta entonces invicto pueblo Inca.\n","torrent":{"xt":"urn:btih:d4785f7c65fd94fa7fea0ebfd31dfd96c6d8ab11","amp;dn":"Incas.El+secreto+de+los+ancestros.%28civilizaciones+perdidas%29.DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4785f7c65fd94fa7fea0ebfd31dfd96c6d8ab11","infoHashBuffer":{"type":"Buffer","data":[212,120,95,124,101,253,148,250,127,234,14,191,211,29,253,150,198,216,171,17]},"announce":[],"urlList":[]}}