{"title":"Herman's Hermits - Hold On (1966)(Extended Japanese Release 199","uid":6382729,"size":300761135,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d563bdca774a020876676e0a29d7fb6d333554b0&amp;dn=Herman%5C%27s+Hermits+-+Hold+On+%281966%29%28Extended+Japanese+Release+199&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SoundbaronPirateBay","files":54,"time":1305087484,"description":"Music : Rock : Lossless\n\n\n\n\n\n\nHerman's Hermits - Hold On (1966)(Extended Japanese Release 1993)(FLAC)(HQ Artwork Scans Included)(OST Soundtrack)\n\n\n\n\n\n\n\n\n\n\nThe Hold On! EP by Herman's Hermits was the band's fifth EP and was released in the United Kingdom by EMI/Columbia (catalogue number SEG 8503.) In the US and Canada it was released as a full album. It was the third album released by MGM Records in the U.S. and Canada for the band.\n\nIt is the soundtrack album to a 1966 film featuring Herman's Hermits and Shelley Fabares, Hold On!.\n\nThe producers had recruited Fred Karger, a Hollywood composer who had served as music director of the group's previous movie, When the Boys Meet the Girls, to write the songs for the movie. In an interview on a television documentary on The British Invasion, Peter Noone recalled that the original title of the film was There's No Place Like Space, for which Karger had written the theme song. However, the group and their manager Mickie Most agreed that the song wasn't right for them and, instead, asked co-star Shelley Fabares' then-husband, record producer Lou Adler, for help. Adler recommended songwriter P.F. Sloan to compose the title track for the film. Sloan's recollection was that the film was to be renamed A Must to Avoid, and he wrote a song for that title, with some contributions from his writing partner Steve Barri. When the studio vetoed that title, the film was then retitled Hold On! after another one of Sloan's songs.\n\nUltimately, the ten-song U.S. soundtrack album included five songs written by Karger, including the lone song sung by Fabares, four songs written by Sloan/Barri, and one Hermits cover of a 1937 British music hall song. The six-song U.K. EP used all four Sloan/Barri songs and just two of the Karger songs.\n\n&quot;A Must to Avoid&quot; and &quot;Leaning on a Lamp Post&quot; both reached the Billboard Top 10 as singles in the U.S., and &quot;Hold On!&quot; was a B-side. &quot;A Must to Avoid&quot; was also a top 10 hit in the U.K.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Hold_On!_%28album%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Hold_On!_%28album%29&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nReview:\n\nMore than another Herman's Hermits album with two hit songs, &quot;Leaning on the Lamp Post&quot; and &quot;A Must to Avoid,&quot; this MGM soundtrack features the original version of &quot;Where Were You When I Needed You,&quot; the first of 14 hits for the Grass Roots, which landed in the Top 30 four months after Peter Noone sang it. This version, like everything here, sounds very British Invasion, Mickey Most's production emulating early Beatles. Four of the tunes, including the title track &quot;Hold On&quot; and the hit &quot;A Must to Avoid,&quot; were written by the team of Steve Barri and P.F. Sloan, the original pairing which helped launch the Grass Roots. This is the West Coast meeting the U.K. in a very pleasant way, and the combination is impressive. Five of the lesser tunes were penned by F. Kargor/B. Weisman/S. Wayne, including the best of that bunch, &quot;Make Me Happy,&quot; sung by actress Shelley Fabares. Fabares hit with the song &quot;Johnny Angel&quot; in 1962, and this has that same pop feel. Credited as Shelley Fabares with Herman's Hermits, it is basically Fabares solo with the same backing musicians, presumably, that Noone utilized. Fabares was married for a time to Lou Adler, who was also involved with the Grass Roots, the forces at play creating a unique blend of pop styles for the soundtrack to this '60s film. Peter Noone injects more of that pop into &quot;Where Were You When I Needed You,&quot; the thin guitar and boisterous backing vocals making for a great party cut, much different from the Grass Roots' hit. &quot;Leaning on the Lamp Post&quot; is not as strong as &quot;A Must to Avoid,&quot; but was a genuine hit as well. No songwriter listed here, &quot;Leaning on the Lamp Post&quot; is credited to a songwriter named Gay on The Best of Herman's Hermits, Vol. 2, where it was reissued along with &quot;A Must to Avoid&quot; and the title track, &quot;Hold On.&quot; A short but fun disc, and essential for the fans of Peter Noone.\n\nBy Joe Viglione.\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/hold-on-r66916/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/hold-on-r66916/review&lt;/a&gt;\n\n\n\n\n\n\n\n\n\n\nTracklist:\n\n01. Hold On\n02. The George And Dragon\n03. Wild Love\n04. Where Were You When I Needed You\n05. The Things I Do For You Baby\n06. Gotta Get Away\n07. Leaning On The Lamp Post\n08. This Door Swings Both Ways\n09. Je Suis Anglais\n10. Make Me Happy\n11. For Love\n12. Got A Feeling\n13. A Must To Avoid\n14. Little Miss Sorrow, Child Of Tomorrow\n15. Jezebel\n16. It's Nice To Be Out In The Morning\n17. Sleepy Joe\n18. Sunshine Girl\n19. The Most Beautiful Thing In My Life\n20. Here Comes The Star\n21. Bet Yer Life I Do\n22. Lady Barbara (Peter Noon &amp; Herman's Hermits)\n23. Oh, You Pretty Thing (Peter Noon)\n\n\n\n\n\n\n\n\nENJOY &amp; AS ALWAYS: REMEMBER TO KEEP SEEDING FOR OTHERS!!!\nTHANKS!!\n","torrent":{"xt":"urn:btih:d563bdca774a020876676e0a29d7fb6d333554b0","amp;dn":"Herman%5C%27s+Hermits+-+Hold+On+%281966%29%28Extended+Japanese+Release+199","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d563bdca774a020876676e0a29d7fb6d333554b0","infoHashBuffer":{"type":"Buffer","data":[213,99,189,202,119,74,2,8,118,103,110,10,41,215,251,109,51,53,84,176]},"announce":[],"urlList":[]}}