{"title":"Sam &amp; Max: Season Two [pcgame - multi5] [Tntvillage]","uid":5781020,"size":2567792640,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d66af856c3a91d127f221f7e2092d2fca9fdac23&amp;dn=Sam+%26+Max%3A+Season+Two+%5Bpcgame+-+multi5%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1282403384,"description":"Sam &amp; Max: Season Two [pcgame - multi5] [Tntvillage]\n\n[img]http://img708.imageshack.us/img708/4162/covp.jpg[/img]\n\nAvventura - 1 DVD - Eng - Menu e Sub. Multi5 (Eng-Fre-Ita-Ger-Spa)\nData di uscita: 11 aprile 2009\n\nVisit this link: \n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220770&amp;view=findpost&amp;p=12279276&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220770&amp;view=findpost&amp;p=12279276&lt;/a&gt;\n\nVisit this link: http://translate.google.com/?hl=en&amp;sl=auto&amp;tl=en#\n\n.::.Description.::.\n\nVisto il successo ottenuto con la &quot;Season One&quot;, la Telltate Game ha deciso di produrre questa &quot;Season Two&quot; in cui i due amici investigatori continuano a risolvere problemi improbabili.\n\nEpisodio 1 - ICE STATION SANTA\nI doni di Babbo Natale stanno arrivando un po' troppo in anticipo e per giunta non sono quel che si dice &quot;innocui&quot; come ci si aspetterebbe. Infatti il gioco inizia con un enorme robot inviato in dono a Sam &amp; Max, che si accinge a distruggere tutto quello che esiste nella strada del loro ufficio. Bloccato il malefico &quot;giocattolo&quot; i due si danno da fare per scoprire cosa sta accadendo e per questo vanno al Polo Nord, nella sede del vecchio Babbo e lÃƒÂ¬ scoprono che....\n\n[img]http://img7.imageshack.us/img7/7436/73665598.jpg[/img]  [img]http://img825.imageshack.us/img825/1543/83807334.jpg[/img]\n\nEpisodio 2 - MOAI BETTER BLUES\nSam e Max sono inseguiti da un enorme triangolo rosso e finiscono sull'Isola di Pasqua. Qui vedremo i grandi &quot;Moai&quot;, le statue a mezzo busto che si pensa rappresentino i primi colonizzatori polinesiani, e una serie di personaggi coloriti ed un po' strampalati com'ÃƒÂ¨ nello spirito del gioco.\nL'isola sta per esplodere a causa di un vulcano e i due eroi sono naturalmente destinati a salvarla.\n\n[img]http://img256.imageshack.us/img256/4797/54213138.jpg[/img]  [img]http://img837.imageshack.us/img837/4921/46400300.jpg[/img]\n\nEpisodio 3 - - NIGHT OF THE RAVING DEAD\nQuesta volta i due eroi se la debbono vedere con degli zombies che infestano la cittÃƒÂ . Da dove vengono? Sam e Max scoprono la fabbrica: un delirante giovane vampiro dalle orecchie a punta ÃƒÂ¨ capace di trasformare in zombies coloro che seguono il suo carisma di ballo e di musica.\nPer sconfiggerlo, i due eroi finiranno zombies essi stessi e dovranno faticare a riunirsi ai loro corpi, ma ci riusciranno entrambi? Lo vedremo nel prossimo episodio.\n\n[img]http://img62.imageshack.us/img62/6443/19789859.jpg[/img]  [img]http://img180.imageshack.us/img180/8749/87975584.jpg[/img]\n\nEpisodio 4 - CHARIOTS OF THE DOGS\nBosco ÃƒÂ¨ scomparso e i due amici partono alla sua ricerca. Lo trovano su una strana astronave guidata dai mariachi (sono i caratteristici stornellatori messicani armati di cappellone e di chitarra). Bosco ÃƒÂ¨ trasformato in una mucca.\nPer liberare Bosco, i due dovranno viaggiare attraverso il tempo rivedendosi da vecchi e da bambini.\nQuesta volta gli enigmi sono piÃƒÂ¹ semplici ed intuitivi delle altre e non c'ÃƒÂ¨ neppure il solito giochino arcade che qualche volta snervava.\n\n[img]http://img94.imageshack.us/img94/9567/70254392.jpg[/img]  [img]http://img828.imageshack.us/img828/3379/26189894.jpg[/img]\n\nEpisodio 5 - WHAT'S NEW, BEELZEBUB?\nBosco ÃƒÂ¨ morto e bisogna recuperare la sua anima. I due amici dovranno andare all'Inferno, rappresentato come un ufficio moderno, e vedersela con BelzebÃƒÂ¹. Ben presto perÃƒÂ² scopriranno che il povero diavolo non ÃƒÂ¨ altro che un &quot;impiegato&quot; manovrato dai tre terribili Peppers. Questo episodio, a mio avviso, ÃƒÂ¨ il peggiore della serie: una sotria ancora piÃƒÂ¹ cervellotica delle altre, enigmi astrusi e privi di ogni logica, locazioni viste e riviste. Il giochino arcade per fortuna in questo episodio si puÃƒÂ² evitare anche perchÃƒÂ© ÃƒÂ¨ davvero difficile superarlo.\n\n[img]http://img36.imageshack.us/img36/5315/25675107.jpg[/img]  [img]http://img443.imageshack.us/img443/2088/16211540.jpg[/img]\n\nIL GIOCO\nGrafica - Il gioco ÃƒÂ¨ un punta e clicca in terza persona, con movimento direzionale e animazioni in 3D integrali.\nCiÃƒÂ² che colpisce maggiormente sono gli sfondi e i personaggi molto colorati, dalle fattezze paffute e tondeggianti tipiche dei bei cartoni animati di una volta: una grafica allegra, simpatica, accurata, fantasiosa, ricca di invenzioni.\nLe locazioni sono ben esplorabili; alcune sono fisse: l'ufficio e i negozi della strada, mentre le altre, dove si svolge la storia di turno, cambiano di volta in volta ma in tutto superano di poco la decina.\nI personaggi sono pochi ma fortemente caratterizzati, con frequenti animazioni in primo piano che ne fanno anche vedere le espressioni.\nQualcosa nel panorama del gioco ÃƒÂ¨ cambiato: l'ufficio di Sybil ÃƒÂ¨ finito quasi in pezzi ad opera del robottone malefico, in compenso Stinky ha aperto un ristorante e Bosco ÃƒÂ¨ sempre al suo posto.\n\nSonoro - Il sottofondo musicale si fa sentire nei momenti piÃƒÂ¹ concitati, mentre normalmente c'ÃƒÂ¨ un'ottima musica jazz che fa da sfondo tenue al gioco. Il doppiaggio ÃƒÂ¨ buono, con le voci molto adatte che caratterizzano bene i personaggi.\nI dialoghi sono fitti di battute ma certe volte paiono un po' troppo lunghi e insistiti e danno l'impressione che il gioco sia costruito piÃƒÂ¹ per un intrattenimento umoristico che come gioco interattivo. D'altra parte l'umorismo demenziale ÃƒÂ¨ un po' la caratteristica che ha fatto il successo del primo &quot;Sam &amp; Max on the road&quot; ed ÃƒÂ¨ evidente che gli autori abbiano voluto proseguire sulla stessa linea di sceneggiatura.\nI rumori sono giustamente enfatizzati: il rumore di porte aperte e chiuse, del traffico, del treno che passa e soprattutto i disastri combinati durante la corsa in macchina.\n\nEnigmi - Sono ben integrati nel gioco ma non ci si aspetti enigmi nel vero senso della parola.\nGli oggetti d'inventario sono molto pochi ed ÃƒÂ¨ pressochÃƒÂ© scontato dove usarli. C'ÃƒÂ¨ qualche giochino di abilitÃƒÂ , ma sono quasi tutti enigmi interattivi, da operare sulle cose o sulle persone. Infatti l'interattivitÃƒÂ , in questa avventura, ÃƒÂ¨ prevalente: si puÃƒÂ² cliccare praticamente su tutto e di tutto ci sarÃƒÂ  una descrizione umoristica. Il gioco punta molto su questo aspetto, infatti molto spesso per superare certi empasse basta far ricorso ad una intuizione un po' cervellotica come si conviene alla natura dei due protagonisti.\nSi ha l'impressione di aver a che fare con un gioco per bambini, ma i dialoghi, le battute, le spiritosaggini sono rivolte alla comprensione di un utente piÃƒÂ¹ adulto, tutt'altro che infantile.\nQuindi questo gioco puÃƒÂ² essere giocato da un bambino di 8 anni ma capito da una persona piÃƒÂ¹ adulta e smaliziata. Un ibrido che puÃƒÂ² piacere o non piacere ma che riflette comunque lo spirito del gioco originale, scanzonato, un po' cattivo e singolare nel suo genere.\nNon manca qualche semplice giochino arcade.\nGli episodi sono brevi, il terzo ancor piÃƒÂ¹ dei due precedenti. Il fatto che questi episodi si giochino online, deve probabilmente condizionarne la lunghezza e la complessitÃƒÂ .\n\nVisit thelink:\n\nInstallazione:\n1. montate o masterizzate l'immagine.\n2. installate il gioco.\n3. Aprite il driver virtuale su cui avete montato il file immagine. Aprite la cartella cura e copiate i file uno alla volta nelle rispettive cartelle di installazione dell'episodio (esempio:  SamMax201 in gamedir/episode 201 - SamMax202 in Episode 202 - etc)\n4. buon divertimento.\n\nIl gioco ÃƒÂ¨ stato testato su windows XP SP3","torrent":{"xt":"urn:btih:d66af856c3a91d127f221f7e2092d2fca9fdac23","amp;dn":"Sam+%26+Max%3A+Season+Two+%5Bpcgame+-+multi5%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d66af856c3a91d127f221f7e2092d2fca9fdac23","infoHashBuffer":{"type":"Buffer","data":[214,106,248,86,195,169,29,18,127,34,31,126,32,146,210,252,169,253,172,35]},"announce":[],"urlList":[]}}