{"title":"Plants Vs Zombies download [WORKING 100%]","uid":6337217,"size":47178480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d6fb7c85b1d3101e0177bc3ea67f3d40808a5297&amp;dn=Plants+Vs+Zombies+download+%5BWORKING+100%25%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"icyfish1337","files":1,"time":1303516673,"description":"Swedish\n\nPlants vs. Zombies ÃƒÂ¤r ett tower defence-datorspel utvecklat av Popcap Games till Microsoft Windows, Mac OS X, Xbox Live Arcade och iOS. Spelarens mÃƒÂ¥l ÃƒÂ¤r att skydda ett hus frÃƒÂ¥n attackerande zombier genom att plantera flera olika plantor. Spelet slÃƒÂ¤pptes 5 maj 2009 och gjordes tillgÃƒÂ¤ngligt pÃƒÂ¥ steam samma dag.\n\nSpelaren ska plantera olika plantor, dÃƒÂ¤ribland plantor som skjuter ÃƒÂ¤rtor, svampar, solrosor (som ger solenergi fÃƒÂ¶r att kunna plantera fler blommor) och potatisminor pÃƒÂ¥ bakgÃƒÂ¥rden, framsidan och pÃƒÂ¥ taket av ett hus fÃƒÂ¶r att skydda den inneboende frÃƒÂ¥n att bli uppÃƒÂ¤ten av zombier. Plantorna kan vara av offensiv eller defensiv karaktÃƒÂ¤r och olika effektiva mot olika typer av zombier.\n\nSpelfÃƒÂ¤ltet ÃƒÂ¤r uppdelat i ett antal horisontella filer, och en zombie nÃƒÂ¤rmar sig bara huset utan att byta fil (utom i undantagsfall) och de flesta plantor kan bara attackera eller fÃƒÂ¶rsvara sig mot zombier i samma fil. NÃƒÂ¤r man har dÃƒÂ¶dat alla zombier pÃƒÂ¥ en bana fÃƒÂ¥r man ofta en belÃƒÂ¶ning i form av ett nytt sorts frÃƒÂ¶ (planta) som man kan anvÃƒÂ¤nda i fortsÃƒÂ¤ttningen. Till varje bana fÃƒÂ¥r spelaren bara vÃƒÂ¤lja ut en uppsÃƒÂ¤ttning av plantor som han ska kunna plantera. Valet ÃƒÂ¤r strategiskt eftersom olika plantor bara kan placeras pÃƒÂ¥ grÃƒÂ¤smattan eller i poolen och fungerar olika bra pÃƒÂ¥ dagen eller natten. Dessutom fÃƒÂ¥r man innan varje bana se vilka typer av zombier som kommer att dyka upp.\n\n\nPlants vs. Zombies har fÃƒÂ¥tt positiv frÃƒÂ¥n kritiker och ett sammantaget betyg pÃƒÂ¥ 88/100 hos Metacritic och 88,6% hos GameRankings. IGN-skribenten Daemon Hatfield sade att spelet var mycket innehÃƒÂ¥llsrikare ÃƒÂ¤n liknande spel och hyllade det fÃƒÂ¶r att vara beroendeframkallande. GameSpot-skribenten Chris Watters berÃƒÂ¶mde spelet fÃƒÂ¶r plantornas och zombiernas design och ÃƒÂ¶vergripande utseende. Men han sÃƒÂ¥g fel i spelet inlÃƒÂ¤rningskurva. En recension i tidningen Edge lovordade utvecklarna fÃƒÂ¶r sin uppfinningsrikedom i alla detaljer och fÃƒÂ¶r att ha gjort om Tower-defense-genren till sin egen stil.\n\nMusikvideon av Laura Shigihara fick ocksÃƒÂ¥ berÃƒÂ¶m av Hatfield som tillskrev den sitt fÃƒÂ¶rsta intresse i spelet. 1up-skribenten Alice Liang berÃƒÂ¶mde ocksÃƒÂ¥ lÃƒÂ¥ten och undrade sig hur nÃƒÂ¥gon inte skulle kunna intressera sig fÃƒÂ¶r Plants vs. Zombies efter att ha sett videon\n\nPlants vs. Zombies nominerades till \\\\\\\\\\\\\\&quot;Casual Game of the Year\\\\\\\\\\\\\\&quot; och \\\\\\\\\\\\\\&quot;Outstanding Achievement in Game Design\\\\\\\\\\\\\\&quot; Interactive Achievement Awards frÃƒÂ¥n Academy of Interactive Arts &amp; Sciences. Det fick ÃƒÂ¤ven nomineringar fÃƒÂ¶r \\\\\\\\\\\\\\&quot;Best Game Design\\\\\\\\\\\\\\&quot;, \\\\\\\\\\\\\\&quot;Innovation\\\\\\\\\\\\\\&quot; och \\\\\\\\\\\\\\&quot;Best Download Game\\\\\\\\\\\\\\&quot; fÃƒÂ¶r Game Developers Choice Awards. Plants vs Zombies valdes av Gamezebo till ett av 2009 ÃƒÂ¥rs bÃƒÂ¤sta spel.\n\n###################################################################################\n\nEnglish\n\nPlants vs.. Zombies is a Tower Defence games developed by PopCap Games for Windows, Mac OS X, Xbox Live Arcade and IOS. The player\\\\\\\\\\\\\\'s goal is to protect a house from the attacking zombies by planting several different plants. The game was released 5 May 2009 and was made available on steam on the day.\n\nThe player will plant various plants, including plants that shoots peas, mushrooms, sunflower (which provides solar energy to plant more flowers) and potato mines in the backyard, the front and on the roof of a house to protect the resident from being eaten by zombies. Plants may be offensive or defensive in nature and differ in their effectiveness against different types of zombies.\n\nThe game field is divided into a number of horizontal files, and a zombie approaching only the house without changing lanes (except in exceptional cases) and most plants can only attack or defend themselves from zombies in the same file. When you have killed all the zombies on a path, there are often a reward in the form of a new kind of seeds (plants) that can be used in the future. For each level the player may only select one set of plants that he should be able to plant. The choice is strategic as the various plants can only be placed on the lawn or in the pool and serves a great variety of day or night. In addition, one before each level to see what types of zombies will emerge.\n\n\nPlants vs.. Zombies have been positive from critics and an overall rating of 88/100 at Metacritic and 88.6% in game rankings. IGN writer Daemon Hatfield said that the game was much richer than similar games and hailed it to be addictive. GameSpot-writer Chris Watters praised the game for the plants and zombies design and overall appearance. But he saw the error of the game learning curve. A review of Edge magazine praised the developers for their ingenuity in every detail and for having made the Tower Defense genre to its own style.\n\nThe music video of Laura Shigihara also received praise from Hatfield who wrote on his first interest in the game. 1up-writer Alice Liang also praised the song and wondered how anyone could not take an interest in Plants vs.. Zombies after seeing the video\n\nPlants vs.. Zombies nominated for \\\\\\\\\\\\\\&quot;Casual Game of the Year\\\\\\\\\\\\\\&quot; and \\\\\\\\\\\\\\&quot;Outstanding Achievement in Game Design\\\\\\\\\\\\\\&quot; Interactive Achievement Awards from the Academy of Interactive Arts &amp; Sciences. It also received nominations for Best Game Design \\\\\\\\\\\\\\&quot;,\\\\\\\\\\\\\\&quot; Innovation \\\\\\\\\\\\\\&quot;and\\\\\\\\\\\\\\&quot; Best Download Game \\\\\\\\\\\\\\&quot;for the Game Developers Choice Awards. Plants vs. Zombies was elected by Gamezebo to one of 2009\\\\\\\\\\\\\\'s best games.","torrent":{"xt":"urn:btih:d6fb7c85b1d3101e0177bc3ea67f3d40808a5297","amp;dn":"Plants+Vs+Zombies+download+%5BWORKING+100%25%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6fb7c85b1d3101e0177bc3ea67f3d40808a5297","infoHashBuffer":{"type":"Buffer","data":[214,251,124,133,177,211,16,30,1,119,188,62,166,127,61,64,128,138,82,151]},"announce":[],"urlList":[]}}