{"title":"OrgPassword.v3.4.Cracked-MESMERiZE","uid":6497970,"size":21389972,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7e9cf4f3cffc08118702ddca35d1429f5f182e8&amp;dn=OrgPassword.v3.4.Cracked-MESMERiZE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1309145936,"description":"OrgPassword 3.4\n\nOrgPassword provides a convenient system for storing different kinds of personal information. OrgPassword is all that is required to keep your personal information in perfect order. OrgPassword provides a number of categories, each purposed to keep a certain type of information so you can find exactly what you need in a blink of an eye. The utility is protected with a master password and shines with a brilliant interface that allows managing your data with ease.\n\nUsing a set of competently organized templates, you can add information to six categories: Accounts, Software, Credit cards, Websites, Email accounts and Newsgroup accounts. Every category contains peculiar columns and allows sorting information to locate what you need right away.\n\nOne master-password provides an easy access to all information stored within OrgPassword. You can rest assured that it will prevent anyone from unauthorized access. Intruders won't bypass this rock-solid protection as the password uses a reliable up-to-date encryption.\n\nAt any time you can export the whole or only a certain part of the data stored in a selected category of OrgPassword into a variety of formats, including Excel, Text, Html and Xml.\n\nWhat's more: you can print any data you like at once without copy-and-paste operations. The program features the Print designer where you can adjust the appearance of a document and also has the Preview function. You can swiftly print what you want in the way you want.\n\nYou will certainly appreciate that the creators of the program have done their best in making auspicious working conditions. The interface is ornamented with smooth eye-catching icons and designed to provide the user with maximum comfort. It makes the utility quite intuitive.\n\nOrgPassword is a perfect solution for keeping all valuable information in one place. It combines both a handy interface for quick data management and a reliable master password to lock your data safe. With this useful utility your personal data will be always secured and at hand.\n\nHome Page - http://www.orgbusiness.com/\n\n\n","torrent":{"xt":"urn:btih:d7e9cf4f3cffc08118702ddca35d1429f5f182e8","amp;dn":"OrgPassword.v3.4.Cracked-MESMERiZE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7e9cf4f3cffc08118702ddca35d1429f5f182e8","infoHashBuffer":{"type":"Buffer","data":[215,233,207,79,60,255,192,129,24,112,45,220,163,93,20,41,245,241,130,232]},"announce":[],"urlList":[]}}