{"title":"Buenezas En La Mesa - BÃƒÂ¡rbara S. Drausal ","uid":5795128,"size":7411945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d855d170a9608c85f4158776fcf4267ba5b7c87a&amp;dn=Buenezas+En+La+Mesa+-+B%C3%83%C2%A1rbara+S.+Drausal+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":3,"time":1283009476,"description":"Muchas de las plantas que consideramos malezas son comestibles y algunas son MUY ricas. Mas que malezas son buenezas. Este libro permite conocerlas e indica como prepararlas. La crisis econÃƒÂ³mica recien empieza. La crisis ecolÃƒÂ³gica estÃƒÂ¡ en marcha. El conocimiento de este libro serÃƒÂ¡ cada aÃƒÂ±o de mayor utilidad vital.\nEn Argentina y Uruguay la palabra &quot;yuyo&quot; equivale a maleza o mala hierba. En Chile corresponde al nabo silvestre, pero la palabra viene del quichua: yuyu, que significa hierba comestible o condimentaria. Yuyuchacara equivale a huerta y yuyocamayoc a hortelano.\nEn la Patagonia, donde comenzÃƒÂ³ el estudio, hay mÃƒÂ¡s de cien plantas exÃƒÂ³ticas consideradas 'yuyos' y que la gente no consume por desconocimiento. En el ÃƒÂ¡rea que cubre desde el sur de Brasil y el norte de Chile hasta Tierra del Fuego, la lista llega a las 300 especies. Muchas de estas plantas fueron alimentos de nuestros antepasados, europeos y americanos. En buena medida este conocimiento se ha perdido.\nEl estudio aportÃƒÂ³ datos muy interesantes como el hecho de que, en una ciudad pequeÃƒÂ±a como Bariloche, en promedio, hay 1300 kg de excelente comida, por hectÃƒÂ¡rea. En algunos lugares la cifra aumenta a 7 toneladas...\n...Muchas de las verduras que consumimos actualmente, como la acelga, avena, rÃƒÂºcula, zanahoria, achicoria y otras, formaron parte de las malezas que ahora comienzan a conocerse como 'buenezas', segÃƒÂºn el nombre que propuso Eddy.\nUn dato mÃƒÂ¡s que interesante: estas plantas ganan por amplio margen en nutrientes a las verduras cultivadas.\nEspero que este libro con recetas de cocina sea de utilidad a todos los que deseen experimentar con plantas silvestres que han alimentado a la humanidad desde tiempos inmemoriales.\n\n\n\n\n \n \n\n","torrent":{"xt":"urn:btih:d855d170a9608c85f4158776fcf4267ba5b7c87a","amp;dn":"Buenezas+En+La+Mesa+-+B%C3%83%C2%A1rbara+S.+Drausal+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d855d170a9608c85f4158776fcf4267ba5b7c87a","infoHashBuffer":{"type":"Buffer","data":[216,85,209,112,169,96,140,133,244,21,135,118,252,244,38,123,165,183,200,122]},"announce":[],"urlList":[]}}