{"title":"Oh Oh Tirol disc 2 van 2 retail NL Subs --TBS","uid":6459676,"size":4495151511,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d9014cbf77353fab2bf04d7e3d4d8474ddc1b193&amp;dn=Oh+Oh+Tirol+disc+2+van+2+retail+NL+Subs+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1307714544,"description":"Oh Oh Tirol disc 2 van 2 retail NL Subs PAL\n\n\nOh Oh Tirol disc 2 van 2\n\nNa het ongekende succes van de acht populaire Haagse vrienden in de Griekse badplaats Chersonissos, verruilen ze de zon voor de sneeuw in Tirol.\nDe bekende feestgangers staan bij aankomst in Kirchberg oog in oog met hun nieuwe Haagse vriendin Tatjana, alias Tijgertje. De bloed-eigenwijze,\njonge ras-hagenezen zorgen voor weer een flinke dosis echte Haagse humor en maken de Oostenrijkse skipistes en aprÃƒÂ¨s-skihutten direct onveilig.\nNaast al het gefeest, krijgen ze de opdracht om de apres-ski sfeer in de bar 'Der Tiroler' een flinke boost te geven. Kunnen onze Hagenezen\nde kou trotseren en de feestsfeer doorzetten in de sneeuw? Zal er iemand vervroegd naar huis moeten met een gipsvlucht? In deze\n10 afleveringen zal dit en veel meer duidelijk worden!\n &lt;a href=&quot;\nhttp://ohohtirol.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ohohtirol.net/&lt;/a&gt;\n\nAfter the unprecedented success of  the  popular  Hague  eight  friends  in the Greek resort of  Hersonissos, they exchange the sun for  the  snow  in the Tyrol.\nThe partygoers are known upon arrival in Kirchberg face to face with their new friend Tatiana Hague, aka Tiger. The blood-opinionated,\nyoung ras Hagenezen provide another good dose of humor and genuine Hague to the Austrian ski slopes and aprÃƒÂ¨s-ski lodges directly unsafe.\nBesides all the partying, they were entrusted with the apres-ski atmosphere in the bar Der Tiroler &quot;a big boost. Can our Hagenezen\nbraving the cold and continue the party atmosphere in the snow? Will someone need to go home early with a plaster flight? This\n10 episodes and much more will become clear! \n\n\n\n\nSpotinformatie\n\nAudio                  : Nederlands 2.0 dolby digital\nSubs                   : Nederlands\nBeeldverhouding        : 16:9\nFramerate              : 25,000 fps\nStandaard              : PAL\nBron                   : Retail\nFormaat                : DvD5","torrent":{"xt":"urn:btih:d9014cbf77353fab2bf04d7e3d4d8474ddc1b193","amp;dn":"Oh+Oh+Tirol+disc+2+van+2+retail+NL+Subs+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9014cbf77353fab2bf04d7e3d4d8474ddc1b193","infoHashBuffer":{"type":"Buffer","data":[217,1,76,191,119,53,63,171,43,240,77,126,61,77,132,116,221,193,177,147]},"announce":[],"urlList":[]}}