{"title":"GTA San Andreas: Full SAMP (San Andreas MultiPlayer) Installatio","uid":6466791,"size":3705781000,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d9bcdccd6a6a11ccd502132e19c1c28aeb909e37&amp;dn=GTA+San+Andreas%3A+Full+SAMP+%28San+Andreas+MultiPlayer%29+Installatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JFK_NL","files":1,"time":1307986840,"description":"-----------------------------------------------------------------------------------\n\nGrand Theft Auto: San Andreas is a sandbox-style action-adventure computer and video game developed by Rockstar North in the United Kingdom. It is the third 3D game in the Grand Theft Auto video game franchise, the fifth original console release and eighth game overall. Originally released for the PlayStation 2 in October 2004, the game has since been released for the Xbox and Microsoft Windows (PC) in June 2005, and has received wide acclaim and high sales figures on all three platforms, and is the best-selling game of all time on PlayStation 2. It was made available on Steam on January 4, 2008. Grand Theft Auto: San Andreas was succeeded by Grand Theft Auto: Liberty City Stories and was preceded by Grand Theft Auto: Vice City.\n \nThe game is set in the fictional state of San Andreas, which is based on Nevada, California, and Arizona, comprising three metropolitan cities: Los Santos, based on Los Angeles, San Fierro, based on San Francisco and Las Venturas, based on Las Vegas, with deserts, rivers, forests and a mountain separating the cities. Set in late 1992, San Andreas revolves around the gang member Carl &quot;CJ&quot; Johnson returning home from Liberty City to Los Santos, San Andreas, after learning of his mother's murder. Johnson finds his old friends and family in disarray. Over the course of the game, Johnson gradually unravels the plot behind his mother's murder while exploring his own business ventures.\n \nLike other games in the series, San Andreas is composed of elements from driving games and third-person shooters, and features &quot;open-world&quot; gameplay that gives the player more control over their playing experience. However, the game also adds a number of features such as car customization, character personalization, and interactive sexual relationships.\n\n-----------------------------------------------------------------------------------\n\nSA-MP is a free multiplayer game modification for the PC version of Rockstar Games Grand Theft Auto: San Andreas. \n\n\n-----------------------------------------------------------------------------------\n\nThis is the fully cracked, unmodded GTA: San Andreas with SAMP already installed. This means that you don't have to install SAMP or download no-cd cracks/patches.\n\nIf you experience any problems with this torrent, just leave a comment and I'll post a respond ASAP.\n\n-----------------------------------------------------------------------------------\n\nPS: Seeding is always appreciated, thanks :)","torrent":{"xt":"urn:btih:d9bcdccd6a6a11ccd502132e19c1c28aeb909e37","amp;dn":"GTA+San+Andreas%3A+Full+SAMP+%28San+Andreas+MultiPlayer%29+Installatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9bcdccd6a6a11ccd502132e19c1c28aeb909e37","infoHashBuffer":{"type":"Buffer","data":[217,188,220,205,106,106,17,204,213,2,19,46,25,193,194,138,235,144,158,55]},"announce":[],"urlList":[]}}