{"title":"Live USB v.5.0 (2011) FAT32 &amp; NTFS","uid":6371366,"size":10115111082,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc0649a7584ec102402e875fc24acd8e4397cf1f&amp;dn=Live+USB+v.5.0+%282011%29+FAT32+%26+NTFS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":14,"time":1304688961,"description":"Live USB v.5.0 Alkid-MicroPE-Acronis-Password Changer-xp ZverDVD (2011)\n\nEnglish:\n------------\nYear: 2011\nVersion: 5.0\nDeveloper: Zver, Savvateev, Alkid, Yuric21\nCompatible with Windows 7/Vista: Download from WPI partially compatible\nLanguage: English, Russian\nTreatment: None required\n\nMultiboot yuric21 USB flash drive, including Alkid also microP, Acronis, Password Changer, XP, and MRP (abbreviated), and the assembly ZverDVD v.2011.5 This version has two USB image file &quot;ImageNTFS.GHO&quot; and &quot; ImageFAT32.GHO &quot;(file&quot; LUSB50fat32.rar &quot;and&quot; LUSB50ntfs.rar &quot;), c the former is much faster to copy files, but not all flash units can be lifted, and the second is slower but more reliable - a rock and created for you.\n\nFeatures:\n- Alkid LiveCD, Windows XP and Zver IPM\n- IPM destroyed by the developer to stick to your needs\n- Additional software is not integrated, and assembled in the &quot;My soft&quot;\n- Installation of Acronis BootCD v.1.3 Collection 2010 (they do not need a heavy (581 Mb) - change the image from the folder &quot;iso&quot;, the old &quot;AcronisMedia.iso) of the root file folder.\n\nInstallation (the author):\n&gt;&gt; Setting out in two stages (as in many of these stick) that have not resulted, as I did in this game since - first as usual, but during the first reboot, microP ship (which carry more Alkid fast) and change to a file: \\ Boot.ini a digit (two locations) rdisk (1) rdisk (0), (doubled in the GRUB menu, but in English), reboot and everything is in the first menu item load Windows NT/2K/XP. If the WPI does not start, then click the WPI file \\ WPI.hta the flesh of the root.\n&gt;&gt; So - have a clean (or with unnecessary information), stick to 4 GB (tested at Kingston DataTraveler 410 Kingston DataTraveler and just).\n&gt;&gt; Soft folder:\n- 1) Run the HPUSBFW.exe. In the window that appears, choose, select the device in your USB flash drive (depending on size), and point the Select FAT32 file system or NTFS (which is hit, may be irrelevant), then click the Start button, we affirm our intention to re-format the memory card after formatting, click OK and Close.\n- 2) set the boot loader in the MBR flashes - open the folder grubinst grubinst_gui.exe start the application. In the window that appears, select the item and our flash drive and click the Install button, then Enter, the final stop smoking. And problems that can happen. In some stick, sometimes flies error in this case would have to run grubinst.exe a command prompt with the following parameters:\nc: grubinst / / grubinst.exe - skip-mbr-test (HDN)\nInstead of N is necessary to replace the flash number, for example (hd1). To find out which number is the flash drive in the system as follows. Click on my laptop -&gt; Computer Management -&gt; Disk Management.\n&gt;&gt; WARNING! If instead of flash to indicate the system drive, then your MBR will be changed and the system is loaded with more time.\n3) write the image to the bottom - executing Ghost32.exe click OK and then Local - Disco - From the picture, locate the file &quot;ImageFAT32.GHO&quot; or &quot;ImageNTFS.GHO&quot; (those who believe that flash drive and the &quot;mother&quot; will work with NTFS), click on your flash drive (found in size), click OK, OK again, then Yes - the process has begun. &gt;&gt; Then click Sontinue and close the program.\n&gt;&gt; USB Flash Drive is ready!\n\nSystem requirements:\n300 MHz processor or higher\nRAM 128 MB of RAM or higher\nFree space on hard drive 5 GB\n\n\n\n\nEspaÃƒÂ±ol:\n-------------\nAÃƒÂ±o: 2011 \nVersiÃƒÂ³n: 5.0 \nDesarrollador: Zver, Savvateev, Alkid, Yuric21 \nCompatible con Windows 7/Vista: Descargar desde WPI parcialmente compatible \nIdioma: InglÃƒÂ©s, Ruso \nTratamiento: No se requiere \n\nMultiboot unidad flash USB de yuric21, incluidos Alkid tambiÃƒÂ©n, MicroPE, Acronis, Password Changer, XP, y el IPM (abreviado), asÃƒÂ­ como el montaje ZverDVD v.2011.5 Esta versiÃƒÂ³n presenta dos archivo de imagen USB &quot;ImageNTFS.GHO&quot; y &quot;ImageFAT32.GHO&quot; ( archivos &quot;LUSB50fat32.rar&quot; y &quot;LUSB50ntfs.rar&quot;), c el primero es mucho mÃƒÂ¡s rÃƒÂ¡pido para copiar archivos, pero no todas las unidades de flash se puede levantar, y el segundo es mÃƒÂ¡s lento pero mÃƒÂ¡s confiable - una roca y creado para ti.\n\nCaracterÃƒÂ­sticas:\n- Alkid LiveCD, Windows XP y el IPM de Zver\n- IPM destruida por el desarrollador para pegar a sus necesidades\n- Software adicional no estÃƒÂ¡ integrado, y montados en la carpeta &quot;Mis suave&quot;,\n- InstalaciÃƒÂ³n de Acronis BootCD ColecciÃƒÂ³n 2010 v.1.3 (que no necesitan una pesada (581 Mb) - El cambio de la imagen de la carpeta &quot;iso&quot;, el viejo &quot;AcronisMedia.iso) de la carpeta de archivos raÃƒÂ­z.\n\nDe instalaciÃƒÂ³n (del autor):\n&gt;&gt; Marco a cabo en dos etapas (como en muchos de estos palo) que no han resultado, por lo que hice en este juego ya que - por primera vez como de costumbre, pero durante el primer reinicio, MicroPE buque (que cargan mÃƒÂ¡s rÃƒÂ¡pido que Alkid) y el cambio en un archivo : \\ Boot.ini un dÃƒÂ­gito (en dos lugares) rdisk (1) rdisk (0), (duplicado en el menÃƒÂº Gruba, aunque en InglÃƒÂ©s), reiniciar y todo estÃƒÂ¡ en el primer elemento de menÃƒÂº de carga de Windows NT/2K/XP . Si el WPI no se inicio, a continuaciÃƒÂ³n, haga clic en el archivo de WPI \\ WPI.hta la carne de la raÃƒÂ­z.\n&gt;&gt; Por lo tanto - tener un lugar limpio (o con informaciÃƒÂ³n innecesaria), se adhieren a 4 GB (probado en Kingston DataTraveler 410 de Kingston DataTraveler y simplemente).\n&gt;&gt; Suave carpeta:\n- 1) Ejecute el archivo HPUSBFW.exe. En la ventana que aparece, elegir, seleccionar el dispositivo en su unidad flash USB (dependiendo del tamaÃƒÂ±o), y en el apartado del sistema de archivos Selecciona FAT32 o NTFS (lo que forma sacudiÃƒÂ³, puede ser irrelevante), a continuaciÃƒÂ³n, haga clic en el botÃƒÂ³n Inicio, afirmamos nuestra intenciÃƒÂ³n de volver a formatear la tarjeta de memoria, despuÃƒÂ©s de formatear, haga clic en Aceptar y Cerrar.\n- 2) establece el gestor de arranque en el MBR parpadea - abrir la carpeta grubinst grubinst_gui.exe iniciar la aplicaciÃƒÂ³n. En la ventana que aparece, seleccione el elemento y nuestra unidad de disco flash y haga clic en el botÃƒÂ³n Instalar, a continuaciÃƒÂ³n, Intro, al final de dejar de fumar. Y problemas que pueden suceder. En algunos palo, a veces vuela error en este caso tendrÃƒÂ¡ que ejecutar grubinst.exe de un sÃƒÂ­mbolo del sistema con los siguientes parÃƒÂ¡metros:\nc: grubinst / / grubinst.exe - skip-mbr-test (HDN)\nEn lugar de N es necesario sustituir el flash de nÃƒÂºmero, por ejemplo (hd1). Para saber quÃƒÂ© nÃƒÂºmero es la unidad flash en el sistema de la siguiente manera. Haga clic en mi computadora portÃƒÂ¡til -&gt; AdministraciÃƒÂ³n de equipos -&gt; AdministraciÃƒÂ³n de discos.\n&gt;&gt; ADVERTENCIA! Si en lugar de flash para indicar la unidad del sistema, entonces su MBR se cambiarÃƒÂ¡ y el sistema se carga con mÃƒÂ¡s tiempo.\n3) escribir la imagen al palo - ejecutar Ghost32.exe haga clic en Aceptar y, a continuaciÃƒÂ³n Local - Disco - A partir de la imagen, busque el archivo &quot;ImageFAT32.GHO&quot; o &quot;ImageNTFS.GHO&quot; (aquellos que creen que la unidad de flash y la &quot;madre&quot; trabajarÃƒÂ¡ con NTFS ), haga clic en su unidad flash (lo encontrarÃƒÂ¡ en tamaÃƒÂ±o), haga clic en Aceptar, en Aceptar de nuevo, a continuaciÃƒÂ³n, SÃƒÂ­ - el proceso ha comenzado. &gt;&gt; DespuÃƒÂ©s haga clic en Sontinue y cerrar el programa.\n&gt;&gt; USB Flash Drive estÃƒÂ¡ listo!\n\nRequisitos del sistema:\nProcesador de 300 MHz o superior\nRAM 128 MB de RAM o superior\nEspacio libre en el disco duro de 5 GB\n\n\n","torrent":{"xt":"urn:btih:dc0649a7584ec102402e875fc24acd8e4397cf1f","amp;dn":"Live+USB+v.5.0+%282011%29+FAT32+%26+NTFS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0649a7584ec102402e875fc24acd8e4397cf1f","infoHashBuffer":{"type":"Buffer","data":[220,6,73,167,88,78,193,2,64,46,135,95,194,74,205,142,67,151,207,31]},"announce":[],"urlList":[]}}