{"title":"STARGATE.SG-1.S06E05-08.SWESUB. -Lindoff.ISO","uid":5787976,"size":2712033280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dcaa754e1c9df73b0b77f11208427be1bad5f50c&amp;dn=STARGATE.SG-1.S06E05-08.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1282725226,"description":"Season 6, Episode 5: Nightwalkers\n\nA scientist named Fleming contacts SG-1. It seems the work of Immunotech has not \n\nstopped. The investigation carries SG-1 to a town in Oregon whose citizens lead \n\ncurious double lives - right under the watchful eye of the NID. But all is not as \n\nit appears in a number of ways, and SG-1 must work quickly to prevent the NID's \n\nsecret project from becoming a disaster for Earth.\n\t\n\n\nSeason 6, Episode 6: Abyss\n\nHealed after being nearly killed by an Ancient virus, O'Neill finds himself held \n\ncaptive on a planet controlled by the Goa'uld Ba'al. O'Neill was brought here by \n\nthe Tok'Ra symbiote that healed him and Ba'al wants to know why. When O'Neill can \n\nnot give him an answer, he soon finds himself being tortured by Ba'al. As Carter, \n\nTeal'c and Jonas Quinn attempt to go through the Tok'ra records to find out where \n\nO'Neill was sent by the symbiotic, O'Neill is killed and brought back to life many \n\ntimes by Ba'al and his only hope to keep his sanity comes in the form of the \n\nascended Daniel Jackson.\n\t\n\n\nSeason 6, Episode 7: Shadow Play\n\nJonas Quinn's mentor, Dr. Keiran, visits Earth with the leader of Kelowna and an \n\nambassador. Tensions are escalating and they see no alternative but to build and \n\nuse a nahquadria bomb - a weapon of cataclysmic effect and long term consequence. \n\nStargate Command is faced with giving them superior weapons or &quot;forcing&quot; them to \n\nuse a deadly device. But Dr. Keiran might have an alternative - a mysterious \n\nunderground only he can contact who can overthrow the government and bring peace - \n\nif that government doesn't find them first, and if Keiran is telling the truth...\n\t\n\n\nSeason 6, Episode 8: The Other Guys\n\nTold from the point of view of a stereo-typical scientist, Jay Felger (in love \n\nwith SG-1). While on a standard science &quot;baby-sitting&quot; mission, SG-1 is captured \n\nby Khonsu (who is secretly Tok'Ra) in order to relay information about Anubis. \n\nFelger and fellow scientist, Simon Coombs disobey O'Neill's order to return to SGC \n\nand sneak onto Khonsu's ship. Khonsu's head Jaffa, Her'ak turns on Khonsu and \n\nkills him, keeping SG-1 to turn over to Anubis in the process. Felger and Coombs, \n\nmanage to help SG-1 escape and return to the SGC.","torrent":{"xt":"urn:btih:dcaa754e1c9df73b0b77f11208427be1bad5f50c","amp;dn":"STARGATE.SG-1.S06E05-08.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcaa754e1c9df73b0b77f11208427be1bad5f50c","infoHashBuffer":{"type":"Buffer","data":[220,170,117,78,28,157,247,59,11,119,241,18,8,66,123,225,186,213,245,12]},"announce":[],"urlList":[]}}