{"title":"Midnight on the Mavi Marmara - Attack on Gaza Flotilla","uid":5802367,"size":1110978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcd701aa2ae1fd4cbe9ef39d93c3624a43ed09ca&amp;dn=Midnight+on+the+Mavi+Marmara+-+Attack+on+Gaza+Flotilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SmoothWeiner","files":1,"time":1283302612,"description":"**Please do not waste your time arguing politics or attacking whatever group you hate in the comments. It's just boring. Instead upload your own torrents of media advocating your own view of the world. Then the rest of us can read it and decide you really are nuts.**\n\nBook desciption:\n\nPDF, high quality.\n\nPublished by O/R Books, an independent publisher that sells directly online. Support them by buying this and other books from them directly. The more books they sell like this one, the more they will be able to publish other books reporting the truth about Israeli occupation. (Look for another book from O/R on tpb, Norman Finkelstein's This Time We Went Too Far on, an excellent examination of the most recent Gaza massacre.)\n\nOther ebook formats are available from the publisher website (epub, prc, mobi).\n\nBlurb:\n\nEastern Mediterranean, Monday, May 31st, 2010, 4.30am: Israeli commandos, boarding from sea and air, attack the six boats of the Gaza Freedom Flotilla as it sails through international waters bringing humanitarian relief to the beleaguered Palestinians of Gaza.  Within minutes, nine peace activists are dead, shot by the Israelis. Scores of others are injured.  The 700 people on board the ships are arrested before being transported to detention centers in Israel and then deported.\n\nWithin hours, outrage at Israel's action echoes around the world. Spontaneous demonstrations in Europe, the United States, Turkey, and Gaza itself denounce the attack.  Turkey's prime minister describes it as a &quot;bloody massacre&quot; and &quot;state terrorism.&quot; Lebanon's prime minister calls it &quot;a dangerous and crazy step that will exacerbate tensions in the region.&quot;\n\nIn these pages, a range of activists, journalists, and analysts piece together the events that occurred that May night, unpicking their meanings for Israel's illegal, three-year-long blockade of Gaza and the decades-long Israel/Palestine conflict more generally. Mixing together first-hand testimony, documentary record, and illustration, with hard-headed analysis and historical overview, Midnight on the Mavi Marmara reveals why the attack on Gaza Freedom Flotilla may just turn out to be Israel's Selma, Alabama: the beginning of the end for an apartheid Palestine.\n\nCONTRIBUTORS: Ali Abunimah, Eyad Al Sarraj, Lamis Andoni, Omar Barghouti, George Bisharat, Max Blumenthal, Noam Chomsky, Marsha B. Cohen, Juan Cole, Murat Dagli, Jamal Elshayyal, SÃƒÂ¼meyye Ertekin, Norman Finkelstein, Neve Gordon, Glenn Greenwald, Arun Gupta, Amira Hass, Nadia Hijab, Adam Horowitz, Rashid Khalidi, Stephen Kinzer, Iara Lee, Henning Mankell, Paul Larudee, Gideon Levy, Alia Malek, Lubna Masarwa, Mike Marqusee, Yousef Munayyer, Ken O'Keefe, Daniel Luban, Kevin Ovenden, Ilan PappÃƒÂ©, Doron Rosenblum, Sara Roy, Ben Saul, Adam Shapiro, Raja Shehadeh, Henry Siegman, Ahdaf Soueif, Raji Sourani, Richard Tillinghast, Alice Walker, Stephen M. Walt, Philip Weiss, and Haneen Zoabi.\n\nOh, and one more thing:\n\nSEED!!","torrent":{"xt":"urn:btih:dcd701aa2ae1fd4cbe9ef39d93c3624a43ed09ca","amp;dn":"Midnight+on+the+Mavi+Marmara+-+Attack+on+Gaza+Flotilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd701aa2ae1fd4cbe9ef39d93c3624a43ed09ca","infoHashBuffer":{"type":"Buffer","data":[220,215,1,170,42,225,253,76,190,158,243,157,147,195,98,74,67,237,9,202]},"announce":[],"urlList":[]}}