{"title":"Disco Ball Murder Kit","uid":6491214,"size":423709098,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dee54f9c06b0845e189460d1f4589ab23998b7c1&amp;dn=Disco+Ball+Murder+Kit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Paranoia187","files":5,"time":1308895498,"description":"DISCO BALL MURDER KIT ARE &quot;SUPERSTAR&quot; DJ ED:E ARMAND AND JACK &quot;THE IRISH HAMMER&quot; MCDEVITT.\n\n\nAfter over 25 years between them of individual assaults on the New England club, rave and after hour scenes, Armand and McDevitt have joined forces to team up as, what will prove to be, one of the most notorious party style house music duos ever!\n\nFor those of you new to the DBMK, you may have noticed some of the rioting they have caused in the New England club scene lately. Before that, though, both Jack and Ede have held it down for almost 15 years each. They have done it all and have played in front of more people than most but... who fucking cares.\n\n\nJack and Ede paired up with an unspoken common belief that the &quot;scene&quot; was LAME. People were forgetting about the PARTY. They could care less about all this scenester bullshit and pretentious, trainspotting dj's. They want to party with MURDER KIDS just like THEM. Cats that LOVE HOUSE MUSIC who LOVE to PARTY and like to smash crap while they are doing it. DBMK want every party they do to have a memorable moment and the next one to be better than the last. They want to party with YOU. DBMK promise nothing but decadence and deca-dance! If you get their jokes, if you like stomping house, if you like to party, if you are a hot chick who likes to sweat under the electric sky of the dancefloor then, you are a MURDER KID. Others may dance but Murder Kids RIOT!!","torrent":{"xt":"urn:btih:dee54f9c06b0845e189460d1f4589ab23998b7c1","amp;dn":"Disco+Ball+Murder+Kit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee54f9c06b0845e189460d1f4589ab23998b7c1","infoHashBuffer":{"type":"Buffer","data":[222,229,79,156,6,176,132,94,24,148,96,209,244,88,154,178,57,152,183,193]},"announce":[],"urlList":[]}}