{"title":"kemialliset ystÃƒÂ¤vÃƒÂ¤t - lumottu karkkipurkki 256 VBR","uid":5764435,"size":57285773,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df84a4825219e117ce5b968db7d7f84ac0095a65&amp;dn=kemialliset+yst%C3%83%C2%A4v%C3%83%C2%A4t+-+lumottu+karkkipurkki+256+VBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webwebster","files":15,"time":1281837908,"description":"From Aquarius Records:\n\nImagine sitting somewhere deep in the forest... not alone with nature though. No, you're hanging out with a bunch of elves and trolls, drinking or smoking pot or something delinquent like that. Actually this isn't even that foresty really... maybe you've invited your little friends back to the city and you're hanging out in your apartment listening to weird '80s industrial experimental music and electronic krautrock records. And maybe you've got a few of these records going on several turntables at once, at 16 rpm, the volume turned down low, and some of the trolls are joining in (faintly) on vocals, and one of them's got a flute, and another one's got a broken music box, and some bells, and a shortwave radio. But the music you're hearing/making is still amazingly nice and mellow and organic 'cause you're with a bunch of elves after all. The sun's going down and the light is fading and you feel all warm and toasty and kinda sleepy-drunk.\nOk, stop imagining. You'll have your own (better) mental images to go along with this music when you hear it. But we'll say that right from the get-go this is immediately some of the rawest, most primitively-electronic Kemialliset Ystavat stuff we've heard. There's what what sounds like layers of loops, tape machine fuckery, all kinds of pleasingly distorted textures folded into a mysterious and still somewhat (abstractly) melodic sound-world, with haunting eerie vocals and tribal clink-clank. And yet, among the 15 tracks here you'll find some of the simplest and prettiest of the Kemialliset canon too. Loose, lovely and loveable stuff. \n\nTrack list:\n\n1. Lumottu karkkipurkki  \t \n2. MetsÃƒÂ¤ \t\n3. Afrikka \t\n4. Systeemi 1 \t\n5. Aaveet \t\n6. Systeemi 6 \t\n7. Linna \t\n8. Systeemi 9 \t\n9. Sumusaha \t\n10. Puutos \t\n11. Sininen maa \n12. Aasia \t\n13. Systeemi 4 \t\n14. Karkit \n15. Aarre\n\n@ 256 kbps VBR","torrent":{"xt":"urn:btih:df84a4825219e117ce5b968db7d7f84ac0095a65","amp;dn":"kemialliset+yst%C3%83%C2%A4v%C3%83%C2%A4t+-+lumottu+karkkipurkki+256+VBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df84a4825219e117ce5b968db7d7f84ac0095a65","infoHashBuffer":{"type":"Buffer","data":[223,132,164,130,82,25,225,23,206,91,150,141,183,215,248,74,192,9,90,101]},"announce":[],"urlList":[]}}