{"title":"Shangri-La (TÃƒÂ´genkyÃƒÂ´) 2002 [104m Takashi Miike] avi -","uid":6319137,"size":1476747620,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dfc118f880c7d3f8bfc0761cc6f651bbddf3926e&amp;dn=Shangri-La+%28T%C3%83%C2%B4genky%C3%83%C2%B4%29+2002+%5B104m+Takashi+Miike%5D+avi+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":5,"time":1302804412,"description":"Shangri-La (2002)\nDir. Takashi Miike\nKin'yÃƒÂ» hametsu Nippon: TÃƒÂ´genkyÃƒÂ´ no hito-bito (original title) \n\nInfo\n-----\nVery rare Avi rip of Russian ISO, which is only available on one site with it's custom English subtitles.\n\n\nFilm Synopsis\n--------------\n&quot;Shangri-La&quot; follows the lives of a group of homeless people in Japan who run into a man who nearly commits suicide and decide to help him out of his financial troubles. Using their various ingenious resources they embark on a complex scheme to blackmail a crooked businessman, whose bankruptcy claim has put people out of work. It's a fun romp as these seemingly homeless people manage to outsmart the very people who cast them from society. Miike knows enough not to over explain his characters or to drop the plot in emotional syrup and knows to keep things tight and moving along briskly to its inevitable conclusion.\n\n&quot;Shangri-La&quot; is a welcome addition to Miike's filmography but hardly indicative of his work. First timers should start with &quot;Fudoh&quot; or &quot;Visitor Q&quot;, but those looking for something completely familiar need look no further.\n\n\nDVD Details\n------------\n\nThe Russian DVD was uploaded by aqr1278. lordretsudo stripped the Russian overdub audio track and some unrelated Russian extras, and added custom English subtitles. lordretsudo ripped these from a rare screener provided by ADC's screener king, Ikeda69. The film was only ever screened at a couple of festivals with subtitles, so a big thanks to him!\n\nEnjoy this rare 'missing' Miike, from a time when he still made good films (i.e. pre-2004). His more recent films have not been to my taste at all, but this is a nice reminder of those short few years when Miike was the most exciting, unpredictable (and prolific) director on the planet. Plus, there's Sho Aikawa in an afro wig and shades.\n\nOriginal DVD ISo can be found on Asian DVD Club.","torrent":{"xt":"urn:btih:dfc118f880c7d3f8bfc0761cc6f651bbddf3926e","amp;dn":"Shangri-La+%28T%C3%83%C2%B4genky%C3%83%C2%B4%29+2002+%5B104m+Takashi+Miike%5D+avi+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc118f880c7d3f8bfc0761cc6f651bbddf3926e","infoHashBuffer":{"type":"Buffer","data":[223,193,24,248,128,199,211,248,191,192,118,28,198,246,81,187,221,243,146,110]},"announce":[],"urlList":[]}}