{"title":"Democracy Now - 20 apr 2011","uid":6332000,"size":445699611,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dfe74ab7276b2b0b75ed00c758d6f506bbbde974&amp;dn=Democracy+Now+-+20+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1303318083,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 20, 2011\n\n- France, Britain Plan To Send Troops To Libya\n- Syrian Ends Emergency Rule Amid Violent Crackdown\n- Japan Considers Banning Residents From Area Near Damaged Nuclear Plant\n- Bradley Manning Moved To Ft. Leavenworth Prison\n- Obama Backs Lifting Cap on Social Security Taxes\n- Michigan Pension Boards Sue Governor Rick Snyder Over New Law\n- Human Rights Watch: International Community Ignores Saudi Crackdown On Dissidents\n- Report: 846 Egyptian Civilians Killed in Uprising\n- Yemen: U.N. Fails To Agree To Act Amid Continuing Violence\n- Two Militants Suspected In Italian Activist Murder Killed In Hamas Raid\n- U.S. Approves First Offshore Wind Farm\n\n\nSpecial reports\n\n- &quot;A Sea In Flames&quot;: Ecologist Carl Safina on First Anniversary of Deepwater Horizon Oil Blowout\n\nToday marks the one-year anniversary of the worst maritime oil spill in U.S. history. Last year on April 20, the Deepwater Horizon rig, leased by oil giant BP, exploded in the Gulf of Mexico, killing 11 workers and releasing nearly 200 million gallons of oil, tens of millions of gallons of natural gas and 1.8 million gallons of other chemicals. A year later, how much has changed? &quot;[Another spill] could happen tomorrow and the response would be just as bad,&quot; says Carl Safina, author of the new book, &quot;A Sea in Flames.&quot; Safina reviews BP, Halliburton and TransOcean's role in the disaster and reflects on how little the government has done to prepare for another offshore drilling accident.\n\n\n- Voices From the Gulf: &quot;One Year Later, We're In The Same Situation As Last Year&quot;\n\nOne year after the BP Deepwater Horizon oil rig blowout in the Gulf of Mexico, residents of affected coastal communities have reported health ailments such as severe coughing, migraines and irritations that are consistent with common symptoms of chemical exposure. Fishermen and shrimpers have reported record losses in sales and fear the spill will cause long-term damage to marine life and the economy of the region. Many residents report problems with receiving compensation claims from BP. We're joined by David Pham of Boat People SOS, a national Vietnamese American organization working with fishing communities impacted by the BP oil spill in Alabama. We also speak with Tracie Washington, president of the Louisiana Justice Institute in New Orleans.\n\n\n- Deepwater Drilling Resumes Despite Unclear Impact of BP Spill: &quot;It Is All About Hiding The Oil, Not Cleaning It Up&quot;\n\nMany scientists remain concerned that chemical dispersants used during the BP oil spill recovery effort may have damaged marine habitats, affecting many endangered species. &quot;You have this unbelievable chemical soup out there on the order that has never been seen before,&quot; says our guest, Kieran Suckling, director of the Center for Biological Diversity. Meanwhile, the federal government has awarded its first permit for deepwater drilling in the Gulf of Mexico since lifting a moratorium imposed in the aftermath of the BP spill.\n\n\n- Death Toll From BP Spill Still Rising As Residents Die From Spill-Related Illnesses\n\n&quot;We have already had many deaths of humans directly attributed to this disaster,&quot; says investigative journalist Dahr Jamail. &quot;I recently spoke to Dr. Mike Robichaux, a doctor in Louisiana who has treated scores of people, and he said if we do not have federal government intervention immediately to deal with this and start treating people and really start cleaning this up appropriately we are going to have a lot of dead people on our hands.&quot;\n\n\n- Father of Deepwater Horizon Victim: The Blowout Was &quot;Inevitable&quot; Due to BP's Lack of Safety Precautions\n\nOne year ago today, 28-year-old Gordon Jones was one of 11 workers killed aboard the Deepwater Horizon oil rig that exploded April 20. Today we speak to his father, Keith Jones, who has been critical of the operators of the rig. &quot;BP, Halliburton, TransOcean peeled back layer after layer after layer of safety protections, one after another, until this blowout was inevitable,&quot; says Keith Jones.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:dfe74ab7276b2b0b75ed00c758d6f506bbbde974","amp;dn":"Democracy+Now+-+20+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe74ab7276b2b0b75ed00c758d6f506bbbde974","infoHashBuffer":{"type":"Buffer","data":[223,231,74,183,39,107,43,11,117,237,0,199,88,214,245,6,187,189,233,116]},"announce":[],"urlList":[]}}