{"title":"John E. Mack, M.D. Dreamland with Whitley Strieber","uid":5800258,"size":32038764,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e0861e81e6d6ea4fad575603d54b6f037bdfab12&amp;dn=John+E.+Mack%2C+M.D.+Dreamland+with+Whitley+Strieber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"John_E_Mack_Institute","files":3,"time":1283250282,"description":"Whitley Strieber on Dreamland with Dr. John Mack\nSunday November 14, 1999\n\n&quot;After I wrote Communion, I experienced what it was like to be a pariah and a national laughingstock. I had the experience of going on Larry King's show, sitting two feet away from Larry, and having him laugh in my face in front of his two million viewers. It was hideous, it was agony. Then Dr. John Mack - M.D., Harvard professor, Pulitzer Prize winner - suddenly did something so extraordinary and so brave it changed my life, Budd Hopkins' life, and the lives of everyone who had ever had a close encounter experience and was agonizing over it in one way or another. The derision ended. People began to take another look at this. They began to say, 'hey, maybe there's something in it.' John Mack went to the wall for this. He nearly lost his license, he nearly lost tenure, he nearly ended up on the street without a career, without a job. All on behalf on the fact that there is something extraordinary about the abduction experience. Tonight we're going to have a conversation with a real hero. A hero of science, an American hero. When we come back, my hero, Dr. John Mack. This is Whitley Strieber, it's Dreamland.&quot;\n\nmp3, 1hr, 64kbps*\n\n*Sourced from a low-bitrate stream, and Dr. Mack is participating via telephone. As such the sound quality is poor. Minor noise reduction and equalization has been applied to upgrade the sound as much as possible given the limitations of the original source.\n\nTranscript pdf included.","torrent":{"xt":"urn:btih:e0861e81e6d6ea4fad575603d54b6f037bdfab12","amp;dn":"John+E.+Mack%2C+M.D.+Dreamland+with+Whitley+Strieber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0861e81e6d6ea4fad575603d54b6f037bdfab12","infoHashBuffer":{"type":"Buffer","data":[224,134,30,129,230,214,234,79,173,87,86,3,213,75,111,3,123,223,171,18]},"announce":[],"urlList":[]}}