{"title":"Yars Revenge [MULTI3][SKIDROW] sneak_shot","uid":6336156,"size":497030154,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e0c76caf8ec6cb3753346e4be55ad1763cecf540&amp;dn=Yars+Revenge+%5BMULTI3%5D%5BSKIDROW%5D+sneak_shot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sneak_shot","files":14,"time":1303430460,"description":"presenting sneak _ shot\n\n\nrelease date:21-4-2011\n\ndiscription:\n\nYars' Revenge is a video game developed for the Atari 2600 in 1981. It was created by Howard Scott Warshaw, who also wrote the 2600 titles Raiders of the Lost Ark and the much-derided E.T. the Extra-Terrestrial. Yars' Revenge was Atari's best selling original title for the 2600.\n\n\nThe game began as a licensed port of the Cinematronics arcade game Star Castle. In the original game, a powerful cannon is protected by three layers of counter-rotating shields. The player must shoot holes in these shields in order to destroy the cannon inside. But once these holes are made, the cannon can also shoot out at the player. If the outermost layer is completely destroyed, new layers of shields are grown. Harassing the player are two free roaming torpedoes that hunt out the player's ship.\n\n\n\nAs the Atari version grew, change after change was introduced until the final product had very little resemblance to the original. In this game, the hero (a Yar) is an insect-like creature who must nibble or shoot through a barrier in order to fire his &quot;Zorlon Cannon&quot; into the breach and destroy the evil Qotile, which exists on the other side of the barrier. The Qotile can shoot at the Yar even if the barrier is undamaged, by turning into the &quot;Swirl&quot; - fortunately, the player is warned before the shot is fired, and he can retreat to a safe distance to dodge the enemy's energy blast. Also in the game is a safe area, &quot;the neutral zone&quot;, where the pursuing enemy torpedo cannot harm him (although the Swirl can). The Yar cannot shoot from within the neutral zone.\n\n\n","torrent":{"xt":"urn:btih:e0c76caf8ec6cb3753346e4be55ad1763cecf540","amp;dn":"Yars+Revenge+%5BMULTI3%5D%5BSKIDROW%5D+sneak_shot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0c76caf8ec6cb3753346e4be55ad1763cecf540","infoHashBuffer":{"type":"Buffer","data":[224,199,108,175,142,198,203,55,83,52,110,75,229,90,209,118,60,236,245,64]},"announce":[],"urlList":[]}}