{"title":"Jurassic Park(1993)DVDRip.AC3(ENG)-DROCK","uid":6504162,"size":731979656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0ce5c596133fe41d057622b7bbf356299245bbd&amp;dn=Jurassic+Park%281993%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1309364666,"description":"Steven Spielberg's phenomenally successful sci-fi adventure thriller is graced by state-of-the-art special effects from the team of Stan Winston, Phil Tippett and Michael Lantieri from George Lucas's Industrial Light &amp; Magic. The film follows two dinosaur experts -- Dr. Alan Grant (Sam Neill) and Dr. Ellie Sattler Laura Dern) -- as they are invited by eccentric millionaire John Hammond (Richard Attenborough) to preview his new amusement park on an island off Costa Rica. By cloning DNA harvested from pre-historic insects, Hammond has been able to create living dinosaurs for his new Jurassic Park, an immense animal preserve housing real brachiosaurs, dilophosaurs, triceratops, velociraptors, and a Tyrannosaur Rex. Accompanied by cynical scientist Ian Malcolm (Jeff Goldblum), who is obsessed with chaos theory, and Hammond's two grandchildren (Ariana Richards and Joseph Mazzello), they are sent on a tour through Hammond's new resort in computer controlled touring cars. But as a tropical storm hits the island, knocking out the power supply, and an unscrupulous employee (Wayne Knight) sabotages the system so that he can smuggle dinosaur embryos out of the park, the dinosaurs start to rage out of control. Grant then has to bring Hammond's grandchildren back to safety as the group is pursued by the gigantic man-eating beasts. \n\nRipped with Handbrake.\n\nLength: 2 Hours 7 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:e0ce5c596133fe41d057622b7bbf356299245bbd","amp;dn":"Jurassic+Park%281993%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ce5c596133fe41d057622b7bbf356299245bbd","infoHashBuffer":{"type":"Buffer","data":[224,206,92,89,97,51,254,65,208,87,98,43,123,191,53,98,153,36,91,189]},"announce":[],"urlList":[]}}