{"title":"Autosport Magazine UK 29/07/2010","uid":5765791,"size":86736627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e264cf7ed92afa3ae06fc876ba5393488b310b5b&amp;dn=Autosport+Magazine+UK+29%2F07%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thorhammer2000","files":-1,"time":1281896835,"description":"NEWS\n10 Ferrari faces further hit. More punishment likely as team orders row rumbles on\n12 Renault finances in focus. Doubts raised after early request for TV revenue\n14 Flexi-wings are cleared. FIA gives okay to Ferrari's and Red Bull's front aero\n17 David Coulthard column\n18 Hungarian GP preview\n24 IndyCar under fire. Blocking rules criticised after Castroneves stripped of win\n26 Lotus plans GT2 assault. Evora sized up for ambitious Le Mans campaign in 2012\n29 Grosjean quick on return. Ex-Fl driver impresses in one-off GP2 drive with DAMS\n31 NASCAR to spice up show. Key changes considered to boost excitement of Chase\n32 Mini guns for ralIy glory. Prodrive plans '11 WRC debut\n\nREPORTS\n34 German Grand Prix. Team orders gift Alonso controversial victory\n46 GP3 Hockenheim. Wickens and Gutierrez on top in GP-support crashfest\n51 Porsche Supercup. Series regulars shown the way home by Nicolas Armindo\n51 Formula BMW Europe. Frijns misses out on perfect weekend double\n52 GP2 Hockenheim. Maldonado wins again, but Perez still in striking distance\n54 IndyCar Series Edmonton. Dixon takes flag as stewards deny Castroneves a victory\n57 World of Sport. NASCAR Sprint Cup; European Touring Car Cup; American Le Mans Series; Superstars; Indy Lights\n\nFEATURES\n93 Photofinish. &quot;A monkey could have won in my car,&quot; says Jochen Rindt after taking his fourth consecutive victory in the innovative Lotus 72 at Hockenheim in 1970\n\nSPORTS EXTRA\n71 Turner's Brit GT debut. Darren Turner signs up for Aston outing with Beechdean\n72 Fix for rollhoop failure. Formula Renault 2.0 cars to get reinforced safety feature\n74 Plug pulled on Phoenix. Annual Irish event canned over poor competitor interest\n76 Reports. Silverstone Classic; Oulton Park MSVR; Cadwell Park CSCC; Snetterton BRSCC; Wiscombe British Hillclimb; Mallory Park MSCC; Pembrey VSCC; Knockhill SMRC; Kirkistown 500MRCI\n\nREGULARS\n94 Race of my life. Derek Bell. Barcelona F2, 1970\n\nOCR'd with Acrobat Pro 8.2","torrent":{"xt":"urn:btih:e264cf7ed92afa3ae06fc876ba5393488b310b5b","amp;dn":"Autosport+Magazine+UK+29%2F07%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e264cf7ed92afa3ae06fc876ba5393488b310b5b","infoHashBuffer":{"type":"Buffer","data":[226,100,207,126,217,42,250,58,224,111,200,118,186,83,147,72,139,49,11,91]},"announce":[],"urlList":[]}}