{"title":"WisBar Advance Version. 4.0.3 (Build 14) For The Pocket PC","uid":5812184,"size":23417798,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:e297d96e14a0fbb41978266a0bfd5807dc9e809c&amp;dn=WisBar+Advance+Version.+4.0.3+%28Build+14%29+For+The+Pocket+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxThugxx","files":-1,"time":1283646630,"description":".\n\n                          *******   *    *  *     *   *****\n                             *      *    *  *     *   *\n                             *      ******  *     *   *\n                             *      *    *  *     *   * ****\n                             *      *    *  *     *   *    *\n                             *      *    *  *******   ******\n\n\n\n\n                          WisBar Advance Version. 4.0.3 (Build 14)\n\n\n                                                              \n                                                             \nIncluded in WisBar Advance is the ability to customize your running applications to a degree not seen in other programs.\n\nWith the ability to close apps, WisBar Advance keeps your device running as fast as possible, leaving more memory available for any application you may use.\n\nWisBar Advance also brings new life to your Windows Mobile phone with the ability to change the appearance of your system to a degree not matched in other software.\n\n\nFeatures:\n\n\n* Compatible with WM2003, WM2003SE, WM5 and WM6, WM6.5 and WM6.5.1 touchscreen devices\n* Customize the close button, the screen orientation and the SIP on a per-application basis\n* Switch between any application currently running on your device\n* Provides a finger-friendly start panel or a cascading start menu\n* Tap and hold the OK button to cancel a dialog\n* Add or remove functions to the status bar\n* Each button on the status bar can be assigned a tap and a tap-and-hold action\n* Place shortcuts in the system tray for easier access from the Today screen\n* Customize a &quot;User Menu&quot; with applications of your choosing\n* Change the appearance of the status bar, menubar, buttons and start menu in any program\n* Supports all resolutions through the use of themes\n* Customize the clock's appearance on the taskbar\n* Hear sounds for system events, just like on your desktop\n* Download and install themes created by other people\n* Provides finger-friendly menus and message boxes\n* Switch between running apps using thumbnails of each app\n\nVersion 4.0.3 build 14: \n\n\n* Fixed a bug where you couldn't customize the background of the taskbar or softkey bar.\n* Improved the 128-dpi theme.\n* Fixed a bug in the task panel where the large icons were used instead of the small icons.\n* Fixed a bug in the task panel where the item width was not determined by the largest font.\n* Fixed a bug in the new task panel where the screenshots didn't update properly.\n* Added a permanent exception to the finger friendly menus for Pocket Informant.\n* Added an option to the start menu settings to toggle the start menu button between the cascading start menu and the start panel.\n","torrent":{"xt":"urn:btih:e297d96e14a0fbb41978266a0bfd5807dc9e809c","amp;dn":"WisBar+Advance+Version.+4.0.3+%28Build+14%29+For+The+Pocket+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e297d96e14a0fbb41978266a0bfd5807dc9e809c","infoHashBuffer":{"type":"Buffer","data":[226,151,217,110,20,160,251,180,25,120,38,106,11,253,88,7,220,158,128,156]},"announce":[],"urlList":[]}}