{"title":"Democracy Now - 15 jun 2011","uid":6472050,"size":447038148,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e2b9b36108edc5651067ee544a05706521aceb12&amp;dn=Democracy+Now+-+15+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1308175685,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 15, 2011\n\n- Wisconsin Supreme Court Reinstates Anti-Union Law\n- Report: CIA Builds Mideast Base for Yemen Drone Strikes\n- Rebels Advance in Libya; House Votes to Cut Funding\n- Pakistan Arrests CIA Informants\n- Syria Expands Crackdown to 2 Towns\n- Gaza Strip Unemployment at Record High as Blockade Enters 5th Year\n- 2 U.S. Soldiers Killed in Iraq\n- Obama Makes Brief Puerto Rico Visit\n- Admin Presses Congress on Debt Limit\n- Ex-Utah Gov. Huntsman Enters GOP Race\n- Ex-Blackwater Operative Sentenced for Afghan Killing\n- Federal Judge Upholds Reversal of California Gay Marriage Ban\n- New Yorkers Erect &quot;Bloombergville&quot; Tent Camp Against Budget Cuts\n- Amazonian Land Rights Activist Slain in Brazil\n\n\nSpecial reports\n\n- In Nod to Latino Voters, Obama Makes Historic Visit to Puerto Rico Ahead of 2012 Elections\n\nOn Tuesday, President Obama became the first sitting U.S. president to visit Puerto Rico in a half century. His trip underscored the growing importance that Puerto Ricans will play in the 2012 U.S. elections. Although Puerto Ricans living on the island cannot vote for president, there are about 4.6 million Puerto Ricans living in the 50 states, including an estimated 857,000 in the battleground state of Florida. We speak with University of Puerto Rico professor Maritza Stanchich about reaction to Obama's visit amidst the island's slumped economy, and violent police repression of student protests against tuition hikes.\n\n\n- New Report: U.S. Encouraged Gun Sales to Drug Cartels, 70% of Seized Mexico Guns Are from U.S.\n\nSome 70 percent of guns seized in Mexico from 2009 to 2010 came from the United States, according to a new report from three U.S. senators. The report finds Mexican drug cartels are arming themselves with U.S. military-style weapons and urges a strengthening of U.S. regulations to stem the flow of guns to Mexico. It comes as lawmakers are holding hearings into a once-secret government plan to encourage U.S. gun shops to sell thousands of guns to middlemen for Mexican drug cartels. The operation, called &quot;Fast and Furious,&quot; focused on using middlemen to gain access to senior-level figures within Mexico's criminal organizations. Run by the U.S. Bureau of Alcohol, Tobacco and Firearms, the operation has come under severe criticism since hundreds of the guns that were sold to the cartels were later found at crime scenes in both countries, including two at the murder scene of a U.S. Border Patrol agent. We speak to David Heath at the Center for Public Integrity.\n\n\n- Mexican Peace Caravan Arrives in U.S. to Call for End to Deadly Drug War Policy\n\nA caravan of Mexican anti-violence protesters arrived in the United States over the weekend calling for a massive shift in U.S. drug policy. Mexican poet Javier Sicilia led the Caravan for Peace with Justice and Dignity following the brutal murder of his 24-year-old son by drug traffickers earlier this year. The caravan's demands include an end to the Merida Initiative, in which the United States provides training and support for the Mexican army in its &quot;war on drugs.&quot; We speak to Laura Carlsen, director of the Americas Policy Program of the Center for International Policy, and play an excerpt from her interview with Sicilia as she traveled with him to document the caravan's journey.\n\n\n- CIA Building Secret Mideast Base to Launch Drone Attacks in Yemen\n\nThe CIA is building a secret air base in the Middle East to serve as a launching pad for armed drones to strike Yemen. Since December 2009, U.S. strikes in Yemen have been carried out by the U.S. military with intelligence support from the CIA. Now, the spy agency is preparing to carry out drone strikes itself alongside the military campaign. The Wall Street Journal reports the CIA, in coordination with Saudi Arabia, has been ramping up its intelligence gathering efforts in Yemen in recent months to support a sustained drone campaign. We speak with Gregory Johnsen, a former Fulbright Fellow in Yemen and now a graduate student in Near Eastern studies at Princeton University.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e2b9b36108edc5651067ee544a05706521aceb12","amp;dn":"Democracy+Now+-+15+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b9b36108edc5651067ee544a05706521aceb12","infoHashBuffer":{"type":"Buffer","data":[226,185,179,97,8,237,197,101,16,103,238,84,74,5,112,101,33,172,235,18]},"announce":[],"urlList":[]}}