{"title":"The Stevens Sisters-2 cd","uid":5786562,"size":141255771,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e3170c2ff3fc5a738e04e88ab92da32861e3168f&amp;dn=The+Stevens+Sisters-2+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flitigalisa","files":28,"time":1282659733,"description":"Beth and April Stevens compose the country duo the Stevens Sisters. They've been performing together since their early childhood, but made music their career during their early twenties. Growing up in a musical family in Tennessee also allowed the Stevens Sisters to explore various genres apart from traditional country. Their father, Douglas, was a fiddle player and encouraged the girls to pick up instruments. Beth Stevens was playing banjo by age 12, while April mastered the mandolin. The fiddle, upright bass, and additional string instruments came later, shaping the Stevens Sisters into a matured pair of musicians in the Stevens Family Band. In 1996, the pair released the crossover bluegrass album Sisters on Rounder. Two years later and free from family reign, the Stevens Sisters were opening shows for Waylon Jennings, Merle Haggard, and the neo-traditionalist country act BR5-49. Their second album, Little by Little, was released in 2002. This time around, the Stevens Sisters were seasoned and smart, allowing Little by Little to take on a sophisticated tone compared to their first record. ~ MacKenzie Wilson, Rovi ","torrent":{"xt":"urn:btih:e3170c2ff3fc5a738e04e88ab92da32861e3168f","amp;dn":"The+Stevens+Sisters-2+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3170c2ff3fc5a738e04e88ab92da32861e3168f","infoHashBuffer":{"type":"Buffer","data":[227,23,12,47,243,252,90,115,142,4,232,138,185,45,163,40,97,227,22,143]},"announce":[],"urlList":[]}}