{"title":"La Caverna Maldita [dvdrip] [spanish]","uid":5802741,"size":733745152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e33ab0c6ae148a9006286736ad22a9a438f11eb2&amp;dn=La+Caverna+Maldita+%5Bdvdrip%5D+%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":-1,"time":1283325162,"description":"DirecciÃƒÂ³n: Bruce Hunt.\nPaÃƒÂ­ses:\nAÃƒÂ±o: 2005.\nDuraciÃƒÂ³n: 97 min.\n\nGÃƒÂ©nero: AcciÃƒÂ³n, terror.\n\nInterpretaciÃƒÂ³n: Cole Hauser (Jack), Morris Chestnut (Top Buchanan), Eddie Cibrian (Tyler), Rick Ravanello (Briggs), Marcel Iures (Dr. Nicolai), Kieran Darcy-Smith (Strode), Daniel Dae Kim (Kim), Lena Headey (Kathryn), Piper Perabo (Charlie), Vlad Radescu (Dr. Bacovia).\nGuiÃƒÂ³n: Michael Steinberg y Tegan West.\nProducciÃƒÂ³n: Tom Rosenberg, Gary Lucchesi, Andrew Mason, Richard Wright y Michael Ohoven.\nMÃƒÂºsica: Johnny Klimek y Reinhold Heil.\nFotografÃƒÂ­a: Ross Emery.\nMontaje: Brian Berdan.\nDiseÃƒÂ±o de producciÃƒÂ³n: Pier Luigi Basile.\nVestuario: Wendy Partridge.\n\nSINOPSIS: En las profundidades del bosque rumano, un equipo de cientÃƒÂ­ficos se tropieza con las ruinas de una abadÃƒÂ­a del siglo XIII. Al realizar un reco-nocimiento mÃƒÂ¡s minucioso, hacen un descu-brimiento inesperado: la abadÃƒÂ­a estÃƒÂ¡ construÃƒÂ­-da sobre la entrada de un enorme sistema de cavernas subterrÃƒÂ¡-neas. Los biÃƒÂ³logos del lugar consideran que la caverna podrÃƒÂ­a alber-gar un nuevo ecosistema, por lo que contratan a un grupo nortea-mericano de exploradores de cavernas para que les ayuden a inves-tigarla en profundidad. Jack (Cole Hauser) y su hermano Tyler (Ed-die Cibrian) son unos exploradores profesionales de cavernas en constante bÃƒÂºsqueda de emociones, que dirigen un grupo integrado por los mejores submarinistas del mundo. De esta forma, llegan a RumanÃƒÂ­a con el equipamiento mÃƒÂ¡s sofisticado que existe, que cuenta entre sus haberes con un nuevo tanque submarino que les permite permanecer bajo el agua mÃƒÂ¡s de 24 horas. El excepcional grupo, del que tambiÃƒÂ©n forman parte Charlie (Piper Perabo) y Bu-chanan (Morris Chestnut), enseguida comienza la exploraciÃƒÂ³n; sin embargo, en las profundidades de la caverna no sÃƒÂ³lo encuentran un nuevo ecosistema, sino una especie completamente nueva...","torrent":{"xt":"urn:btih:e33ab0c6ae148a9006286736ad22a9a438f11eb2","amp;dn":"La+Caverna+Maldita+%5Bdvdrip%5D+%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e33ab0c6ae148a9006286736ad22a9a438f11eb2","infoHashBuffer":{"type":"Buffer","data":[227,58,176,198,174,20,138,144,6,40,103,54,173,34,169,164,56,241,30,178]},"announce":[],"urlList":[]}}