{"title":"Incendies.2010.DVDRip.FINSUB ","uid":6391157,"size":2839085056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3bb67c2bf7367d4d5709ebafb260421d70cb9d1&amp;dn=Incendies.2010.DVDRip.FINSUB+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFreddy420","files":-1,"time":1305363161,"description":"When notary Lebel (Remy Girard) sits down with Jeanne and Simon Marwan (Melissa Desormeaux Poulin, Maxim Gaudette) to read them their mother Nawal's will (Lubna Azabal), the twins are stunned to receive a pair of envelopes - one for the father they thought was dead and another for a brother they didn't know existed. In this enigmatic inheritance, Jeanne sees the key to Nawal's retreat into unexplained silence during the final weeks of her life. She immediately decides to go to the Middle East to dig into a family history of which she knows next to nothing. Simon is unmoved by their mother's posthumous mind games. However, the love he has for his sister is strong, and he soon joins her in combing their ancestral homeland in search of a Nawal who is very different from the mother they knew. With Lebel's help, the twins piece together the story of the woman who brought them into the world, discovering a tragic fate as well as the courage of an exceptional woman. An adaptation of Wajdi Mouawad's hit play, INCENDIES is a deeply moving story that brings the extremism and violence of today's world to a starkly personal level, delivering a powerful and poetic testament to the uncanny power of the will to survive.","torrent":{"xt":"urn:btih:e3bb67c2bf7367d4d5709ebafb260421d70cb9d1","amp;dn":"Incendies.2010.DVDRip.FINSUB+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3bb67c2bf7367d4d5709ebafb260421d70cb9d1","infoHashBuffer":{"type":"Buffer","data":[227,187,103,194,191,115,103,212,213,112,158,186,251,38,4,33,215,12,185,209]},"announce":[],"urlList":[]}}