{"title":"salix64-13.1.1.iso","uid":5757653,"size":585091072,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:e3ed6ebc919a4c0f0f3eec21f768f806412b8756&amp;dn=salix64-13.1.1.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1281574373,"description":"Hi everyone! It's time for a new Salix release! Here is Salix 13.1.1, using the XFCE desktop, available both in 32-bit and 64-bit flavours.\n\nHere is a list of changes since the previous release in the 13.1 branch:\n* Lilosetup, a new graphical tool that can be used for setting up the Lilo bootloader has been added.\n* New graphical system administration tools have been added; a tool to manage ALSA sound cards, one to manage system hostnames and a small tool to rebuild the system icon cache in XFCE. All salix system tools are now available in a &quot;basic&quot; installation too.\n* The installation CDs can now be used as a local repository with slapt-get/gslapt, complete with dependency support. Detailed instructions on how to do that can be found in the README file in the iso images. This will help users with no internet access that are performing &quot;core&quot; or &quot;basic&quot; mode installations and would like an easy way to install extra software found in a &quot;full&quot; mode installation.\n* The default start page in Firefox has been changed to: http://www.salixos.org/start\n* An older version of the intel driver (2.9.1) is included in the installation media in the salix/extra directory. This is not installed by default but might be of use with some intel graphics cards. You can read the README.intel file in the iso images for more details.\n* New packages included in a &quot;full&quot; mode installation: pyxdg, notify-python, libnl, net-snmp.\n* All security fixes and package upgrades since the previous release have been included.\n* Flash has been removed from the 64-bit release. Adobe has not updated their 64-bit flash plugin for the latest version and the previous version is a security hole. You can read more about the issue here: viewtopic.php?f=17&amp;t=921\n &lt;a href=&quot;\nhttp://www.salixos.org/forum/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.salixos.org/forum/&lt;/a&gt;\n\nmd5sum : b7b70c8427e987d6495e99a0adc75fb2  salix64-13.1.1.iso","torrent":{"xt":"urn:btih:e3ed6ebc919a4c0f0f3eec21f768f806412b8756","amp;dn":"salix64-13.1.1.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3ed6ebc919a4c0f0f3eec21f768f806412b8756","infoHashBuffer":{"type":"Buffer","data":[227,237,110,188,145,154,76,15,15,62,236,33,247,104,248,6,65,43,135,86]},"announce":[],"urlList":[]}}