{"title":"Star Wars - Tag and Bink (Dark Horse)","uid":5763155,"size":54608977,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e562d11fa8e2a96e197aa2d8cdb0cea624f1780b&amp;dn=Star+Wars+-+Tag+and+Bink+%28Dark+Horse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"brodahisou","files":-1,"time":1281744881,"description":"Tag and Bink are the Rosencrantz and Guildenstern of the Star Wars  universe, a pair of minor characters who deliberately or accidentally influence the events seen in the first and second film trilogies.  Their meddling also explains some of the inconsistent and illogical events of the series. \n\nOfficers Tag Greenley and Bink Otauna were minding their own business aboard a familiar, princess-harboring freighter when they suddenly found themselves under siege.  Now under attack by the Empire, they will choose life over a noble death and &quot;borrow&quot; the armor off a pair of deceased stormtroopers.  Their new disguises might get them off the freighter alive, but they'll also lead Tag and Bink on an adventure neither could have predicted! \n\nWritten by American filmmaker Kevin Rubio, best known for his Star Wars parody film Troops and illustrated by Lucas Marangon (Abyss).\n\nThis pack includes the scan of the trade paperback Tag and Bink Were Here which collects Star Wars: Tag and Bink Are Dead, Star Wars: The Return of Tag and Bink - Special Edition #1 and Star Wars: Tag and Bink - Revenge of the Clone Menace.  Also included is the short story The Revenge of Tag and Bink from Star Wars Tales #12.\n\n\nReleased on &lt;a href=&quot; http://ComicPirates.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ComicPirates.info&lt;/a&gt;","torrent":{"xt":"urn:btih:e562d11fa8e2a96e197aa2d8cdb0cea624f1780b","amp;dn":"Star+Wars+-+Tag+and+Bink+%28Dark+Horse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e562d11fa8e2a96e197aa2d8cdb0cea624f1780b","infoHashBuffer":{"type":"Buffer","data":[229,98,209,31,168,226,169,110,25,122,162,216,205,176,206,166,36,241,120,11]},"announce":[],"urlList":[]}}