{"title":"Naild OST","uid":6502883,"size":228857127,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e576a570b0fa58e7b74af90bce16ed350746772f&amp;dn=Naild+OST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"M0SHP1T","files":35,"time":1309315526,"description":"Heres the Information on this Soundtrack:\n\nIllustrious names from the contemporary Metal scene, including Raymond Herrera and Christian Olde Wolbers (Fear Factory, Arkaea), Pat Lachman (Damageplan), Wayne Static (Static X), Jamey Jasta (Hatebreed), Stephen Carpenter (Deftones), Jed Simon (Strapping Young Lad), and John Boecklin (DevilDriver), have got together in the studio to add a wicked soundtrack to the game. \nTogether, these musicians have created a rock-hard Metal soundtrack for nail'd. Besides various instrumentals, it includes three dedicated &quot;nail'd&quot; songs: &quot;Count for Something&quot;, &quot;Through Walls of Flame&quot; (sung by Jamey Jasta), and &quot;Decimator&quot; (vocals by Wayne Static). All lyrics were specially written for the game. \nIn addition, licensed tracks from Slipknot, Queens of the Stone Age, Backyard Babies, Rise Against, American Sixgun, Aggressive Chill, and Slaves on Dope help turn on the heat in nail'd even more.\n\n\nI looked all over the net no one posted this whole soundtrack up so I downloaded the game and uploaded it for you all.\n\nIts got some songs that aren't out on a cd anywhere from the singer of hatebreed and static-x along with members of the deftones and other bands.\nAn instant collectors Item I hope people can keep this alive.\n\nThis Bitrate is 320kbps..\n\nComment and SEED!!!","torrent":{"xt":"urn:btih:e576a570b0fa58e7b74af90bce16ed350746772f","amp;dn":"Naild+OST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e576a570b0fa58e7b74af90bce16ed350746772f","infoHashBuffer":{"type":"Buffer","data":[229,118,165,112,176,250,88,231,183,74,249,11,206,22,237,53,7,70,119,47]},"announce":[],"urlList":[]}}