{"title":"The Electric Light Orchestra - Showdown (2nafish)","uid":5798069,"size":148094980,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e5e577132184e6f765306db45826751fb3ce3125&amp;dn=The+Electric+Light+Orchestra+-+Showdown+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283155241,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Showdown&quot; is a song written by Jeff Lynne and recorded by the Electric Light Orchestra.\n\nIt was the band's last contemporary recording to be released on the Harvest label. In the US, the song was included on the album On The Third Day (1973), however in the UK the song was omitted from the album and would later be featured on their first compilation album , also called Showdown a year later instead. In 2006 the remastered issue of On the Third Day would feature the song on the album on both sides of the Atlantic for the first time.\n\nThe song was a change of pace for ELO, with a funkier backbeat. It was a favourite record of John Lennon's at the time, who dubbed them &quot;Son of Beatles&quot; in a US radio interview.\n\nJeff Lynne played the lead guitar part using Marc Bolan's Gibson Firebird guitar.\n\nOn the Third Day is the third studio LP by Electric Light Orchestra and the first to be recorded without any input from Roy Wood.\n\nElectric Light Orchestra (often abbreviated ELO) was a British rock group from Birmingham, who released eleven studio albums between 1971 and 1986 and another album in 2001. ELO was formed to accommodate Roy Wood and Jeff Lynne's desire to create modern rock and pop songs with classical overtones. After Wood's departure following the band's debut record, Lynne wrote and arranged all of the group's original compositions and produced every album.\n\nDespite early singles' success in the UK the band were initially more successful in the United States, billed as &quot;The English guys with the big fiddles&quot;. They soon gained a cult following despite lukewarm reviews back in their native United Kingdom. By the mid-1970s, they had become one of the biggest selling bands. From 1972 to 1986, ELO accumulated 27 Top 40 hit singles in both the UK and the US. The group also scored 20 Top 20 U.K. hit singles, as well as 19 Top 20 hit singles in the U.S. Billboard charts. The band also holds the record for having the most Billboard Hot 100 Top 40 hits of any band in US chart history without ever having a number one single.\n\nELO collected 21 RIAA awards, 38 BPI awards, and sold well over 50 million albums worldwide.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e5e577132184e6f765306db45826751fb3ce3125","amp;dn":"The+Electric+Light+Orchestra+-+Showdown+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5e577132184e6f765306db45826751fb3ce3125","infoHashBuffer":{"type":"Buffer","data":[229,229,119,19,33,132,230,247,101,48,109,180,88,38,117,31,179,206,49,37]},"announce":[],"urlList":[]}}