{"title":"Little Vamda virgin and upcoming porn supermodel WMV9","uid":5819055,"size":73820540,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e697669d4dccf04239da125503bea2cd96b00b6d&amp;dn=Little+Vamda+virgin+and+upcoming+porn+supermodel+WMV9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Theofiel","files":-1,"time":1283981427,"description":"Here i have a video of little Vamda,  she's extremely skinny and incredible sweet, she's fucking hot and the little blonde knows already, she likes to become a porn supermodel. Her young crack is still much to little to handle the masive cocks of guys like Ben English or a Shane Diesel. But things will change soon for her, now already she likes toys like small dildos deep upon her micro ass and pussy. Vamda is proud at her hairs, but she shaved her teen pussy already for us, because here in her first video by way of introducing herself she likes to show us the colour of it. Here you can watch a real virgin, no cocks came in her little ass or pussy, i may say i just can't wait until she gets 18 and to watch how a masive cock will stretch up her little slit for the very first time. I hope quickly something comes down the pipe of her, just be happy and best is watching her by yourself, she's really worth a good fuck...\n\n\n\nfor more hot videos click user Theofiel","torrent":{"xt":"urn:btih:e697669d4dccf04239da125503bea2cd96b00b6d","amp;dn":"Little+Vamda+virgin+and+upcoming+porn+supermodel+WMV9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e697669d4dccf04239da125503bea2cd96b00b6d","infoHashBuffer":{"type":"Buffer","data":[230,151,102,157,77,204,240,66,57,218,18,85,3,190,162,205,150,176,11,109]},"announce":[],"urlList":[]}}