{"title":"STARGATE.SG-1.S06E09-12.SWESUB. -Lindoff.ISO","uid":5796332,"size":2908014592,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e9d4516a0b08aa924a14d058ab72399f94def727&amp;dn=STARGATE.SG-1.S06E09-12.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1283072227,"description":"Season 6, Episode 9: Allegiance\n\nThe Tok'ra are forced to evacuate their newly established base under attack from \n\nthe Goa'uld. They flee to the SGC's Alpha site. Tensions rise between the allied \n\nfactions, the Free Jaffa, Tau'ri, and Tok'ra. Jacob and Selmac feel the end of the \n\nTok'ra is near and Sam finds a Naquadah generator has been sabotaged to function \n\nas a bomb. Jack suspects the recently arrived Tok'ra and attempts to weed out the \n\ntraitor.\n\t\nSeason 6, Episode 10: Cure\n\nSG-1 is negotiating a treaty with the inhabitants of Pangera. The have sometime \n\nmiraculous to offer - a drug they call tretonin that can cure any ill. But there \n\nis a catch: the drug replaces the the user's immune system and must be taken \n\nforever. The Pangerans want specific world coordinates in exchange for the drug - \n\nand some of those places are the homes of powerful system lords. They won't \n\nexplain why, but it clearly has to do with tretonin. Then the Tok'ra, called in to \n\nhelp solve the problem, make a startling discovery about the ultimate source of \n\ntretonin.\n\t\nSeason 6, Episode 11: Prometheus\n\nA television news crew has unearthed information about an Air Force project called \n\n&quot;Prometheus&quot;. They believe it to be a generator, but know it uses Trinium, an \n\nelement not found on Earth. In order to keep them quiet the Air Force allows them \n\nto film the X-303, a spaceship based on Asgard technologies, otherwise known as \n\nPrometheus. Things turn south when the news crew arm themselves and hold the \n\nPrometheus, as well as Sam and Jonas, hostage.\n\t\nSeason 6, Episode 12: Unnatural Selection\n\nThe Asguard home galaxy has been over-run by the replicators, and they ask for \n\nSG-1's help. The Asguard believed they had trapped the replicators with a device \n\nthat would slow down time, but it seems to have failed. They need SG-1 to enter \n\nreplicator infested space, find the time dilation machine and reset it. When SG-1 \n\nland at the designated point, they meet 5 individuals, who control the \n\nreplicators. The others reveal that they are an evolution of the replicators - \n\ncomposed of micro-cellular replicator blocks, and modeled on Reese, who created \n\nthe original replicators. These others have reset the time machine so that time is \n\nmoving more quickly within this area of space - to allow them to evolve and build \n\nan enormous army that can invade the rest of space. The minds of the team are \n\nprobed by the first 4 others. However, the last member of the others (called \n\nFifth) seems reluctant - he is described as weak by First, the leader of the \n\nreplicators. He was an attempt to model Reese more fully, but the mistake will not \n\nbe repeated. Carter senses his reluctance to probe her mind, but invites him to do \n\nso - and they agree a plan. Fifth will reset the time dilation machine to run \n\nslowly, and he will escape with the SG team. While time is passing slowly for his \n\nbrethren, the Asguard will have hundreds of years to fix the mistake in the \n\nothers. Fifth has to leave later than the SG team to avoid arousing the suspicion \n\nof the others; Jack orders Carter to set the timer on the device to activate \n\nearlier than Fifth has been told. SG-1 escape successfully as the time dilation \n\ndevice reverses the trend within the area of space, and makes time run much more \n\nslowly. However, Fifth is caught by his brethren, and realises that Carter had \n\nbroken her promise not to leave without him. Carter and Jonas regret using Fifth's \n\nhumanity against him, but even though Jack seems uncomfortable, he declares that \n\nFifth wasn't human, and they made the only correct choice.\n","torrent":{"xt":"urn:btih:e9d4516a0b08aa924a14d058ab72399f94def727","amp;dn":"STARGATE.SG-1.S06E09-12.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d4516a0b08aa924a14d058ab72399f94def727","infoHashBuffer":{"type":"Buffer","data":[233,212,81,106,11,8,170,146,74,20,208,88,171,114,57,159,148,222,247,39]},"announce":[],"urlList":[]}}