{"title":"August Rush (Ned. Subs)Juultje (2Lions-Team)","uid":5769141,"size":4685073908,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ea1974c609344f0c9cfa48d0fc7b57ebad155d11&amp;dn=August+Rush+%28Ned.+Subs%29Juultje+%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"juutje","files":-1,"time":1282040033,"description":"August Rush\n\nVerenigde Staten\nDrama / Muziek\n112 minuten\n\ngeregisseerd door Kirsten Sheridan\nmet Freddie Highmore, Keri Russell en Jonathan Rhys Meyers\n\nTwee jonge muzikanten ontmoeten elkaar bij toeval in het nachtelijke New York. Hieruit ontstaat een romance die helaas van korte duur is. De rijke vader van de vrouw is tegen de relatie en zodoende raken de geliefden elkaar kwijt. Dan blijkt de vrouw zwanger. Door toedoen van haar vader denkt ze dat haar kind dood geboren wordt. Het jongetje komt terecht in een weeshuis. Hij blijkt een groot muzikaal genie. Hij is er zeker van, dat zijn ouders hem op een dag komen halen. Als dat te lang duurt, besluit het jongetje de wijde wereld in te trekken. Hij voelt dat muziek hem met zijn ouders verbindt, en dus volgt hij de muziek om ze te kunnen vinden. Dat lijkt een moeilijke en onmogelijke weg. Zijn ongelooflijke muzikaal talent zit hem zelfs in de weg. De zoektocht wordt extra ingewikkeld als hij een nieuwe artiestennaam aanneemt: August Rush.\n\nEngels\n\nThis is a story of a music prodigy. Lyla is a renowned and beautiful cellist and Louis is a bass player in club. Lyla and Louis falls in love once they meet each other following the music. Since they have different life, they have to separate without seeing each other once again. However, Lyla has had their baby-Evan, a prodigy born to music. Lyla has an accident and bears the baby but Lyla's father gives the baby to an orphanage but does not tell her this in case of affecting her career. After that, both Louis and Lyla give up the music career. Eleven years later, the poor little Evan believes that their parents are waiting for him and goes to New York to find his parents. In New York, his music gift leads him to success but also gives him some trouble. A monger uses Evan to make money and prevents him from success. He escapes and runs into a church and people there are surprised by his gift and send him to the best music school, Juilliard. In the Juilliard school, he receive the normal education but his genius makes him brilliant and created his composition--August Rhapsody in C major. At the same time, Lyla and Louis both begin to play music again and Louis has been in New York. Because of his perfect performance, Evan is granted an opportunity to play his music in the central park in front of thousands of people. There are totally three composers and he is feathered last, in fact, his mother is the second one. As Evan is directing the orchestra to play his rhapsody, Lyla and Louis come to the concert following the music again. The family get together finally!\n\nWeblink http://www.imdb.com/title/tt0426931/\nWeblink http://www.moviemeter.nl/film/35822\n\nVideo                  : Retail DVD Rip\nAudio                  : AC 3 5.1  English\nSubs                   : Dutch\nID                     : 224 (0xE0)\nFormat                 : MPEG Video\nFormat version         : Version 2\nBit rate mode          : Variable\nWidth                  : 720 pixels\nHeight                 : 576 pixels\nDisplay aspect ratio   : 4:3\nFrame rate             : 25.000 fps\nStandard               : PAL\nCover                  : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n\t\t\n\n\n","torrent":{"xt":"urn:btih:ea1974c609344f0c9cfa48d0fc7b57ebad155d11","amp;dn":"August+Rush+%28Ned.+Subs%29Juultje+%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea1974c609344f0c9cfa48d0fc7b57ebad155d11","infoHashBuffer":{"type":"Buffer","data":[234,25,116,198,9,52,79,12,156,250,72,208,252,123,87,235,173,21,93,17]},"announce":[],"urlList":[]}}