{"title":"[wii] ANNO [PAL] [EUR Multi 5] create a new world","uid":6495463,"size":4699979776,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:ea730a9e6cffa180956ee56dcabd507dcb640fd3&amp;dn=%5Bwii%5D+ANNO+%5BPAL%5D+%5BEUR+Multi+5%5D+create+a+new+world&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1309047491,"description":"ANNO - Eine einzigartige &amp; preisgekrÃƒÂ¶nte Kombination aus Aufbau, Wirtschaft, Entdeckung, Diplomatie und Kampf. Auf geht es in den offiziellen vierten Teil der beliebten Aufbaustrategieserie. In ANNO: Erschaffe eine neue Welt geht es in den Orient und dort warten viele neue Features, VÃƒÂ¶lker, Waren und vieles mehr auf dich. Nur durch geschickten Handel, gerissene Diplomatie und zukunftsorientierte Bauplanung kann die eigene Insel florieren und gedeihen.\n\n_________________________________________________________\n\n\nYear 1404. King Georges' land is suffering from drought and famine. Aware of the distress of his fellows, King George decides to send his two sons, William and Edward, to gain new territories to produce enough goods to satisfy the inhabitants. Whereas Edward suggests fighting to collect the precious resources, his brother, William offers a peaceful solution proposing to explore new and unsettled lands in the south of the Kingdom.\n\nWith the agreement of his Father, William heads to the South and discovers the mysterious oriental culture. He becomes friends with the locals and they teach him new technologies and secrets to take back to his Father's kingdom.\n\nEverything seems to come to a good end, but suddenly the Sultan is kidnapped and his aggressive sister is taking over the orient. She wants to attack King George's empire but not all the needs are met yet, and the men are sent out with new tasks to find more resources..\n\n_________________________________________________________\n\n\n\n\n[wii] [PAL] [EUR Multi 5]\n\nenjoy it\n","torrent":{"xt":"urn:btih:ea730a9e6cffa180956ee56dcabd507dcb640fd3","amp;dn":"%5Bwii%5D+ANNO+%5BPAL%5D+%5BEUR+Multi+5%5D+create+a+new+world","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea730a9e6cffa180956ee56dcabd507dcb640fd3","infoHashBuffer":{"type":"Buffer","data":[234,115,10,158,108,255,161,128,149,110,229,109,202,189,80,125,203,100,15,211]},"announce":[],"urlList":[]}}