{"title":"Groundhog Day(1993)DVDRip.AC3(ENG)-DROCK","uid":6384075,"size":732082947,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb893867e0a10abb5c683ca64bbd593a857e960b&amp;dn=Groundhog+Day%281993%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1305135009,"description":"Bill Murray plays Phil, a TV weatherman working for a local station in Pennsylvania but convinced that national news stardom is in his grasp. Phil displays a charm and wit on camera that evaporates the moment the red light goes off; he is bitter, appallingly self-centered, and treats his co-workers with contempt, especially his producer Rita (Andie MacDowell) and cameraman Larry (Chris Elliot). On February 2, 1992, Phil, Rita, and Larry are sent on an assignment that Phil especially loathes: the annual Groundhog Day festivities in Punxsutawney, PA, where the citizens await the appearance of Punxsutawney Phil, the groundhog who will supposedly determine the length of winter by his ability to see his own shadow. Phil is eager to beat a hasty retreat, but when a freak snowstorm strands him in Punxsutawney, he wakes up the next morning with the strangest sense of dÃƒÂ©jÃƒÂ  vu: he seems to be living the same day over again. The next morning it happens again, and then again. Soon, no matter what he does, he's stuck in February 2, 1992; not imprisonment nor attempted suicide nor kidnapping the groundhog gets him out of the loop. But the more Phil relives the same day, the more he's forced to look at other people's lives, and something unusual happens: he begins to care about others. He starts to respect people, he tries to save the life of a homeless man, and he discovers that he's falling in love with Rita and therefore wants to be someone that she could love in return.\n\nRipped with Handbrake.\n\nLength: 1 Hour 41 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:eb893867e0a10abb5c683ca64bbd593a857e960b","amp;dn":"Groundhog+Day%281993%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb893867e0a10abb5c683ca64bbd593a857e960b","infoHashBuffer":{"type":"Buffer","data":[235,137,56,103,224,161,10,187,92,104,60,166,75,189,89,58,133,126,150,11]},"announce":[],"urlList":[]}}