{"title":"Democracy Now - 12 apr 2011","uid":6314469,"size":448551632,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eb99d3dbde1d4428c241f9f84de4c18d7f19af3f&amp;dn=Democracy+Now+-+12+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1302653058,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 12, 2011\n\n- Radiation from Japan Nuclear Crisis &quot;Could Eventually Exceed Chernobyl&quot;\n- Ivory Coast Incumbent President Laurent Gbagbo Arrested\n- Libyan Rebels Reject African Ceasefire Proposal, France Calls for More Air Strikes\n- Egyptian Military Court Sentences Blogger to Three Years in Prison\n- 117 Syrian Protesters Detained on Monday\n- U.S. Servicemen Killed by Drone Strike in Afghanistan\n- Pakistan Calls on CIA, Special Operations Forces to Scale Back Mission\n- Washington, D.C. Mayor Arrested After Protesting Budget Proposal\n- Court Upholds Ban on Elements of Arizona Immigration Law\n- Study: Natural Gas Drilling May Contribute More to Global Warming than Coal\n- Associated Press Plans Nationwide Rallies Against Benefits Cuts\n\n\nSpecial reports\n\n- Nuclear Catastrophe in Japan &quot;Not Equal to Chernobyl, But Way Worse&quot;\n\nJapan has raised the severity rating of its nuclear crisis from 5 to 7, the highest level, matching the 1986 Chernobyl nuclear disaster. We go to Tokyo for an update from Thomas Breuer, head of the Climate and Energy Unit for Greenpeace Germany and part of a field of radiation monitors in Japan. He notes that unlike Chernobyl, the damaged Fukushima Daiichi nuclear power plant is in a densely populated area. &quot;We warned the government that there are a lot of cities and villages outside the 20-kilometers evacuation zone where the radiation levels are so high that people need urgently to be evacuated, especially children and pregnant women, because they are the most vulnerable part of the population to radiation,&quot; says Breuer.\n\n\n- Human Rights Concerns Continue After Capture of Ivory Coast Strongman Laurent Gbagbo\n\nSupporters of the internationally recognized Ivory Coast president, Alassane Ouattara, have captured strongman Laurent Gbagbo, ending a four-month standoff that left hundreds dead. Gbagbo had refused to leave office since the country's presidential election in November, which the United Nations says Ouattara won. Although the political standoff has come to a close, Ivory Coast remains in deep turmoil. At least 1,000 people are thought to have died, and around one million people have fled their homes during the fighting. Many of the displaced have little access to food and shelter and live in dire conditions. Thousands of Gbagbo supporters remain armed and on the streets. We are joined by Corinne Dufka, senior researcher in the Africa Division of Human Rights Watch, and Elizabeth Dickinson of Foreign Policy magazine. Last month, Dickinson traveled under a United Nations Foundation grant to Liberia, where some 125,000 Ivorians have fled. She has also reported on how the Christian right in the United States has supported Gbagbo, including Pat Robertson and several evangelical members of Congress.\n\n\n- &quot;I Am Willing to Give My Life&quot;: Bahraini Human Rights Activists Risk Lives to Protest U.S./Saudi-Backed Repression\n\nThe Gulf nation of Bahrain is intensifying its crackdown on pro-democracy protesters. On Saturday, masked police offers broke into the home of Abdulhadi Alkhawaja, a prominent Bahraini human rights activist. He was beaten and detained. We speak to his daughter, Zainab Alkhawaja, who witnessed the attack and is now on a hunger strike. Her husband and brother-in-law were also beaten and arrested in the pre-dawn raid. We also speak to Nabeel Rajab, the president of the Bahrain Center for Human Rights. He is facing a possible military trial for publishing the photograph of Ali Sager, a protester who died while in Bahraini custody.\n\n\n- The Army vs. the People?: A Democracy Now! Special Report from Egypt\n\nTwo months after the fall of the Mubarak regime, tension between the Egyptian military and the pro-democracy protesters is rapidly increasing. On Friday, Egyptian forces stormed Tahrir Square in Cairo, killing two protesters. On Monday, an Egyptian military court sentenced a pacifist blogger to three years in prison. Hundreds, and possibly thousands, of civilians remain in detention today after being sentenced by military tribunals over the past two months. Democracy Now! correspondent Anjali Kamat reports from Cairo.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:eb99d3dbde1d4428c241f9f84de4c18d7f19af3f","amp;dn":"Democracy+Now+-+12+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb99d3dbde1d4428c241f9f84de4c18d7f19af3f","infoHashBuffer":{"type":"Buffer","data":[235,153,211,219,222,29,68,40,194,65,249,248,77,228,193,141,127,25,175,63]},"announce":[],"urlList":[]}}