{"title":"The Unforeseen (2007)","uid":5761529,"size":1524834971,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec253e2311946b3a71176826bbb16582370bae07&amp;dn=The+Unforeseen+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wieszcz","files":2,"time":1281748430,"description":"DVDrip 1.42GB MKV file\n\nA documentary that begins with an examination of a real estate developer in Texas named Gary Bradley. Growing up on a farm teaches him that he is completely dependent upon nature. He seeks to escape this life of contingency and leaves for the big city (Austin Texas) to become a real estate developer. In his words, &quot;I wanted a life I had more control over.&quot; In his new career as real estate developer, he can cease being subject to nature and instead impose his own will upon the land. He does so, describing raw land as &quot;a blank canvas&quot; upon which his is able to paint his masterpiece, namely, a subdivision. But the unexpected implosion of the Savings and Loan industry eliminates his funding and leaves him with enormous debts. To worsen matters, an environmental movement emerges that directly opposing his development. This movement believes development will pollute the waters of Barton Springs, one of North American's largest spring-fed swimming holes. Environmentalists succeed in passing local ordinances that reduce the amount of development that is permitted which further reduces the potential profits of this now troubled subdivision.\n\nAt this point, the film expands to include comments by Robert Redford who spent much of his childhood in Austin. He describes learning to swim in Barton Springs and how it awakened him to the natural world. He comments that much of America's natural heritage is coming under attack from people from &quot;the outside&quot; (often developers and their enablers) who have only short term interests. The landowners, homebuilders and other developers hire a lobbyist to &quot;work the Legislature&quot; and overturn these restrictions on development. The lobbyist succeeds in passing legislation that allows the development of over 10,000 additional acres &quot;against the environmentalists objections.&quot; But Ann Richards, Democratic governor of Texas, vetoes the bill much to the chagrin of the lobbyists and landowners. So development interests attempt a new strategy to subvert the restrictive environmental ordinances. They frame the issue as a &quot;property rights&quot; battle and successfully enlist Texas' ranchers and farmers against the environmentalists. This culminates in the election of George Bush to Texas governorship. With Karl Rove as his chief strategist, they score an upset victory over the very popular Ann Richards. Bush's election finally sees the successful passage of &quot;House Bill 1704.&quot; In the words of the lobbyist &quot;It erased much of what the environmentalists had accomplished... The legislature burned Austin to the ground.&quot;\n\nThe film concludes by returning to the developer who now finds himself in a federal bankruptcy case. He owes over $80 million and is being tried for filing of false bankruptcy. Courtroom audio is played to imagery of development, farmland and courtroom illustrations while the developer reflects on his strengths and weaknesses. The film draws to a close with the developer reflecting on the the pain of his failure. He is brought to tears when he reflects on burying his mother during his bankruptcy. The film ends with scenery from West Texas while the developer describes how he has been stripped of literally everything. He grapples with existential despair and describes that when you have absolutely nothing left, you face a much bigger issue, which is &quot;dealing with God.&quot; He has come full circle, aware of his dependence and incapable of relying upon his own powers for control. The film ends with journalist William Greider commenting that perhaps Americans have, after 200 years of development, finally reached the point where they can mature and determine to not &quot;leave a wreck behind us when we're gone.&quot;","torrent":{"xt":"urn:btih:ec253e2311946b3a71176826bbb16582370bae07","amp;dn":"The+Unforeseen+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec253e2311946b3a71176826bbb16582370bae07","infoHashBuffer":{"type":"Buffer","data":[236,37,62,35,17,148,107,58,113,23,104,38,187,177,101,130,55,11,174,7]},"announce":[],"urlList":[]}}