{"title":"Rickie Lee Jones - Chuck E.'s In Love (2nafish)","uid":5796550,"size":126031876,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ecdde78165dd9e61e1f74828a4c4d208b63a2c50&amp;dn=Rickie+Lee+Jones+-+Chuck+E.%5C%27s+In+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1283080675,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nRickie Lee Jones is the eponymously titled debut album of Chicago-born musician Rickie Lee Jones, released in March 1979. After arriving in California in the mid-1970s, Jones started writing songs more seriously and by 1977 had met singer-songwriters Chuck E. Weiss and Tom Waits, who became her lover during this period.\n\nThe album was released in the spring of 1979 to favourable reviews, propelled by the substantial jazz-pop hit single &quot;Chuck E.'s in Love,&quot; based on a rumoured romance of her friend Weiss. The single became a US #4 hit during the summer, while the album, which went on to become a million seller, hit US #3. A second single, &quot;Young Blood,&quot; cracked the US Top 40 in late 1979, when Jones went on an international tour. By June 1981, the album had sold over two million copies in the US alone.\n\nThe album cover contributed to the image of Jones as a cool beret-wearing beatnik; it was reported at the time that Jones was a heavy drinker and also a drug addict, and she and Tom Waits  were, in some quarters, known as rock music's bohemian couple. The music videos for the album's two hit singles also contribute to Jones' &quot;hipster chic&quot; image, and she was featured on the August 9, 1979 cover of Rolling Stone magazine, becoming one of the most successful music stars of the year. The album cover photography and design was by Norman Seeff.\n\nA demo containing songs for the album including &quot;The Last Chance Texaco&quot;, &quot;Easy Money&quot;, &quot;Young Blood&quot; and &quot;After Hours&quot; did the rounds in 1978 and earned Jones a record deal with Warner Bros. Records. Recording sessions during 1978 yielded eleven songs for inclusion on an album, with two, &quot;On Saturday Afternoons in 1963&quot; and &quot;After Hours,&quot; recorded live on December 22, 1978.\n\nRickie Lee Jones (born November 8, 1954) is an American vocalist, musician, songwriter, and producer. Over the course of a three-decade career, Jones has recorded in various musical styles including rock, R&amp;B, blues, pop, soul, and jazz standards.\n\nRickie Lee Jones was released in March 1979 and became a hit, buoyed by the success of the jazz-flavored single &quot;Chuck E.'s in Love&quot; (#4 Billboard Hot 100, 1979) and its accompanying video. The album, which included guest appearances by Dr. John, Randy Newman, and Michael McDonald, went to US #3 on the Billboard 200 and produced another US Top 40 hit with &quot;Young Blood&quot; (#40) in late 1979.\n\nFollowing a successful world tour, the cover of Rolling Stone magazine, Jones secured five nominations at the Grammy Awards for Record of the Year, Best Pop Vocal Performance, Female, Best Rock Vocal Performance, Female, Song of the Year (&quot;Chuck E.'s in Love&quot;), and Best New Artist, which she won at the January 1980 ceremony. She was also voted Best Jazz Singer by Playboy magazine's critic and reader polls. Jones was covered by Time magazine on her very first professional show, in Boston, and they dubbed her &quot;The Duchess of Coolsville.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ecdde78165dd9e61e1f74828a4c4d208b63a2c50","amp;dn":"Rickie+Lee+Jones+-+Chuck+E.%5C%27s+In+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecdde78165dd9e61e1f74828a4c4d208b63a2c50","infoHashBuffer":{"type":"Buffer","data":[236,221,231,129,101,221,158,97,225,247,72,40,164,196,210,8,182,58,44,80]},"announce":[],"urlList":[]}}