{"title":"Abdellatif Kechiche - La graine et le mulet (2007) - Criterion","uid":5783108,"size":8383598089,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ed2f8ae4b11595d7c962cdc465078c557ff9de07&amp;dn=Abdellatif+Kechiche+-+La+graine+et+le+mulet+%282007%29+-+Criterion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mfccorrea","files":27,"time":1282490393,"description":"Though it is seldom discussed (or acknowledged) in the West, modern-day France incorporates a substantial number of immigrant communities, with many indigenes from North Africa populating the bucolic regions of southern Gaul. Abdel Kechiche's La Graine et le Mulet  hones in on one such community, located on the ocean, which exudes a laid-back, unforced rhythm and a slower pace of life for all of its residents. For many years, one such occupant, sexagenarian Slimane Beiji (Habib Boufares), has nurtured a single lifelong dream: to open up his own couscous and fish restaurant in the community. This dream appears ever more impossible when Slimane is promptly laid off, but he soon lands on the idea of occupying a wrecked boat and converting it into the restaurant. Meanwhile, the gentleman has recently divorced his wife, Souad (Bouraouia Marzouk), and has moved into a hotel owned by his lover, Latifa (Hatika Karaoui), but Slimane's extended family continues to meet at Souad's home on a weekly basis for her beloved fish couscous, where they expostulate their views on life and reflect on the state of their relationships with one another. In a tangentially related subplot, Slimane's oldest son, Hamid (Abdelhamid Aktouche), enjoys an extramarital affair, ignoring his nuptials with his Russian wife and the presence of his infant boy, and thus endangering the sanctity and happiness of his family. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0487419/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0487419/&lt;/a&gt;\n\n Year.............: 2007\n Country..........: France\n Runtime..........: 154 Minutes\n Audio............: French &amp; Arabic (in one track)\n Subtitles........: English, Spanish (custom), German (custom), French (SDH, custom), Portugues (custom)\n Video Format.....: NTSC\n Aspect Ratio.....: 1.85:1\n DVD Source.......: DVD9\n DVD Distributor..: Criterion (DVD Release Date:  27 Jul 2010 )\n Program..........: DVD Decrypter, DVD Remake, Muxman, Subtitle Workshop, PGC Demux...\n DVD Review.......: dvdbeaver\n Bitrate..........: 6.76 mb/s \n\nOriginally posted at Cinematik by elhippie, whom we thank. Great job!","torrent":{"xt":"urn:btih:ed2f8ae4b11595d7c962cdc465078c557ff9de07","amp;dn":"Abdellatif+Kechiche+-+La+graine+et+le+mulet+%282007%29+-+Criterion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed2f8ae4b11595d7c962cdc465078c557ff9de07","infoHashBuffer":{"type":"Buffer","data":[237,47,138,228,177,21,149,215,201,98,205,196,101,7,140,85,127,249,222,7]},"announce":[],"urlList":[]}}