{"title":"Autosport Magazine UK 12/08/2010","uid":5765805,"size":87040217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed6326d189816087385782e9413cfabaa38b11df&amp;dn=Autosport+Magazine+UK+12%2F08%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thorhammer2000","files":-1,"time":1281897968,"description":"NEWS\n10 Schuey safe, says Merc. Team pledges to stand by struggling seven-time champ\n12 ''Boring' F1 teams get flak: Bridgestone chief claims conservative strategies make racing duller than it should be\n14 Tilke's Austin maxi. Track designer says Texas venue will be winner with fans\n18 Euro F3 to continue. Bosses promise beleaguered series will go on in 2011\n20 Honda: come and play. Japanese giant gives commitment to IndyCar, but wants to battle rivals\n23 Coulthard up for DTM. Scot enters talks with Merc for second year in tin-tops\n25 Bianchi on the mend. Injured GP2 star targets Spa\n26 Brits back In the IRC. 2009 champ Meeke plus Wilks set to stay on in '11\n\nREPORTS\n42 BTCC Snetterton. Double win moves Chevy man Plato to top of the table\n46 Snetterton supports. Millroy breaks Renault duck, as Harvey denies Caine a Carrera Cup double\n52 British F3 Thruxton. Superb Vergne within touching distance of the crown\n54 lndyCar Mid-Ohio. Franchitti takes a crucial win from series leader Power\n56 DTM Nurburgring. Spengler stretches points lead by heading Merc 1-2-3\n59 Euro F3 Nurburgring. Mortara continues his cruise towards the 2010 title\n60 World of Sport. NASCAR; ALMS; Grand-Am; IRC; German F3; Indy Lights\n\nFEATURES\n29 F1's mid-term report. How the top drivers and teams are shaping up in one of the closest seasons ever\n40 Rapax. Getting up close and personal with the 'unknown' Italian team that's storming GP2\n\nSPORTS EXTRA\n77 Damon Hill comeback! Hill could join Herbert, Brundle and Bell on Brands DTM support-race grid\n78 Bells add a peel to BGT. Le Mans Series champ joins brother in a Ginetta G50\n82 Reports. Croft HSCC; Silverstone BDC; Mallory Park rallycross; Craigantlet hillclimb\n87 National focus. The FF1600 Swift that's been winning races for almost two decades\n\nREGULARS\n93 Photo Finish. Porsche takes its only IndyCar win, Mid-Ohio, 1989 (below)\n94 Race of my life. Raul Boesel, Spa 1000Km, 1987\n\nOCRd with Acrobat Pro 8.2","torrent":{"xt":"urn:btih:ed6326d189816087385782e9413cfabaa38b11df","amp;dn":"Autosport+Magazine+UK+12%2F08%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed6326d189816087385782e9413cfabaa38b11df","infoHashBuffer":{"type":"Buffer","data":[237,99,38,209,137,129,96,135,56,87,130,233,65,60,250,186,163,139,17,223]},"announce":[],"urlList":[]}}