{"title":"Night Court Season 2 - DVD Rips English Subtitles","uid":5814000,"size":5432077016,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:edb45ef61f48de72b6dd29f236010ce01e9e9b2c&amp;dn=Night+Court+Season+2+-+DVD+Rips+English+Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1283761275,"description":"Night Court Typical Show Notes \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 958kbps \nDuration.............: 24:08.228\nResolution...........: 600*458 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 1 \n\n &lt;a href=&quot;\nhttp://bayimg.com/HaomdAAch&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HaomdAAch&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0086770/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0086770/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Night_Court&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Night_Court&lt;/a&gt;\n\nNight Court is an American television situation comedy that aired on NBC  from January 1984 until May 1992. The setting was the night shift of a Manhattan  court, presided over by the young, unorthodox Judge Harold T. &quot;Harry&quot; Stone (played by Harry Anderson). It was created by comedy writer Reinhold Weege, who had previously worked on Barney Miller in the 1970s and early 1980s.\n\n\nEp. \tNo. \tTitle \tDirector \tWriter(s) \tAirdate\n1 \t14 \t&quot;The Nun&quot; \tJeff Melman \tBob Stevens \tSeptember 27, 1984\nAn impressionable young nun decides to leave her order after meeting Harry. \n2 \t15 \t&quot;Christine and Mac (a.k.a. Daddy for the Defense)&quot; \tJeff Melman \tReinhold Weege \tOctober 4, 1984\nA brand new public defender has a rough first day in court, thanks to Harry and her over-protective father. One-episode guest stint by Markie Post as Christine Sullivan.[2] \n3 \t16 \t&quot;Billie and the Cat&quot; \tLee Bernhardi \tZachary D. Wechsler \tOctober 18, 1984\nHarry sends public defender Billie Young to jail for refusing to reveal the whereabouts of a cat her client is accused of kidnapping. \n4 \t17 \t&quot;Pick a Number&quot; \tJeff Melman \tRon Osborn,\nJeff Reno \tOctober 25, 1984\nThe courtroom becomes a circus when a meek little fellow chooses Harry to decide what worthy person will receive the money from his winning lottery ticket. \n5 \t18 \t&quot;The Computer Kid&quot; \tJim Drake \tBob Stevens \tNovember 1, 1984\nA precocious computer whiz barricades himself in Harry's office and threatens to wipe out all his school's records. \n6 \t19 \t&quot;Bull Gets a Kid&quot; \tJeff Melman \tNat Mauldin \tNovember 8, 1984\nBull finally is allowed a foster son by a volunteer-fathers organization, but he winds up with a bit of a surprise. \n7 \t20 \t&quot;Harry on Trial&quot; \tJeff Melman \tChris Cluess,\nStu Kreisman \tNovember 15, 1984\nHarry is called before a disciplinary board for his unorthodox courtroom behavior. \n8 \t21 \t&quot;Harry and the Madam&quot; \tNoam Pitlik \tTony Sheehan \tNovember 22, 1984\nHarry feels a lot of official pressure when a notorious madame with a hot diary comes before his bench. \n9 \t22 \t&quot;Inside Harry Stone&quot; \tJeff Melman \tChris Cluess,\nStu Kreisman \tNovember 29, 1984\nHarry is reluctant to have surgery for his ulcer symptoms. John Astin appears as a hospital patient named Kenny. \n10 \t23 \t&quot;The Blizzard&quot; \tJeff Melman \tReinhold Weege \tDecember 6, 1984\nA blizzard traps everyone in the courthouse and Dan in an elevator with a man who's attracted to him. \n11 \t24 \t&quot;Take My Wife, Please&quot; \tJeff Melman \tTom Reeder \tDecember 13, 1984\nMac marries Quon Le, a girl he knew in Vietnam, and Harry conducts court despite temporary blindness. \n12 \t25 \t&quot;The Birthday Visitor&quot; \tGary Shimokawa \tRon Osborn,\nJeff Reno \tJanuary 3, 1985\nBillie's birthday dinner for Harry is disrupted by an insecure intruder. \n13 \t26 \t&quot;Dan's Parents&quot; \tJeff Melman \tReinhold Weege \tJanuary 10, 1985\nDan's past is revealed when the parents he told everyone were dead come to see their successful sonny boy. \n14 \t27 \t&quot;Nuts About Harry&quot; \tJeff Melman \tTom Reeder \tJanuary 17, 1985\nPatients from a mental institution stage a strike to convince the court they're being mistreated at the hospital. \n15 \t28 \t&quot;An Old Flame&quot; \tJeff Melman \tNat Mauldin \tJanuary 24, 1985\nSelma's old beau wants to rekindle their romance and a substitute judge isn't what he's cracked up to be. \n16 \t29 \t&quot;The Gypsy&quot; \tAlan Bergmann \tHoward Ostroff \tJanuary 31, 1985\nHarry uses a little hocus-pocus to convince Bull he's cured of a gypsy curse. \n17 \t30 \t&quot;Battling Bailiff&quot; \tJeff Melman \tChris Cluess,\nStu Kreisman \tFebruary 7, 1985\nBull quits his job in frustration and becomes a professional wrestler. \n18 \t31 \t&quot;Billie's Valentine&quot; \tJeff Melman \tBob Stevens \tFebruary 14, 1985\nBillie's new boyfriend turns out to be a professional problem for her, despite his romantic accomplishments. \n19 \t32 \t&quot;Married Alive&quot; \tJeff Melman \tRon Osborn,\nJeff Reno \tFebruary 21, 1985\nHis friends believe the worst when Dan starts dating a homely, gauche woman who's heir to $40 million. \n20 \t33 \t&quot;Mac and Quon Le: Together Again&quot; \tAlan Bergmann \tTom Reeder \tFebruary 28, 1985\nQuon Le appears before the court for prostitution and Harry has to choose between Billie and Dan for the mayoral commission. \n21 \t34 \t&quot;World War III&quot; \tAlan Bergmann \tNat Mauldin \tMay 2, 1985\nHarry searches for Yakov's brother, a Russian circus defector. Meanwhile, Soviet and American agents (Leonard Stone, Gordon Jump) negotiate an arms agreement. \n22 \t35 \t&quot;Walk, Don't Wheel&quot; \tReinhold Weege \tReinhold Weege \tMay 9, 1985\nA disabled law student takes Harry's refusal of her prom invitation as a slap against her handicap. ","torrent":{"xt":"urn:btih:edb45ef61f48de72b6dd29f236010ce01e9e9b2c","amp;dn":"Night+Court+Season+2+-+DVD+Rips+English+Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edb45ef61f48de72b6dd29f236010ce01e9e9b2c","infoHashBuffer":{"type":"Buffer","data":[237,180,94,246,31,72,222,114,182,221,41,242,54,1,12,224,30,158,155,44]},"announce":[],"urlList":[]}}