{"title":"The 2012 Story: The Myths, Fallacies, and Truth Behind the Most ","uid":6485650,"size":5322689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee2508e4ba8c0f0020c13808f409cf40cf182a0b&amp;dn=The+2012+Story%3A+The+Myths%2C+Fallacies%2C+and+Truth+Behind+the+Most+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Djofullinn","files":1,"time":1308697844,"description":"The 2012 Story: The Myths, Fallacies, and Truth Behind the Most Intriguing Date in History By John Major Jenkins\nPublisher: Tarcher 2009-10-15 | 496 Pages | ISBN: 1585427667 | PDF 8 MB\n\nOn December 21, 2012, the Mesoamerican Long Count calendar, a 5,125- year cycle calendar system pioneered by the Maya, will come to an end. At the same time, the earth, the sun, and the center of the galaxy will come together in an extremely rare cosmic alignment. More and more people believe that the world as we know it will experience a transformation in 2012, but few are aware of the complete history or significance of the date. John Major Jenkins, among the most authoritative voices of the 2012 movement, has written a definitive explanation of one of the most thought-provoking phenomena of our time. Drawing from his own groundbreaking research (including his involvement in the modern reconstruction of Mayan 2012 cosmology) and more than two decades of extensive study of Mayan culture, Jenkins has created the crucial guide to understanding the story of 2012-an essential overview of the history, theory, cultures, and personalities that have brought this extraordinary idea into modern awareness. Jenkins provides illuminating answers to some of the most-asked questions about 2012, including:\n- How did the early Maya devise the calendar that gives us the cycle ending in 2012, and how does it work?\n- How did the calendar come to be rediscovered and reconstructed in our era?\n- What controversies and intrigues surround the topic, and what do scholars and researchers have to say about them?\n- How can we cut through all the noise about 2012 and gain true wisdom from the Mayan teachings about this moment?\n &lt;a href=&quot;\nhttp://www.amazon.com/2012-Story-Fallacies-Intriguing-History/dp/B003JTHRKA/ref=sr_1_1?ie=UTF8&amp;qid=1308690557&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/2012-Story-Fallacies-Intriguing-History/dp/B003JTHRKA/ref=sr_1_1?ie=UTF8&amp;qid=1308690557&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:ee2508e4ba8c0f0020c13808f409cf40cf182a0b","amp;dn":"The+2012+Story%3A+The+Myths%2C+Fallacies%2C+and+Truth+Behind+the+Most+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2508e4ba8c0f0020c13808f409cf40cf182a0b","infoHashBuffer":{"type":"Buffer","data":[238,37,8,228,186,140,15,0,32,193,56,8,244,9,207,64,207,24,42,11]},"announce":[],"urlList":[]}}