{"title":"Disaster Report &amp; Raw Danger [Ntsc], Ps2","uid":5756231,"size":1760121367,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:eeb58277d34b87f48727fa9fb9dd1e8de95dd433&amp;dn=Disaster+Report+%26+Raw+Danger+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big_dude","files":-1,"time":1281570299,"description":"Disaster Report &amp; Raw Danger! for the Ps2                          Rel. 2003 &amp; 2007\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         MDS/ISO\nGenre.:        Action\nRating:        T (Teen)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Both Games were tested and work.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nDisaster Report Game Description:\n\nKeith Miyamoto is a reporter who works for an important newspaper in Los Angeles. In 2005, he travels to an island called Capital City, where he has to get a new job. But on his way from the airport to the city, a terrible earthquake occurs. The train collapses and Keith finds himself abandoned by the rescue team. Now he has to escape the island, try to save the people stranded on it, and discover the true reasons behind the chaos in the city.\n\nBut that will be anything but easy. The earthquake continues, and any time Keith steps on a half-collapsed bridge, crawls over a pile of rumble, or climbs a narrow path between ruined houses, the earth can start trembling...\n\nThis game, also known as &quot;Zettai Zetsumei Toshi&quot; (Japanese original title), or &quot;SOS - Final Escape&quot; (European title), is a combination of pure adventure and survival/horror genres. The controls, the inventory management, the camera, that changes angles automatically depending on your location, but mostly the necessity to survive can be linked to Alone in the Dark and its countless clones, while the complete lack of enemies to fight reminds of a classic adventure. There are many ways to preserve Keith from constant dying. You can find items and combine them into new ones (for example, finding a helmet and a lamp will allow you to build a helmet with a flashlight attached to it). Keith will also need to quench his thirst, so you'll have to find water for him. The water taps found in the game serve also as save points.\n\n\nFeatures:\n\n* Player have complete freedom to explore the 3D quake-ridden island at their own\n  peril! The hero must uncover the truth behind the devastation by assisting \n  fellow castaways that are found on the island! \n\n* Problem solving includes the ability of the hero to piece together separate \n  items in order to build tools to help in his escape! \n\n* The player may use objects like bikes, boats, compasses and more to aid in \n  escaping the island! \n\n* No other video game has ever approached this level of simulation in depicting \n  the &quot;real&quot; effects of a major city being torn apart by the forces of nature! \n\n* Special Feature: S-FORCE 3D Sound Library is included to make each earthquake \n  feel as real as possible! \n\n\nRaw Danger! Game Description:\n\nThe year is 2010. Joshua Harwell and Stephanie McMurrough got a job as waiters in the opening event of Geo City, a new underground city that marks a step forward in advanced and safe city design. Everything is going well...but then a levee breaks and the Hudson River unleashes its wrath on Geo City. Panic and chaos spreads around the place. Who will survive?\n\nRaw Danger is the spiritual successor of Disaster Report (AKA SOS: The Final Escape in Europe). In this game you must guide not only Joshua and Stephanie but also several other characters out of their pending underwater grave. Those characters include Amber Brazil, a young woman wrongly accused of murdering her brother, a cab driver, an amnesiac and a schoolgirl. By making the right choices you get to play also as Keith Helm, the hero of the previous game.\n\nThe main goal of the game is getting past various obstacles and challenges while keeping your body temperature. As the temperature drops the characters' movement slows down and eventually they'll collapse. You can keep warm with heat sources such as stoves, radiators and barrel fires, which are used also to save the game and cook food that charges your energy.\n\nEach character has its own type of gameplay: Joshua is strong and young and can perform physically challenging tasks, Amber has handcuffs which limit her movement and must use stealth tactics to avoid the police, and the taxi driver uses his taxi to avoid different disasters.\n\n\nFeatures:\n\n* Player has complete freedom to explore the 3D quake-ridden island at their own \n  peril! The hero must uncover the truth behind the devastation by assisting\n  fellow castaways that are found on the island! \n\n* Problem solving includes the ability of the hero to piece together separate \n  items in order to build tools to help in his escape! \n\n* The player may use objects like bikes, boats, compasses and more to aid in \n  escaping the island! \n\n* No other video game has ever approached this level of simulation in depicting \n  the &quot;real&quot; effects of a major city being torn apart by the forces of nature! \n\n* Special Feature: S-FORCE 3D Sound Library is included to make each earthquake \n  feel as real as possible!\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:eeb58277d34b87f48727fa9fb9dd1e8de95dd433","amp;dn":"Disaster+Report+%26+Raw+Danger+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb58277d34b87f48727fa9fb9dd1e8de95dd433","infoHashBuffer":{"type":"Buffer","data":[238,181,130,119,211,75,135,244,135,39,250,159,185,221,30,141,233,93,212,51]},"announce":[],"urlList":[]}}