{"title":"Coast To Coast Am - 08-19-10 - Geopolitics &amp; Weather Manipulatio","uid":5781050,"size":55864911,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f109b1421c2cdfd5035571c73d244f99b8f4fb6b&amp;dn=Coast+To+Coast+Am+-+08-19-10+-+Geopolitics+%26+Weather+Manipulatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1282405617,"description":"Date:\n 08-19-10\n \nHost:\n George Noory\n \nGuests:\n Scott Stevens, Robert Young Pelton \n \n\n\nIn the first half of the show, journalist and adventurer Robert Young Pelton discussed various geopolitical flashpoints including Pakistan and Afghanistan. In terms of America's military presence, the &quot;center of gravity&quot; for instability has shifted from Europe to the Middle East, North Africa, and South Asia, and &quot;that's why we're there,&quot; he explained. Regarding Iraq, the US isn't really vacating-- there are 50,000 troops left behind who are doing joint operations with the Iraqi police and military, he reported. China has become a global force in terms of strategic business, while Russia, pumped up by its oil economy, is trying to get back to its Soviet model, he commented. \n\nThere's going to be a civil war in Afghanistan between different ethnic factions, Pelton predicted, and the US has &quot;pushed half the country out of our sphere of influence,&quot; through its narrow focus there. If America continues its &quot;war on terror thinking,&quot; Yemen and Somalia could be the next targets for military action, he suggested. The biggest thing we need to think about is our own country, said Pelton. We are so lost in the swamp of other nations' problems, &quot;but we can't fix everyone's problems until we fix our own,&quot; he said. \n\n---------------------------------------\n\n\nIn the latter half of the show, meteorologist Scott Stevens talked about such topics as weather manipulation, chemtrails, and orgone energy. Several years ago, he set up time lapse cameras to record the skies and study chemtrails, and learned that planes were up there measuring the geometry to entrain the jet stream or the flow of air. The secretive &quot;powers that be&quot; can measure the orgone, and apply electromagnetic solutions to change the weather and storm patterns, he detailed. &quot;There's got to be a playbook they're working from-- so when we see these disasters like the fires in Russia and the flooding in Pakistan...this was something that they talked about weeks to months prior,&quot; he stated. \n\nScientists like Trevor James Constable gave them the playbook on how to manipulate the orgone or etheric energy back in the 1970's, and this knowledge has been misused, said Stevens. Project HAARP is probably used in less than 20% of the weather modification efforts-- &quot;I'm honestly more concerned about...orbiting military satellites that have directed energy technologies on them,&quot; he noted. Stevens also spoke about his involvement with Blue Water Alchemy, a company that makes products with the alchemical Ormus, a monoatomic element said to have unique properties. \n\n\nWebsite(s):\n-weatherwars.info\n-bluewateralchemy.com\n-comebackalive.com\nBook(s):\n-Licensed to Kill: Hired Guns in the War on Terror\n-The World's Most Dangerous Places\n-Come Back Alive","torrent":{"xt":"urn:btih:f109b1421c2cdfd5035571c73d244f99b8f4fb6b","amp;dn":"Coast+To+Coast+Am+-+08-19-10+-+Geopolitics+%26+Weather+Manipulatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f109b1421c2cdfd5035571c73d244f99b8f4fb6b","infoHashBuffer":{"type":"Buffer","data":[241,9,177,66,28,44,223,213,3,85,113,199,61,36,79,153,184,244,251,107]},"announce":[],"urlList":[]}}