{"title":"John Saul - Faces of Fear (Unabridged) Audiobook","uid":6476414,"size":347783492,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f12487d29f5c3171629ff57d32aafa6337866590&amp;dn=John+Saul+-+Faces+of+Fear+%28Unabridged%29+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LittleBlkDress","files":8,"time":1308323472,"description":"80 kbps\n\n9 hrs and 33 mins\n\nThough Alison McKenzie lives near beauty-obsessed Beverly Hills, she's fine being a Plain Jane. But her mother Anne believes beauty is the key to success. So when Alison suffers a burn, Anne takes her to a plastic surgeon. The surgeon says he can not only take care of the scar but can make her beautiful. Anne is enchanted by his promises, and by him. As a romance blooms, Alison's transformation begins.\n\nThen Alison finds a picture of the doctor's first wife and notices a resemblance to the work he's doing on her. Anne insists there's no resemblance, but Alison discovers that her now stepfather's first wife committed suicide after being disfigured in an accident - and that the woman had not always been beautiful; when he married her, she was as plain as Alison.\n\nFinally she discovers that at the time of the dead woman's original surgery, there was a series of killings in the area, and each of the victims had one feature or another that bore a great resemblance to those of the surgeon's first wife. Now, there is a similar series of killings going on, and finally Alison understands. But is it too late? \t\t","torrent":{"xt":"urn:btih:f12487d29f5c3171629ff57d32aafa6337866590","amp;dn":"John+Saul+-+Faces+of+Fear+%28Unabridged%29+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f12487d29f5c3171629ff57d32aafa6337866590","infoHashBuffer":{"type":"Buffer","data":[241,36,135,210,159,92,49,113,98,159,245,125,50,170,250,99,55,134,101,144]},"announce":[],"urlList":[]}}