{"title":"MOVIE Ã‚Â» THE LAST AIRBENDER [CAMSHOW] by globe@","uid":5816033,"size":839784969,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1773f49582a2280846ab4d3d4b8807d22dce79f&amp;dn=MOVIE+%C3%82%C2%BB+THE+LAST+AIRBENDER+%5BCAMSHOW%5D+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1283829992,"description":"* Hello nice MOVIES fans ...\n\n\n* Watch this nice fantasy movie ...\n\n\n* FILE INFO : 94 min 40 sec * avi divx * worked codification * quality cam picture *\n\n\n* STORY : * text extractd from wikipedia\n\n\n* The film begins with a fourteen-year-old Waterbender named Katara, and her \n\nfifteen-year-old warrior brother, Sokka from the Southern Water Tribe. They find an \n\nice sphere with a twelve-year-old boy named Aang and a flying bison named Appa, \n\ntrapped inside. Still unknown to them, Aang is the long lost Avatar - a spiritual \n\nfigure holding the world in balance. After his disappearance, one of the four \n\nnations of the world, the Fire Nation, declared war onto the others: the Air \n\nNomads, the Water Tribes and the Earth Kingdom. Prince Zuko of the Fire Nation is \n\non a quest to finally find the Avatar and bring him as prisoner to his father, the \n\nFire Lord Ozai. As Zuko and some Fire Nation soldiers arrive at the Southern Water \n\nTribe with their ship, he demands the elderly under the impression that the Avatar \n\nmust be an old person. But Aang has unique Airbender tattoos which make him \n\nsuspicious to the soldiers, as the disappeared Avatar is the last of the Air Nomads \n\nwhich are Airbenders. Aang surrenders himself to Zuko as long as he agrees to leave \n\nthe village alone. On the ship Aang is tested by Zuko\\'s Uncle Iroh and they \n\ndiscover that he really is the Avatar. Directly after the test Aang escapes with \n\nthe flying bison brought by Katara and Sokka. Aang and friends visit the Southern \n\nAir Temple where the Avatar learns that he was in the ice for a whole century and \n\nthe Fire Nation wiped out all Air Nomads, and so everyone he knew there. Because of \n\nthe despair he enters the Avatar state and finds himself for a brief moment in the \n\nspirit world where a voice asks him where he has been.\n\n\nComment : beside a slight inclination of the cam the picture is good and certainly watchable , nice codification work , enjoy ...","torrent":{"xt":"urn:btih:f1773f49582a2280846ab4d3d4b8807d22dce79f","amp;dn":"MOVIE+%C3%82%C2%BB+THE+LAST+AIRBENDER+%5BCAMSHOW%5D+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1773f49582a2280846ab4d3d4b8807d22dce79f","infoHashBuffer":{"type":"Buffer","data":[241,119,63,73,88,42,34,128,132,106,180,211,212,184,128,125,34,220,231,159]},"announce":[],"urlList":[]}}