{"title":"TOMMY BROWN-CLASSIC","uid":5786652,"size":137916738,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f1a584102d5c69d2051281eb9d4fc90d83314cd6&amp;dn=TOMMY+BROWN-CLASSIC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jonah111","files":27,"time":1282664233,"description":"1. Atlanta Boogie\n2. Baby Don't Leave Me\n3. Double Faced Deacon\n4. Fat Hardy's Tardy\n5. Fore Day Train\n6. Gambler's Prayer\n7. Goodbye Baby\n8. House Near The Railroad Track\n9. How Much Can I stand\n10. Never Trust A Woman\n11. No News From Home\n12. Nosey Neighbors \t13. Old Rocking Chair\n14. Remember Me\n15. Since You Left Me Dear\n16. Some Day Some Way\n17. Southern Woman\n18. The Honky Tonk\n19. The Thrill Is Gone\n20. Tra La La La La\n21. V-8 Baby Cadillac Baby\n22. Weeping and Crying\n23. Won't You Forgive Me\n24. You've Got A Heart\n25. You've Got To Deal Sometimes\n\ntarting out in the mid-1940s, Brown was influenced by Nat King Cole, Louis Jordan, T-Bone Walker, Cab Calloway and Ivory Joe Hunter, among others. He was first recorded in 1950 as the featured singer of Roy Mayes and his orchestra, on &quot;Fat Hardy's Boogie&quot; (Herald 104). The next year he had three releases on the Dot label, credited to &quot;The Griffin Brothers featuring Tommy Brown&quot;, all of which made the Billboard R&amp;B Top 10. The most successful of these was &quot;Weepin' And Crying&quot; (Dot 1071, reissued on Dot 16130 in 1960), which has Brown crying all through the song. It was a # 1 R&amp;B hit in early 1952 and gave him his nickname (Tommy &quot;Weepin' and Cryin'&quot; Brown).\n\nIn January 1951, Brown had his first recording session as a solo artist, resulting in two singles, one on Savoy and one on Regent (a subsidiary of the Savoy label). The Savoy single (813) featured &quot;V-8 Baby&quot; on one side, a song that has been recorded by several other artists, including Mike Sanchez (2003), but then under the title &quot;Women And Cadillacs&quot;. Responsible for the title change was James &quot;Doc&quot; Starkes, who recorded the song in 1954 (Apollo 460). Apparently Starkes thought that changing the title was sufficient justification for claiming authorship of the song, though it had been written by Brown. Tommy rerecorded the song for his 2004 CD &quot;Remember Me&quot; and this excellent new version can be heard at. (Allow some 15 seconds for automatic downloading.)\n\nAltogether, Brown had a dozen singles released under his own name, sometimes as Little Tommy Brown. These were mostly in the R&amp;B and blues field, but at least one single can be qualified as rock 'n' roll, namely his first Imperial single, &quot;Rock Away My Blues&quot;/&quot;Someday Somewhere&quot; (Imperial 5476), which was recorded in August 1957, in New Orleans, with accompaniment by Lee Allen, Red Tyler, Paul Gayten, Justin Adams, Frank Fields and Charles 'Hungry' Williams. Unfortunately, UK Decca failed to issue the record on London, but there was a Belgian London release (London 9.5.024, April 1958). Prior to that, in September 1956, Brown had recorded a vocal version of &quot;Honky Tonk&quot; (King 4976, with the Bill Doggett Combo), which is available on the CD &quot;King Rock 'n' Roll, Vol. 2&quot; (Ace 1051, released in 2005).","torrent":{"xt":"urn:btih:f1a584102d5c69d2051281eb9d4fc90d83314cd6","amp;dn":"TOMMY+BROWN-CLASSIC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a584102d5c69d2051281eb9d4fc90d83314cd6","infoHashBuffer":{"type":"Buffer","data":[241,165,132,16,45,92,105,210,5,18,129,235,157,79,201,13,131,49,76,214]},"announce":[],"urlList":[]}}