{"title":"My Little Pony: Friendship is Magic - Season 1 - 1080p MKV","uid":6467987,"size":20335405567,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f213503b5e39825c8ea42e0ce77cd762039d03b3&amp;dn=My+Little+Pony%3A+Friendship+is+Magic+-+Season+1+-+1080p+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BerretSO4","files":26,"time":1308033614,"description":"My Little Pony Friendship is Magic is an American animated television series that began airing on the United States cable channel, The Hub, in the last quarter of 2010. This incarnation of the Hasbro toy was developed for television by Lauren Faust, who had previously worked on the Cartoon Network series The Powerpuff Girls and Foster's Home for Imaginary Friends with their creator, her husband Craig McCracken. The show is produced by Studio B Productions, in association with Hasbro Studios.\n\nThe series stars a unicorn pony named Twilight Sparkle, who is a pupil of Equestria's ruler Princess Celestia. Seeing the young pony buried in books, the princess sends her to Ponyville and gives her the task of making friends. Along with her assistant, a baby dragon named Spike, she becomes friends with the tomboyish Rainbow Dash, glamorous Rarity, hard-working Applejack, timid Fluttershy, and hyperactive Pinkie Pie. Together they explore the ins and outs of the town and solve various problems. Each episode usually ends with Twilight Sparkle reporting back to Celestia on some aspect of friendship that she has discovered in the process, either through her own experience or by watching the other ponies.\n\nThis is all of Season 1, in 1080p, MKV format.","torrent":{"xt":"urn:btih:f213503b5e39825c8ea42e0ce77cd762039d03b3","amp;dn":"My+Little+Pony%3A+Friendship+is+Magic+-+Season+1+-+1080p+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f213503b5e39825c8ea42e0ce77cd762039d03b3","infoHashBuffer":{"type":"Buffer","data":[242,19,80,59,94,57,130,92,142,164,46,12,231,124,215,98,3,157,3,179]},"announce":[],"urlList":[]}}