{"title":"Democracy Now - 25 aug 2010","uid":5788760,"size":451831476,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f2bb80b3320e45b0c212489d443c18ca7b41a78c&amp;dn=Democracy+Now+-+25+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1282757326,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 25, 2010\n\n- 33 Killed, Dozens Wounded in Iraq Violence\n- Witnesses: 8 Afghan Civilians Killed in US Attack\n- Top US Marine: Withdrawal Deadline Boosting Taliban Morale\n- WikiLeaks Announces Release of CIA Paper\n- Study: Microbes Eating Up Oil in Gulf of Mexico\n- McCain Holds Off Challenger; Murkowski Trails in Alaska GOP Race\n- Rep. Meek Defeats Billionaire Challenger in Fla. Dem Senate\n- MSHA Fines Safety Violations at 4 Mines\n- Admin to Appeal Blocking of Stem Cell Funding\n- Report: NOLA Officers Ordered to Shoot Looters After Katrina\n- Carter Lands in North Korea to Free US Prisoner\n- Israeli FM: Settlement Construction to Resume Next Month\n- Texas School Rejects Admission for Daughter of Lesbian Couple\n\n\nSpecial reports\n\n- Judge Rejects Death Row Prisoner Troy Davis' Innocence Claim\n\nA federal judge in Georgia has rejected death row prisoner Troy Anthony Davis's claims of innocence. Last year the Supreme Court took the unusual step of ordering a district court in Georgia to hold a special evidentiary hearing to consider evidence that surfaced after Davis's conviction and might establish his innocence. Davis was convicted for the 1989 killing of an off-duty white police officer Mark MacPhail. Since then, seven of the nine non-police witnesses have recanted their testimony, and there is no physical evidence tying him to the crime scene.\n\n\n- As Five States Hold Primaries, A Look at the Role of Money in Politics\n\nVoters headed to the polls in Alaska, Arizona, Florida, Oklahoma and Vermont yesterday in a big day of state primaries. Florida Rep. Kendrick Meek defeated billionaire real estate mogul Jeff Greene in the state's Democratic Senate primary. But billionaire businessman Rick Scott pulled off an upset over Attorney General Bill McCollum in the Florida gubernatorial primary after spending $30 million on the race. We take at the role of money in those and other primary races with Charles Lewis, founder of the Center for Public Integrity.\n\n\n- The New Yorker: Billionaire Brothers Charles &amp; David Koch Have Quietly Given More Than $100 Million to Right-Wing Causes\n\nAn article in the latest issue of The New Yorker Magazine by Jane Mayer profiles billionaire brothers Charles and David Koch, two of the richest men in America who have quietly given more than a hundred million dollars to right-wing causes. Mayer writes, &quot;The [Koch] brothers have funded opposition campaigns against so many Obama Administration policies-from health-care reform to the economic-stimulus program-that, in political circles, their ideological network is known as the Kochtopus.&quot;\n\n\n- Shirley Sherrod, Ousted from Agriculture Department, Rejects Offer to Return\n\nShirley Sherrod, ousted from her job at the Agriculture Department last month, has rejected an offer to return to the USDA. Sherrod was forced out shortly after a right-wing website ran a video clip that was deceptively edited to make it appear that she was racist toward white farmers. Agriculture Secretary Tom Vilsack forced Sherrod to resign shortly after the video was posted. Vilsack met with Sherrod Tuesday morning to try and convince her to return to the department. The two also discussed a settlement pending in the Senate for black farmers who have been victims of racism. We speak with John Boyd, the founder and president of the National Black Farmers Association.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f2bb80b3320e45b0c212489d443c18ca7b41a78c","amp;dn":"Democracy+Now+-+25+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bb80b3320e45b0c212489d443c18ca7b41a78c","infoHashBuffer":{"type":"Buffer","data":[242,187,128,179,50,14,69,176,194,18,72,157,68,60,24,202,123,65,167,140]},"announce":[],"urlList":[]}}