{"title":"Iron Man 2 [2010][mov][DVDRip][File INFO optimized for iTunes]","uid":5811945,"size":1466637854,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f3340a2f1d55dae79f70447183567b0e46c5b51c&amp;dn=Iron+Man+2+%5B2010%5D%5Bmov%5D%5BDVDRip%5D%5BFile+INFO+optimized+for+iTunes%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"leonarth","files":1,"time":1283682320,"description":"Billionaire Tony Stark must contend with deadly issues involving the government, his own friends, as well as new enemies due to his superhero alter ego Iron Man.\n\nRobert Downey Jr. ... Tony Stark \nDon Cheadle ... Lt. Col. James 'Rhodey' Rhodes / War Machine \nScarlett Johansson ... Natalie Rushman / Natasha Romanoff \nGwyneth Paltrow ... Pepper Potts \nSam Rockwell ... Justin Hammer \nMickey Rourke ... Ivan Vanko \nSamuel L. Jackson ... Nick Fury \nClark Gregg ... Agent Coulson \nJohn Slattery ... Howard Stark \nJon Favreau ... Happy Hogan \nPaul Bettany ... Jarvis (voice) \nKate Mara ... U.S. Marshal \nLeslie Bibb ... Christine Everhart \nGarry Shandling ... Senator Stern \nChristiane Amanpour ... Herself\n\n\nResolution: 640*272\nAudio: ac3 448\nSource: DVD9\nimdb: http://www.imdb.com/title/tt1228705/\nnotes: no subs for foreign parts (only a couple lines)\nso you can watch this one or wait for subfix next week\n\n\nRobert Downey Jr was the best reason to watch the first Iron Man film since he seemed to slide into the role of Tony Stark so flawlessly and effortlessly. RDJ is just as amusing and fun to watch in Iron Man 2. If there were any doubts left over from RDJ's portrayal of Tony Stark from the first film, they're inevitably washed away with his convincing performance in the sequel. Newcomers Mickey Rourke, Sam Rockwell, and Scarlett Johansson are just as impressive. Rourke has been on an incredible streak since The Wrestler and puts in another solid performance here. His Russian accent is pretty spot on and he shows a wider range of emotion than you may not be expecting. Rockwell has been on my &quot;actors to keep an eye on&quot; radar since Confessions of a Dangerous Mind. I thoroughly enjoyed his smarmy performance as Hammer, who has all of the tools at his disposal to make as big of an impact on the world as Tony Stark has only to wind up falling short in the long run. The flirting between Tony and Johansson's Natalie Rushman is pretty captivating, but her crowning achievement is her fight scene in the latter half of the film that practically steals the show. Don Cheadle does have a few humorous one-liners and is great as War Machine, but doesn't really add anything that Terrence Howard already established with the role in the first film. It's slightly disappointing since Cheadle is known for his strong acting roles, but may be a result of the way the Capt. James Rhodes character was written for both films.\n\nWhile the film is a worthy sequel, it does contain a few small flaws. What is it with Hollywood films lately having the climactic battle during the finale last five minutes or less? Transformers: Revenge of the Fallen, Clash of the Titans, and Iron Man 2 all share this trait. It doesn't take away from the fact that the conclusion to Iron Man 2 is still pretty satisfying, but my mindset seems dead set on thinking it's more satisfying when the antagonist has the advantage. He or she gains the upper hand and there's that moment where you think they may bring their evil plan to fruition before the protagonist outsmarts the antagonist for the win. When that last battle seems short, it makes it seem like the villain was all talk. Speaking of the action sequences though, they're spectacular and twice as big as the action in the original film. The problem is that the action seemed to get blurry during several of the more hefty action scenes. I'm not sure if it's because it's the way it was shot or what, but it made it seem like there was too much going on in the film to fully process in post-production or something.\n\nIron Man 2 is an extremely satisfying sequel on all accounts. While the original film is probably slightly better, the sequel does everything right and doubles up on everything in comparison; action, strong characters, teases for upcoming Marvel films, etc. Despite some of its early negative criticism, Iron Man 2 delivers a worthwhile sequel with a fantastic cast and spectacular action.","torrent":{"xt":"urn:btih:f3340a2f1d55dae79f70447183567b0e46c5b51c","amp;dn":"Iron+Man+2+%5B2010%5D%5Bmov%5D%5BDVDRip%5D%5BFile+INFO+optimized+for+iTunes%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3340a2f1d55dae79f70447183567b0e46c5b51c","infoHashBuffer":{"type":"Buffer","data":[243,52,10,47,29,85,218,231,159,112,68,113,131,86,123,14,70,197,181,28]},"announce":[],"urlList":[]}}