{"title":"Resurrection: The Origin and Future of a Biblical Doctrine _F1_","uid":6496960,"size":915413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f33efee20b0b4314b0c942a1794a21393942db30&amp;dn=Resurrection%3A+The+Origin+and+Future+of+a+Biblical+Doctrine+_F1_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1309109354,"description":"James H. Charlesworth, &quot;Resurrection: The Origin and Future of a Biblical Doctrine&quot;\nT&amp;T Clark Int'l | 2008 | ISBN: 0567027481 | 272 pages | PDF | 1 MB\n\nResurrection is the central feature of the New Testament gospels and lies at the center of many of Paul's letters as well. In addition, the doctrine of the resurrection lies at the core of the Christian church's faith. The essays in this stunning collection explore the idea of resurrection as the idea appears not only in the New Testament texts but also in the Dead Sea Scrolls, the pseudepigraphal Testaments of the Twelve Patriarchs, and in contemporary theology. Charlesworth asks where the concept of resurrection appears and the ways we know it, and he also examines the concept of resurrection in the Dead Sea Scrolls and the New Testament. Casey Elledge explores the earliest evidence we have for a notion of a resurrection of the dead and investigates the hope for Israel in Judaism and Christianity found in the Testaments. Crenshaw looks at the Hebrew Bible's ideas of resurrection, and Hendrikus Boers examines the meaning of Christ's resurrections in Paul's writings. W. Waite Willis explores a theology of resurrection. ","torrent":{"xt":"urn:btih:f33efee20b0b4314b0c942a1794a21393942db30","amp;dn":"Resurrection%3A+The+Origin+and+Future+of+a+Biblical+Doctrine+_F1_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f33efee20b0b4314b0c942a1794a21393942db30","infoHashBuffer":{"type":"Buffer","data":[243,62,254,226,11,11,67,20,176,201,66,161,121,74,33,57,57,66,219,48]},"announce":[],"urlList":[]}}