{"title":"SORDID_LIVES_SERIES","uid":6386680,"size":13594343424,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f3a3eb0b3911a7b5bee66d2c30f4bb2fa1d03ce7&amp;dn=SORDID_LIVES_SERIES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bobbers602","files":125,"time":1305224014,"description":"Matriarch Peggy Ingram (Rue McClanahan) takes in the town bar singer Bitsy Mae Harling (Olivia Newton-John) who has just been released from prison. Peggy's wild child daughter LaVonda (Ann Walker) lives with Peggy's chain-smoking sister Sissy (Beth Grant), while Peggy's good girl Latrelle (Bonnie Bedelia) maintains an image of seeming perfection.\nPeggy's third child, Earl &quot;Brother Boy&quot; Ingram (Leslie Jordan), is locked in a mental institution where he performs as Tammy Wynette. He plots to escape while he attends therapy sessions with the crazy Dr. Eve (Rosemary Alexander) who believes she can dehomosexualize him.\nLaVonda's white trash best friend Noleta (Caroline Rhea) lives in a trailer in Sissy's backyard with her husband G.W. (David Steen), a Vietnam veteran with two wooden legs. G.W. escapes regularly to the local bar in town amidst a small crowd of regulars including brothers Wardell (Newell Alexander) and Odell (David Cowgill), Bitsy Mae, and the bar's resident drunk Juanita (Sarah Hunley).\nLatrelle's son Ty (Jason Dottley) is an actor living in Los Angeles and struggling with several therapists (including ones played by Margaret Cho, Carson Kressley, and Candis Cayne) to come to terms with his homosexuality. Along the way he deals with his first boyfriend (Ted Detwiler), his stalker ex-girlfriend (Sharron Alexis), a vengeful trick (Emerson Collins), and the difficulty of coming out to his straight best friend (Robert Lewis Stephenson) and his family back in Texas.\n\nComplete series - 3 discs.\n\nEnjoy!\n\nPlease seed!","torrent":{"xt":"urn:btih:f3a3eb0b3911a7b5bee66d2c30f4bb2fa1d03ce7","amp;dn":"SORDID_LIVES_SERIES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3a3eb0b3911a7b5bee66d2c30f4bb2fa1d03ce7","infoHashBuffer":{"type":"Buffer","data":[243,163,235,11,57,17,167,181,190,230,109,44,48,244,187,47,161,208,60,231]},"announce":[],"urlList":[]}}