{"title":"Phil Ochs...There But for Fortune(1990)[FLAC]","uid":5781545,"size":390788692,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f3be4455f2c4eaf1654eb17556b5cd4c48744a69&amp;dn=Phil+Ochs...There+But+for+Fortune%281990%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":23,"time":1282429541,"description":"Audio CD (October 25, 1990) \nOriginal Release Date: March 28, 1989 \n\n1. What's That I Hear?   \n2. One More Parade - Phil Ochs, Gibson, Bob   \n3. Too Many Martyrs - Phil Ochs, Gibson, Bob  \n4. Power and the Glory   \n5. I Ain't Marching Anymore - Phil Ochs, Gibson, Bob   \n6. Draft Dodger Rag  \n7. The Highwayman  \n8. Here's to the State of Mississippi   \n9. There But for Fortune  \n10. I'm Going to Say It Now  \n11. Is There Anybody Here?   \n12. Cops of the World  \n13. Ringing of Revolution   \n14. Santo Domingo  \n15. Bracero   \n16. Love Me, I'm a Liberal  \n17. Changes   \n18. When I'm Gone   \n\nPhil came along shortly after Dylan in the mid-60's, and when Dylan went to rock, Phil stayed in the urban protest mode, pleasing those of us (alas, too few) who were not ready to follow Bob into electrification and non-political topics. I saw Phil in concert around l965, and he was wonderful. This disc has an excellent sampling of his most accessible and powerful songs. There are a few really good ones missing, but this is a fine collection to start with, or to have if you can only afford one item. Phil didn't have the best voice, or the best stage presence, or the best business sense of the 60's singers, but he wrote some wonderful things...&quot;Power and the Glory&quot; and &quot;I Ain't Marching Anymore&quot; and &quot;Draft Dodger Rag&quot; are excellent pacifistic promotions. &quot;Here's to the State of Mississippi&quot; has to be the most powerful put-down of an entire state ever written, and Phil isn't joking when he describes the tragedy of that area's racist culture of the time. &quot;There But For Fortune&quot; is one of his most famous and copied tunes, and will always be relevant and influential. I can go on and on...almost every selection here is high-quality. He didn't just savage right-wing white racists...&quot;Love Me, I'm a Liberal&quot; has plenty of bite as well. For a change of pace, &quot;Changes&quot; is just plain beautiful, and given the fact of his alcoholic-haze suicide when his career was over, the anthem &quot;When I'm Gone&quot; is heartbreaking...but a gem as well. Anyone interested in singer/songwriters as a class, and the 1960's in particular, has to own something by Phil. He is unfairly neglected now, and it is a shame\n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:f3be4455f2c4eaf1654eb17556b5cd4c48744a69","amp;dn":"Phil+Ochs...There+But+for+Fortune%281990%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3be4455f2c4eaf1654eb17556b5cd4c48744a69","infoHashBuffer":{"type":"Buffer","data":[243,190,68,85,242,196,234,241,101,78,177,117,86,181,205,76,72,116,74,105]},"announce":[],"urlList":[]}}