{"title":"Violin Adagios","uid":6480932,"size":229131329,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f3ebd9a1a4374d60918c87660964ab9823cbcc75&amp;dn=Violin+Adagios&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Black1000","files":-1,"time":1308512602,"description":"Violin Adagios.2CDs\n\nCD1\n\n01. Meditation - with Jules Massenet, Nigel Kennedy, National Philharmonic Orchestra\n02. Adagio - with Kempe Rudolf, Max Bruch, Kyung Wha Chung, Royal Philarmonic Orchestra\n03. Largo - with Alan Loveday, Academy Of St. Martin In The Fields, Neville Marriner, Antonio Vivaldi\n04. Largo, ma non tanto - with Maurice Hasson, Academy Of St. Martin In The Fields, Henryk Szeryng, Neville Marriner, Johann Sebastian Bach\n05. Adagio in E major for Violin and Orchestra - with Wolfgang Amadeus Mozart, Henryk Szeryng, New Philharmonia Orchestra, Alexander Gibson\n06. Vocalise - with Akiko Suwanai, Philip Moll, Sergey Rachmaninov\n07. Adagio - with Christoph von Dohnanyi, Johannes Brahms, Joshua Bell, Cleveland Orchestra8.Andante - with Baltimore Symphony Orchestra, David Zinman, Joshua Bell\n09. Melodie - with Gluck, Arthur Grumiaux, Robert Hajduk\n10. Adagio molto espressivo - with Ludwig Van Beethoven, Itzthak Perlman, Vladimir Ashkenazy\n11. Canzonetta: Andante - with Leila Josefowicz, Academy Of St. Martin In The Fields, Neville Marriner, Pyotr Il'yich Tchaikovsky\n12. Songs my mother taught me - with Arthur Grumiaux, Robert Hajduk\n13. None but the lonely heart - with London Festival Orchestra, Pyotr Il'yich Tchaikovsky\n14. Romance - with Maxim Shostakovich, Alex Kerr, Royal Concertgebouw Orchestra, Riccardo Chailly\n\nCD2\n\n01. Romance No. 2 in F major - with Philharmonia Orchestra\n02. Adagio - with Midori\n03. Sault d'amour - with Edward Elgar, Kyung Wha Chung\n04. Ave Maria - with Franz Schubert\n05. Larghetto - with Antonio Vivaldi, Pinchas Zukerman, Paul Chambers/Cannonball Adderley\n06. Larghetto - with Frideric George Handel, Iona Brown, Academy Of St. Martin-In-The-Fields\n07. Adagio - with Wolfgang Amadeus Mozart, Arthur Grumiaux, London Symphony Orchestra, Colin Davis\n08. Liebeseid - with Kreisler, Joshua Bell, Joe Cocker9.Andante - with Felix Mendelssohn Bartholdy, Kyung Wha Chung, Orchestre Symphonique De Montr?al, Charles Dutoit\n10. Melodie - with Suwanai/Moll, Pyotr Il'yich Tchaikovsky\n11. Adagio di molto - with Jean Sibelius, Kyung Wha Chung, London Symphony Orchestra, Andre Previn\n12. Romance: Andante - with Korngold, Juilet, Rundfunkchor Leipzig/Rundfunk-Sinfonie-Orchester Leipzig, John Mauceri\n13. Standchen - with Franz Schubert, Arthur Grumiaux, Robert Hajduk\n14. Estrellita - with Manuel Maria Ponce, Arthur Grumiaux, Robert Hajduk\n15. Air on a G string - with Academy Of St. Martin In The Fields, Neville Marriner, Johann Sebastian Bach\n","torrent":{"xt":"urn:btih:f3ebd9a1a4374d60918c87660964ab9823cbcc75","amp;dn":"Violin+Adagios","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3ebd9a1a4374d60918c87660964ab9823cbcc75","infoHashBuffer":{"type":"Buffer","data":[243,235,217,161,164,55,77,96,145,140,135,102,9,100,171,152,35,203,204,117]},"announce":[],"urlList":[]}}