{"title":"Leonard Bernstein: Musical Phonology [1973 at Harvard]","uid":5819490,"size":1468535418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f3fecd32787ba93188a8f36aceb59cf30a8a3ad5&amp;dn=Leonard+Bernstein%3A+Musical+Phonology+%5B1973+at+Harvard%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ill88eagle","files":4,"time":1283992003,"description":"First out of six lectures on music and linguistics given at the harvard university in 1973 by Leonard Bernstein.\n\n********** This is a repost of an old torrent woth reviving **********\n\nOriginal description (not mine)\n\nAt the beginning of his first Norton Lecture, Leonard Bernstein explained the importance of &quot;inter-disciplinary values - that the best way to 'know' a thing is in the context of another discipline.&quot; In these six lectures, Bernstein communicated his ideas of the universality of musical language through wide-ranging analogies to linguistics, aesthetic philosophy, acoustics as well as music history. However, while many of his ideas are intellectually challenging, the great achievement of the lectures is that through their breadth they make complex musical concepts accessible to a general audience.\nLeonard Bernstein was invited to become the Charles Eliot Norton Professor of Poetry at Harvard University in 1971. This one-year position had previously been held by such notable musical figures as Igor Stravinsky and Aaron Copland, and by poets such as e.e. cummings and W.H. Auden. The professorship required Bernstein to live on campus for one school year, counsel students and, most significantly, deliver of a series of six public lectures. Bernstein, a &quot;Harvard man&quot; himself, was pleased and honored to become a part of this distinguished tradition.\nBernstein began his residency at Harvard in the fall of 1972. He immersed himself in the academic culture with enthusiasm, and his popularity with students resulted in his being named &quot;Man of the Year&quot; by Harvard's student newspaper. His daughter Jamie was an undergraduate at Radcliffe at the time, so his involvement in the University's student life had special meaning for him.\nBernstein was scheduled to give the six lectures in the spring of 1973, but with a full schedule of various composing projects and conducting engagements, he postponed the lectures until the fall. Preparing for the lectures was no small undertaking, and Bernstein wanted to have the time to make the most of this unique opportunity.\nBecause the lectures embraced such a wide variety of disciplines, Bernstein faced the challenge of organizing his ideas into a coherent progression of six talks. Also, every word had to be written out and memorized because each of the lectures was to be presented twice: live at the University and then in a subsequent taping session for television.\nBernstein used hundreds of musical examples during the course of the lectures. Many of these he could play on the piano, but each lecture also featured Bernstein conducting entire movements and even complete works. These needed to be rehearsed and then filmed for presentation during the lectures. The Boston Symphony Orchestra and the Vienna Philharmonic were employed for this purpose.\nThe first lecture, on October 9, 1973 began with Bernstein referring to Copland's Piano Variations, a work he had fallen in love with as an undergraduate at Harvard. He recalled his discovery that the four germinal notes of this work were also seed for other pieces ranging from a Bach fugue to Stravinsky's Octet to something Bernstein heard played by the Uday Shan-kar Dance Company. &quot;From that time,&quot; Bernstein confessed, &quot; ...the notion of a worldwide, inborn musical grammar has haunted me.&quot;\nBernstein based much of the lectures on the linguistic theories Noam Chomsky set out in his book, &quot;Language and Mind.&quot; In the first three lectures, Bernstein analyzed music in linguistic terms phonology (sound), syntax (structure) and semantics (meaning)--focusing on music from the Classical period. In the fourth lecture (&quot;The Delights and Dangers of Ambiguity&quot;), Bernstein looked at music from the Romantic period, with its heightened harmonic uncertainties and structural freedoms. The fifth lecture (&quot;The Twentieth Century Crisis&quot;) outlined the movement toward atonality and the crisis provoked by this crucial change in our musical language. Charles Ives' &quot;The Unanswered Question,&quot; one of the primary musical examples, became Bernstein's title for the entire series of lectures. The final lecture (&quot;The Poetry of the Earth&quot;) concentrated on the work of Igor Stravinsky, whom Bernstein thought had found a musical answer to &quot;the unanswered question,&quot; one that kept tonality at its center. The series ended with Bernstein's artistic and philosophical &quot;credo,&quot; an essentially optimistic and celebratory statement of beliefs.\nAlthough the very breadth of the lectures attracted some negative criticism, they were also widely recognized as an impressive achievement. Lavishly multi-disciplinary long before it was fashionable, they provided a fresh way to analyze music and interpret musical history. The Norton Lectures stand as a special monument in Bernstein's legacy.\n\nFor a preview or two go here: http://muckypig.com/thepigpen/showthread.php?tid=1556&amp;pid=39033#pid39033","torrent":{"xt":"urn:btih:f3fecd32787ba93188a8f36aceb59cf30a8a3ad5","amp;dn":"Leonard+Bernstein%3A+Musical+Phonology+%5B1973+at+Harvard%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3fecd32787ba93188a8f36aceb59cf30a8a3ad5","infoHashBuffer":{"type":"Buffer","data":[243,254,205,50,120,123,169,49,136,168,243,106,206,181,156,243,10,138,58,213]},"announce":[],"urlList":[]}}