{"title":"The Italian Job(2003)DVDRip.AC3(ENG)-DROCK","uid":6477359,"size":733663154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f4197f717473f4d51407df53916da946dd995c22&amp;dn=The+Italian+Job%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1308356634,"description":"A team of high-class thieves avenge their mentor\\'s death -- with the help of his own daughter -- in this big-budget remake of the 1969 British caper classic. The Italian Job stars Mark Wahlberg as Charlie, the mastermind of a daring Venice heist overseen by John (Donald Sutherland), a lifelong criminal who plans to retire from the fold with the earnings from his most recent take. Basking in the glow of a job well done at a secluded retreat in the Alps, the thieves -- including the aptly-named Handsome Rob (Jason Statham), tech-geek Lyle (Seth Green), and hearing-impaired quipster Left Ear (Mos Def) -- are ruthlessly double-crossed by one of their own, the taciturn, calculating Steve Frezelli (Edward Norton). Time passes and each member of the group finds himself pursuing other opportunities in the States, until Charlie rallies them together for a revenge-motivated scheme designed to bilk Steve of all his misbegotten earnings. In order to cinch the deal, he even enlists John\\'s reluctant safecracking-prodigy daughter, Stella (Charlize Theron), for an elaborate, incognito Los Angeles heist. But the paranoid Steve proves himself to be one step ahead of them at just about every turn, and Charlie finds that he\\'ll have to make some daring last-minute changes to their plan if the team is to succeed. The Italian Job marked director F. Gary Gray\\'s second 2003 release after the Vin Diesel vehicle A Man Apart. \n\nRipped with Handbrake.\n\nLength: 1 Hour 50 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:f4197f717473f4d51407df53916da946dd995c22","amp;dn":"The+Italian+Job%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4197f717473f4d51407df53916da946dd995c22","infoHashBuffer":{"type":"Buffer","data":[244,25,127,113,116,115,244,213,20,7,223,83,145,109,169,70,221,153,92,34]},"announce":[],"urlList":[]}}