{"title":"Coast to coast AM 2011-05-10 Psy-Ops in America","uid":6384377,"size":55177203,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f669bc50245cb3bf47a3b74dab6010ef07414b2a&amp;dn=Coast+to+coast+AM+2011-05-10+Psy-Ops+in+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1305146521,"description":"Coast to coast AM 2011-05-10\nPsy-Ops in America\n\nDate: 05-10-11 \nHost: George Noory \nGuests: Dr. Steve Pieczenik, Deirdre Marie Capone \nAuthor of psycho-political thrillers, Dr. Steve Pieczenik was trained in psychiatry at Harvard University and international relations at M.I.T. Appearing during the middle two hours, he discussed how Psy-ops are being used against the American People on several fronts, along with various deceptions and false flags in foreign policy matters. The biggest national security problem we have in the US is the weak financial system, and ineffective intelligence, he commented. \n\n&quot;I have no idea,&quot; why Obama would do this, Pieczenik said of what he called a psychological operation (psy-op)-- the story of bin Laden being killed by US forces in Pakistan. Osama bin Laden was known to suffer from Marfarn syndrome (a genetic disorder that dramatically shortens lifespan), as well as receiving kidney dialysis treatments. The storyline that bin Laden was alive in 2001 and attacked our country is a falsity, born out of the need for the US to create a boogeyman, and justify wars, he continued. \n\nThe 9-11 attack was another false flag operation, and the US administration is considered weak and ineffectual by Europe, who note inconsistencies such as Obama getting the Nobel Peace Prize and then going to war in Afghanistan, he added. Pieczenik also talked about his ongoing collaboration with Tom Clancy for a series of novels. \n\nThe last hour of the show featured 'Sound Off' Open Lines.\n\n\nGrowing Up Capone\nFirst hour guest, Deirdre Marie Capone, the grand niece of Al Capone, described what it was like growing in the famous crime family. Raised in Chicago, she was ostracized by her classmates because of her name, and later moved to Minnesota where no one knew about her background as a Capone. After the death of all the members of her family involved in the Mob, she decided to come clean about who she was, with the publication of her book Uncle Al Capone. In the book, she defends his role as a successful businessman, and characterized him as a &quot;mobster rather than a monster.&quot; \n\nNews segment guests: Lauren Weinstein, Steve Kates \n\nWebsite(s): \nstevepieczenik.com\nunclealcapone.com\nBook(s): \nUncle Al Capone\n","torrent":{"xt":"urn:btih:f669bc50245cb3bf47a3b74dab6010ef07414b2a","amp;dn":"Coast+to+coast+AM+2011-05-10+Psy-Ops+in+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f669bc50245cb3bf47a3b74dab6010ef07414b2a","infoHashBuffer":{"type":"Buffer","data":[246,105,188,80,36,92,179,191,71,163,183,77,171,96,16,239,7,65,75,42]},"announce":[],"urlList":[]}}