{"title":"Genesis-Los Endos (Live-Vh1 Rock Honors 2007)(Xvid-2nafish)","uid":5769100,"size":121497566,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f68b764c1740b8f5345591812650a229554152ce&amp;dn=Genesis-Los+Endos+%28Live-Vh1+Rock+Honors+2007%29%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282038054,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:06:54\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2026 Kbps\nQuality Factor : 0.18 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\n&quot;Los Endos&quot; is an instrumental piece by English progressive rock band Genesis from their 1976 album A Trick of the Tail. It is one of the band's few forays into the world of jazz fusion and reflects drummer Phil Collins's involvement in the instrumental band Brand X. As the title suggests, the song was featured at the end of the album, and it was also featured at the end of Genesis's concerts, usually as a medley with &quot;Dance on a Volcano&quot; and a drum duet between Collins and Chester Thompson in between. 'Los endos' is not any actual phrase in Spanish or in any other language.\n\nThe song contains excerpts from three other songs recorded during the Trick of the Tail sessions: The intro is from &quot;It's Yourself,&quot; a song which appeared as the B-side to &quot;Ripples&quot; (as well as &quot;Your Own Special Way&quot; from the Wind &amp; Wuthering album in 1976.) The closing section features riffs and melodies from &quot;Dance on a Volcano&quot; and &quot;Squonk&quot;.\n\nDuring the fade out of the song, Phil Collins sings &quot;There's an angel standing in the sun...There's an angel standing in the sun / free to get back home.&quot; These lines are from the &quot;As Sure as Eggs Is Eggs (Aching Men's Feet)&quot; section of &quot;Supper's Ready&quot; from 1972's Foxtrot. The band included these lyrics in &quot;Los Endos&quot; as an homage to original lead vocalist Peter Gabriel, who had left the band in 1975.\n\nThe reprise of &quot;Dance on a Volcano&quot; at the end of &quot;Los Endos&quot; gives the album a bookend effect that is found on other Genesis albums, such as Selling England by the Pound, Seconds Out (Reprising motifs from &quot;Squonk&quot;, which is the third song of the album) and Duke.\n\n&quot;Los Endos&quot; became a live favourite. It was kept consistently in the setlist from the Trick of the Tail tour in 1976 up to the Invisible Touch tour in 1986-1987. It was dropped for the Way We Walk tour in 1992, the last tour with Phil Collins for 15 years. It was returned to the setlist for the band's comeback tour, Turn It On Again, in 2007.\n\nThe song was first performed in 1976 as it is heard on the album. From 1977-1981, the song was performed in the medley with &quot;Dance on a Volcano&quot;. From 1982 afterwards, &quot;Dance on a Volcano&quot; was excised and the medley was kept as &quot;Drum Duet / Los Endos&quot;.\n\nA live version of &quot;Los Endos&quot; from the 1976 tour featuring former Yes and King Crimson drummer Bill Bruford appears on Genesis: In Concert, Seconds Out, the Encore Series recordings of Turn It On Again: The Tour and Live Over Europe 2007. It was also featured on Genesis' 3-disc compilation album Platinum Collection as one of three cuts from A Trick of the Tail (along with &quot;Ripples&quot; and &quot;A Trick of the Tail&quot;), remixed by Nick Davis.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f68b764c1740b8f5345591812650a229554152ce","amp;dn":"Genesis-Los+Endos+%28Live-Vh1+Rock+Honors+2007%29%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f68b764c1740b8f5345591812650a229554152ce","infoHashBuffer":{"type":"Buffer","data":[246,139,118,76,23,64,184,245,52,85,145,129,38,80,162,41,85,65,82,206]},"announce":[],"urlList":[]}}