{"title":"The Whispered World [pcgame-Eng-Ita] [Tntvillage]","uid":5781024,"size":2448099328,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f71cd9f2a14cb8d888de9046aae49efcc4e1f9f6&amp;dn=The+Whispered+World+%5Bpcgame-Eng-Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1282403587,"description":"The Whispered World [pcgame-Eng-Ita] [Tntvillage]\n &lt;a href=&quot;\nhttp://img820.imageshack.us/img820/3631/cot.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img820.imageshack.us/img820/3631/cot.jpg&lt;/a&gt;\n\nData di uscita: 28 agosto 2009\nSviluppato da Daedalic Entertainment\nPubblicato da Deep Silver\nDistribuito da Koch Media\nGenere: Avventura\nformato: 1 DVD5\nLingua: Inglese con menu e sottotitoli in Italiano.\n\nVisit this link: \n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220854&amp;view=findpost&amp;p=12279913&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220854&amp;view=findpost&amp;p=12279913&lt;/a&gt;\n\nVisit this link: http://translate.google.com/?hl=en&amp;sl=auto&amp;tl=en#\n\n.::.Recensione.::.\n\nSadwick ÃƒÂ¨ un clown triste. Come lo sono in realtÃƒÂ  tutti i clown, a meno che non siano del tipo psicopatici e rapinatori, nel qual caso se la spassano un mondo, piacciono a tutti e possono attirare l'attenzione di uomini pipistrello. Sadwick invece, non solo ÃƒÂ¨ depresso e sconsolato, ma nessuno crede in lui, cosÃƒÂ¬ che il ciclo dello scoraggiamento si autoalimenta. La sua vita ÃƒÂ¨ limitata alle attivitÃƒÂ  di un circo fallimentare, tra gli ordini del fratello Ben e le inutili farneticazioni del nonno oramai troppo avanti con gli anni per poter essere determinante.\nIl nostro arrivo nella sua vita coincide perÃƒÂ² con l'inizio di un sogno simile a una visione, che mette in guardia da un'Apocalisse imminente, della quale questo saltimbanco blu dovrebbe essere la causa. Da tale premessa prende il via un'avventura fiabesca dai toni crepuscolari, epica e malinconica. Sadwick infatti, accompagnato da un vermiciattolo verde dall'eterno sorriso ebete, ha deciso di provare a influenzare il fato e divenire suo malgrado il fulcro della salvezza universale. A modo suo naturalmente, senza toni esaltanti e perseguitato da un nichilismo novecentesco.\n &lt;a href=&quot;\nhttp://img685.imageshack.us/img685/9905/24633206.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img685.imageshack.us/img685/9905/24633206.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img440.imageshack.us/img440/8250/73263873.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img440.imageshack.us/img440/8250/73263873.jpg&lt;/a&gt;\n\nPigra contemplazione della fine\nInizialmente The Whispered World puÃƒÂ² dare l'impressione di essere un'avventura allegra, con fondali che pescano da una tavolozza di colori vividi. In realtÃƒÂ  dopo meno di un'ora si percepisce una sensazione di imminenza; qualcosa di inesorabile deve accadere, come la morte, che attende all'orizzonte della vita, anche quand'ÃƒÂ¨ cosÃƒÂ¬ distante da sembrare irreale.\nSu queste tonalitÃƒÂ  oscure si assesta l'umore dell'avventura, e da queste non prende piÃƒÂ¹ le distanze. L'umorismo diventa quindi la camera di decompressione dell'angoscia. Alcuni dialoghi sembrano infatti pensati apposta per dare respiro al giocatore, come il geniale incontro con i due sassi parlanti. Si tratta di momenti leggeri che non rompono il patto di serietÃƒÂ  che il gioco stabilisce fin dall'inizio con l'utente. Nessuna battuta sopra le righe o fuori contesto; nulla che possa rendere ridicolo o grossolano un personaggio o la situazione. In questo bilanciamento tra momenti solari e nostalgica rassegnazione degli abitanti del mondo, emerge la potenza allegorica di The Whispered World. La storia nel suo complesso si divide in quattro atti, ognuno dei quali ci porta un passo sempre piÃƒÂ¹ lontano dal punto di partenza, in un crescendo di pathos e complessitÃƒÂ  degli enigmi. Da questo punto di vista, tutte le meccaniche sono quelle che potreste ritrovare in un'avventura punta e clicca di quindici anni fa. Le uniche differenze sono la possibilitÃƒÂ  di individuare in un colpo solo gli hot-spot premendo un tasto (innovazione degli ultimi anni), e il ruolo del lombrico sempre felice che vi accompagna: questo simpatico invertebrato puÃƒÂ² infatti gonfiarsi e sgonfiarsi a piacere e addirittura tramutarsi in un cerino vivente, offrendo cosÃƒÂ¬ ulteriori possibilitÃƒÂ  di interazione. Gli enigmi sono abbastanza difficili rispetto alla media delle avventure, ma non vi troverete di fronte a brusche impennate di complessitÃƒÂ , di quelle che bloccano per due giorni in un punto. In ogni caso ci sono almeno una decina di puzzle che richiedono un po' di ragionamento in piÃƒÂ¹ per poter essere risolti.\n &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/1606/85933823.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/1606/85933823.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img534.imageshack.us/img534/1999/48567292.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img534.imageshack.us/img534/1999/48567292.jpg&lt;/a&gt;\n\nSul sentiero qualche sasso di troppo\nAnche le debolezze di The Whispered World sono evidenti fin da subito. La prima ÃƒÂ¨ senza dubbio il doppiaggio. Sadwick parla con una voce strascicata e impastata, inizialmente insopportabile. Per fortuna con il passare delle ore l'orecchio si abitua e tende a non farci piÃƒÂ¹ caso. Al primo ascolto perÃƒÂ², l'effetto ÃƒÂ¨ scoraggiante. Lo stesso vale per le animazioni dei personaggi, che avrebbero potuto essere splendide se solo fossero arrivate a un livello di fluiditÃƒÂ  accettabile. ÃƒË† chiaro che questo dipende da un problema di budget e tempistiche, perchÃƒÂ© la capacitÃƒÂ  delle persone che ci hanno lavorato ÃƒÂ¨ evidente. Un altro difetto invece ÃƒÂ¨ di tipo strutturale: in tutto l'arco della storia non si stabilisce mai un solido legame con nessuno dei pochi personaggi presenti (basti pensare che di tutta una compagnia circense sono presenti solo il fratello di Sadwick e il nonno). Il mondo si presenta come una carrellata di schermate splendide ma prive di vita e organicitÃƒÂ . Si procede senza lasciarsi niente alle spalle, e ci sono momenti in cui sembra di essere sospesi in attesa che la storia riprenda a ingranare e qualcuno si accorga di noi. In ogni caso la soliditÃƒÂ  generale e la coerenza dello stile con il quale questa fiaba ÃƒÂ¨ narrata ne fanno un titolo appassionante e di spessore. Inoltre ÃƒÂ¨ interamente sottotitolato in italiano.\n &lt;a href=&quot;\nhttp://img121.imageshack.us/img121/3286/34491699.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img121.imageshack.us/img121/3286/34491699.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img825.imageshack.us/img825/5048/18483511.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img825.imageshack.us/img825/5048/18483511.jpg&lt;/a&gt;\n\nCOMMENTO\nLa seconda prova di Daedalic ricalca in tutto e per tutto lo stile dei punta e clicca storici degli anni Ottanta. A partire da una meccanica classica perÃƒÂ², sviluppa una storia malinconica e crepuscolare, rara in questo genere di giochi. The Whispered World narra infatti il canto del cigno di un mondo che ripone le sue ultime speranze nell'antieore Sadwick, un clown depresso e sconsolato. Nonostante questo tono dimesso, il gioco regala piÃƒÂ¹ di un momento di spontanea ilaritÃƒÂ , scatenata dalle battute brillanti di alcuni dei personaggi che si incontrano lungo il cammino. Anche se non ÃƒÂ¨ privo di difetti, il racconto allegorico di The Whispered World merita l'attenzione di chi vuole vivere una storia fantastica con piÃƒÂ¹ di un aggancio alla vita reale.\n\nVisit thelink:\n\nInstallazione:\n1. Monta o masterizza l'immagine\n2. Installa il gioco\n3. copia il file TWW.exe dalla cartella SKIDROW e incollalo nella cartella di installazione del gioco sovrascrivendo quello esistente.\n\nPer la conversione dei sottotitoli in italiano esegui il file [CNV]The-Whispered-World[TESTO][TBH] (per gli utenti di vista e seven occhio alle istruzioni durante l'esecuzione della conversione).\n\nRequisiti Minimi:  \nWindows XP / Vista\nProcessore: 2.0 GHz o superiore\nRAM: 1 GB\nScheda video: 256 MB compatibile con DirectX 9.0c\nDirectX: Versione 9.0c o superiore\nScheda audio: compatibile con DirectX 9.0c\n\nConfigurazione di Prova:\nProcessore: Intel Core 2 Quad Q6600\nRAM: 2 GB\nScheda video: GeForce 8800 GT\nSistema operativo: Windows Vista\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:f71cd9f2a14cb8d888de9046aae49efcc4e1f9f6","amp;dn":"The+Whispered+World+%5Bpcgame-Eng-Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71cd9f2a14cb8d888de9046aae49efcc4e1f9f6","infoHashBuffer":{"type":"Buffer","data":[247,28,217,242,161,76,184,216,136,222,144,70,170,228,158,252,196,225,249,246]},"announce":[],"urlList":[]}}