{"title":"Gran Torino [2008]RTB.NLSub.CBCS.SH@R","uid":6467005,"size":4614155493,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f7233ec94ed045be072204d337a6630420b27eca&amp;dn=Gran+Torino+%5B2008%5DRTB.NLSub.CBCS.SH%40R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CBCS","files":-1,"time":1307995325,"description":"THIS IS A TEST&gt;THIS IS A TEST\n\nGran Torino [2008]RTB.NLSub.CBCS.SH@R\n\n\nDit is een test.\t\n==================\n\nWij hebben deze film in DVD bestand omgezet.\n\nWij noemen dat een &quot;RTB&quot; film\n\nDeze Torrent-naam heeft de navolgende betekenis:\n\nGran Torino is de naam van de film\n\n[2008] is het jaar dat de film werd uitgebracht\n\nRTB staat voor 'Ready To Burn' \n\n1080p staat voor resolutie van de film\n\nBluRay staat voor BluRay\n\nNL.Sub staat voor Nederlandse ondertiteling\n\nCBCS.SH@R staat voor uploader\n\nDe bedoeling is dat, nadat je deze film hebt gedownload, het complete bestand kan 'slepen' naar je brandprogramma (bijvoorbeeld 'Nero'), waarna je de film op je eigen televisie kan zien met behulp van je DVD speler.\n\nWij willen graag weten wat jullie ervaring is bij het downloaden, het branden van de film en het zien van de film op jullie televisie (of computer) en of wij hier mee door moeten gaan.\n\nWe zitten wel in een testfase en daarom is je mening (liefst in het Nederlands) voor ons erg belangrijk.\n\nDus na het downloaden NIET afhaken maar zoveel mogelijk blijven 'seeden' zodat anderen dezelfde film sneller kunnen binnenhalen en hun commentaar kunnen geven.\nNa ongeveer 50 reacties (30 dagen na de upload) zullen wij bekijken of het zinvol is om hiermee door te gaan.\n\nOp dit moment is het (nog) niet mogelijk de film als zodanig nog beter te krijgen dan wat wij al hebben geupload als MP4 of AVI.\n\nIndien er al positieve reacties binnenkomen, zullen wij nog 3 films (Nederlands ondertiteld) op deze manier presenteren, t.w. 300 en Sarahs Key.\n\n\n\n\nGran Torino (2008)\n\n116 min  -  Drama   -  12 March 2009 (Netherlands)\n\nDisgruntled Korean War vet Walt Kowalski sets out to reform his neighbor, a young Hmong teenager, who tried to steal Kowalski's prized possession: his 1972 Gran Torino.\n\nDirector: \nClint Eastwood\n\n Writers: \nNick Schenk (screenplay), Dave Johannson (story), and 1 more credit Ã‚Â» \n\nStars:\n Clint Eastwood, Bee Vang and Christopher Carley \n\nStoryline\n\nWalt Kowalski is a widower who holds onto his prejudices despite the changes in his Michigan neighbourhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy an old man, who can't get along with either his kids or his neighbours, a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao, a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighbourhood.\n","torrent":{"xt":"urn:btih:f7233ec94ed045be072204d337a6630420b27eca","amp;dn":"Gran+Torino+%5B2008%5DRTB.NLSub.CBCS.SH%40R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7233ec94ed045be072204d337a6630420b27eca","infoHashBuffer":{"type":"Buffer","data":[247,35,62,201,78,208,69,190,7,34,4,211,55,166,99,4,32,178,126,202]},"announce":[],"urlList":[]}}