{"title":"HKL Knockabout Retail","uid":5785744,"size":4698041768,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f7f94b01e1826a585e422d6687c67e49a258b47b&amp;dn=HKL+Knockabout+Retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heavydiamond","files":3,"time":1282613238,"description":"The film follows two con artist brothers, Yipao (Yuen Biao) and Taipao (Bryan Leung). One day they are cheated out of their ill-gotten gains in an encounter with Jia Wu Dao (Lau Kar Wing). They try to fight him, to retrieve their money, but are defeated, so they ask him to train them, hoping to become the best fighters in the city. After surpassing the fighting skills of &quot;ordinary people&quot;, Yipao soon discovers that Jia Wu Dao is a murderer. When he realises his secret has been revealed, Jia Wu Dao attempts to kill Yipao, but Taipao blocks the fatal blow and is killed in his place. Yipao escapes and plots how he will avenge his brother's death. He encounters a fat beggar (Sammo Hung) and, impressed by his kung fu, he asks takes the beggar to become his new kung fu master. After extensive training, the beggar asks Yipao to go and get him some wine. As he is about to return with the wine, Yipao encounters Jia Wu Dao again, and they fight, but Yipao's skill is insufficient. The fat beggar and Yipao then team up, using the monkey style kung fu, against Jia Wu Dao's snake style. As their fight moves outside of the wine shop, the fat beggar and Yipao defeat Jia Wu Dao, killing him with spiked vines, finally avenging Taipao's death. The fat beggar reveals that he is an undercover detective trying to arrest criminals, particularly Jia Wu Dao.\n","torrent":{"xt":"urn:btih:f7f94b01e1826a585e422d6687c67e49a258b47b","amp;dn":"HKL+Knockabout+Retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7f94b01e1826a585e422d6687c67e49a258b47b","infoHashBuffer":{"type":"Buffer","data":[247,249,75,1,225,130,106,88,94,66,45,102,135,198,126,73,162,88,180,123]},"announce":[],"urlList":[]}}