{"title":"Mivtsa Yonatan / Operation Thunderbolt (1977)","uid":5816222,"size":1467291648,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f82d3c4ed7c4008490167d6431b7681d051726fc&amp;dn=Mivtsa+Yonatan+%2F+Operation+Thunderbolt+%281977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ajkalla","files":1,"time":1283845415,"description":"\n\n\nMovie Name ; Mivtsa Yonatan / Operation Thunderbolt (1977)\n\nDirector:    Menahem Golan\n\nLanguage : Hebrew \n\nScreenplay: Menahem Golan and Clarke Reynolds\n\n\nCast:Klaus Kinski, Yehoram Gaon, Sybil Danning, Assaf Dayan, Gila   Almagor, Assaf   Dayan, Mark Heath\n\n \n\nPLot ; Based on a True Story.\n\nIt was Sunday, June 27, 1976, when armed gunmen from the Popular Front for the Liberation of Palestine, together with some German accomplices, hijacked Air France flight 139, diverting it first to Libya and then to dictator Idi Amin's Uganda. With the world looking on, the terrorists separated the Jewish and Israeli passengers from the others, threatening to kill them all if their Palestinian comrades in Israeli jails were not quickly released. Israel of back then was not in the habit of yielding to terrorist blackmail. No international summits were convened. No negotiations with the terrorists were countenanced. Instead Israel reacted - by launching a stunning military raid on July 4, 1976, freeing virtually all the captives and bringing the affair to a sudden and dramatic end.\n\nOperation Thunderbolt takes off at lightning speed to bring the riveting story of the ultimate fight for freedom to the screen. A cinematic classic in Israel, Operation Thunderbolt was nominated for an Oscar for Best Foreign Film. This special DVD edition also includes the award winner documentary &quot;Raid on Entebbe&quot; featuring on-camera the training of the forces, headquarter briefings and classified footage following by interviews with top political leaders and military commanders.\n\n\nMivtsa Yonatan (Hebrew),Operation Thunderbolt was the International Title  is the best Isreali movie made on the Rescue mission carried out by the Isreali forces to rescue a french plane carrying French and jewish passangers while it was highjacked midway and taken Entebbee Internatonal airport, the Capital of Uganda,while it was ruled General Idi Amin.\n\nThirty years have passed and the emotional baggage still mostly encumbers upon the souls who operated then, during the week which stretched from Sunday 27 June 1976, when two Germans and two Palestinians hijacked an Air France plane on flight 139 from Tel Aviv to Paris via Athens, to the operation which brought in four Hercules planes from a distance of 3800 kilometers the forces which liberated about a hundred Israeli and Jewish captives. They mostly burden the people who participated then, in order to preserve facts or to change them, to elevate heroes or to cause others to be forgotten. They return and arise over and over leading up to the anniversary, and especially this year, in spite of the great time that has passed.  \n\nPS; ITS IN HEBREW BUT MAY FIND SUBS ON THE NET.\n\t \t\n\nI HAVE BEEN SEARCHING FOR THIS MOVIE ON ALL THE TORRENT SITES BUT COULDNT FIND SO I AM UPLOADING ONE.\n\nPLEASE LEAVE COMMENTS\n\nAbout the quality; Considering it a rare movie and possibly available on the VHS i find it quite watchable.\n\n \t\nImage tag from bayimg :  \n                         1.http://bayimg.com/JaOACAAcN\n\n                         2.http://bayimg.com/jAoadaacN\n                          \n                         3.http://bayimg.com/JAoagAACn","torrent":{"xt":"urn:btih:f82d3c4ed7c4008490167d6431b7681d051726fc","amp;dn":"Mivtsa+Yonatan+%2F+Operation+Thunderbolt+%281977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f82d3c4ed7c4008490167d6431b7681d051726fc","infoHashBuffer":{"type":"Buffer","data":[248,45,60,78,215,196,0,132,144,22,125,100,49,183,104,29,5,23,38,252]},"announce":[],"urlList":[]}}