{"title":"Great White - Save Your Love  (2nafish)","uid":5760232,"size":158894084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f9ffe313c30687b960a546d1ab9a017ea544de0e&amp;dn=Great+White+-+Save+Your+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281704854,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nOnce Bitten... is the third full-length studio album released by the American rock band Great White. It was released in 1987 and sold a million copies after their next album became a success. &quot;Rock Me&quot; became a hit single and is one of Great White's best known songs. Once bitten... became a commercial success, going Platinum a few years later. In the UK, the tracklisting was strangely altered, losing four new tracks and replacing them with songs from 1986's Shot In The Dark, as well as a live version of &quot;What Do You Do.&quot;\n\nGreat White is an American hard rock band, formed in Los Angeles  in 1978. The band gained popularity during the 1980s and early 1990s. The band released several albums in the late 1980s and gained airplay on MTV with music videos for songs like &quot;Once Bitten, Twice Shy&quot;. The band reached their peak popularity with the album ...Twice Shy in 1989.\n\nThe band continued to release new material into the 1990s, although none of their material charted in the United States. In 2003, the band made headlines when The Station nightclub fire led to the deaths of 100 people in West Warwick, Rhode Island, including the band's guitarist Ty Longley, who had been a member of the band for three years. Great White made a comeback in 2007 with the release of a new album and an accompanying tour.\n\nThe band hit the mainstream in 1987 when they released Once Bitten.... &quot;Once Bitten...&quot; was certified platinum in April 1988. The album featured the hits &quot;Rock Me&quot; and &quot;Save Your Love&quot;.\n\nThe band followed up with ...Twice Shy in (1989;. The album included their biggest hit, &quot;Once Bitten, Twice Shy&quot;, for which they received a Grammy Award nomination for Best Hard Rock Performance. The album was certified platinum in July 1989 and then double platinum in September of that same year. The model Bobbie Brown (also known for being in Warrant's &quot;Cherry Pie&quot; video) appeared in the video for &quot;Once Bitten, Twice Shy&quot;. They finished off the 80s touring in support of ...Twice Shy and with some larger bands, such as Bon Jovi.\n\nIn 1990 a heavy metal video called HARD N HEAVY containing music, concert footage and interviews was released. The video included Slash and Duff from Guns N' Roses appearing with the band at a &quot;Children Of the Night&quot; Benefit concert in L.A. for abused homeless children, the performance helped raise money for housing. Both bands shared the same manager.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f9ffe313c30687b960a546d1ab9a017ea544de0e","amp;dn":"Great+White+-+Save+Your+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ffe313c30687b960a546d1ab9a017ea544de0e","infoHashBuffer":{"type":"Buffer","data":[249,255,227,19,195,6,135,185,96,165,70,209,171,154,1,126,165,68,222,14]},"announce":[],"urlList":[]}}