{"title":"A good woman[DVDrip][Spanish]","uid":5797480,"size":657407488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fa6343892b2ba79b2c48324737a7dd3c528efa50&amp;dn=A+good+woman%5BDVDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sahae","files":1,"time":1283119377,"description":"DirecciÃƒÂ³n: Mike Barker.\nPaÃƒÂ­ses: Italia, Reino Unido y EspaÃƒÂ±a.\nAÃƒÂ±o: 2004.\nDuraciÃƒÂ³n: 93 min.\nGÃƒÂ©nero: Comedia dramÃƒÂ¡tica.\nInterpretaciÃƒÂ³n: Helen Hunt (Mrs. Erlynne), Scarlett Johansson (Meg Windermere), Tom Wilkinson (Tuppy), Stephen Campbell Moore (Lord Darlington), Mark Umbers (Robert Windermere), Milena Vukotic (Condesa Lucchino), Diana Hardcastle (Lady Plymdale), Roger Hammond (Cecil), John Standing (Dumby), Jane How (Sra. Stutfield).\nGuiÃƒÂ³n: Howard Himelstein; basado en la obra &quot;El abanico de Lady Windermere&quot; de Oscar Wilde.\nProducciÃƒÂ³n: Alan Greenspan, Howard Himelstein, Jonathan English y Steven Siebert.\nMÃƒÂºsica: Richard G. Mitchell.\nFotografÃƒÂ­a: Ben Seresin.\nMontaje: Neil Farrell.\nDiseÃƒÂ±o de producciÃƒÂ³n: Ben Scott.\nVestuario: John Bloomfield.\nEstreno en EspaÃƒÂ±a: 10 Junio 2005.\n\nSituada en los aÃƒÂ±os 30 en la bellÃƒÂ­sima Riviera italiana, &quot;A good woman&quot;, es una elegante e ingeniosa comedia romÃƒÂ¡ntica basada en la obra de Oscar Wilde, &quot;El abanico de Lady Windermere&quot;. Un joven matrimonio es expues-to a un peligroso rumor que circula en la alta sociedad. Robert Windermere (Mark Umbers) es acusado de proporcionar cuantiosas sumas de dinero en secreto a Mrs. Erlynne (Helen Hunt), una ma-dura mujer de dudosa reputaciÃƒÂ³n, mientras tanto, su mujer Meg Windermere (Scarlett Johansson) llama la atenciÃƒÂ³n de Lord Darling-ton (Stephen Campbell Moore), un conocido playboy. La llegada de Mrs. Erlynne a la Costa Amalfitana la convierte en el foco de aten-ciÃƒÂ³n de todos los hombres de la Riviera, en especial de Lord Augustus &quot;Tuppy&quot; (Tom Wilkinson), quien le declara sus sentimien-tos desde el primer momento. En el 21 cumpleaÃƒÂ±os de Meg la si-tuaciÃƒÂ³n llega a un punto crÃƒÂ­tico, la joven esposa despechada huye de la fiesta para fugarse con el atractivo Lord Darlington. Cuando la verdad se descubre, las acusaciones y dudas conyugales se disi-pan, pero un oscuro secreto de familia cae sobre ellos. Mrs. Erlyn-ne sacrifica la oportunidad de un matrimonio feliz con Lord Augus-tus para permitir que Meg no cometa el error de escapar con Lord Darlington. Felizmente con su marido, Meg confiesa sus pecados a Tuppy, limpiando asÃƒÂ­ la reputaciÃƒÂ³n de Mrs. Erlynne.\n\n","torrent":{"xt":"urn:btih:fa6343892b2ba79b2c48324737a7dd3c528efa50","amp;dn":"A+good+woman%5BDVDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa6343892b2ba79b2c48324737a7dd3c528efa50","infoHashBuffer":{"type":"Buffer","data":[250,99,67,137,43,43,167,155,44,72,50,71,55,167,221,60,82,142,250,80]},"announce":[],"urlList":[]}}