{"title":"Einstein Pack Collection 4 DVD R","uid":6320490,"size":11622217428,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fb1b3ba95e2cec5458df89de8c8ef60f3d4f5f5b&amp;dn=Einstein+Pack+Collection+4+DVD+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Alemao99","files":10,"time":1302932339,"description":"1 Ã‚Âº DVD - Beyond Relativity - Einstein Revealed\n\nThis documentary not only explains the various theories of Einstein, as he describes his life faithfully. It was produced by NOVA / PBS from the notes of the scientist himself. And it will help you understand the scientific creativity that dominated the greatest name in modern physics. Redo, thanks to the resources of the drama, the extraordinary journey of a student not so bright and so a husband could not handle the &quot;unpredictability of human relations,&quot; to become the most famous physicist of all time. Check out the animations that will help you understand the Theory of Relativity. Participate in Einstein's reflections on the nature of light and merge into a continuous space-time inseparable forever changed the image we have of the universe.\n\nDiscover the secrets behind Einstein's scientific creativity.\n\nThe Theory of Relativity and the life of its creator, explained with pictures and animation.\n\nBased on memories and notes from Einstein himself.\n\nPart 1\n\n1) A Children Pleasant.\n2) Early Explorations.\n3) The Problem of Light\n4) Time of Despair.\n5) The Problem of Motion.\n\nPart 2\n\n1) Playing with gravity.\n2) Signs of Jealousy.\n3) The World in Four Dimensions.\n4) A Theory Too Beautiful to Be True.\n5) Einstein and God.\n\n2nd DVD - The Big Idea - Einstein's Big Idea - E = mc 2\n\nThis documentary not only changed the equation that explains the universe. In 1905, a young officer of an obscure Swiss patent office concluded that mass and energy are inseparable in Nature. This idea would also completely change the way we view the universe. His young formulator, Albert Einstein, would be acclaimed as the most famous name in modern physics. Nothing escaped this detailed historical re-production of NOVA / PBS.\nIt will allow the viewer to understand Einstein's equation (E = mc 2) and, concurrently, will reveal the path of other great names of science that somehow contributed to his work, as Michael Fraday, Antoine Lavoisier, and Lise Meitner.\nThe stories of these innovative giants, with their share of success and failure, love and rivalry. Politics and revenge, is a real saga, which influenced Einstein from a young age.\n\nEveryone has heard of, but you really understand what it means E = m * c 2?\nAll details of the amazing discovery that Einstein made the most brilliant scientist in modern history.\nMeet the innovative giants who influenced Einstein in the success and failure, love and rivalry, politics and revenge.\n\nChapters\n\n1) Introduction.\n2) Bern, Switzerland, 1905.\n3) &quot;E&quot; Energy - Michael Faraday.\n4) &quot;m&quot; Mass - Antoine Laurent Lavoisier.\n5) &quot;c&quot; of Celeritas - James Clark Maxwell\n6) &quot;2&quot; in the Square - Emilie du Chatelet\n7) E = mc 2 - The Holy Grail of physics.\n8) Opening the Atom - Lise Meitner.\n9) E = mc 2 - The Future.\n\n3 Ã‚Âº DVD - E = m * c2 - Equation of Life and Death of Einstein\n\nNear the 2nd World War in the late 30's, Albert Einstein wrote a letter to U.S. President Franklin Roosevelt:\n&quot;Distinguished President: The element called uranium can be turned into an important new form of energy in the immediate future. Certain aspects of this situation requires caution, and if necessary, quick action by the administration. Extremely powerful bombs of a new type, can now be built ... &quot;\nThe letter was on the application of Einstein's famous equation E = mc2 and his fear that the Nazis could use to build an atomic bomb.\nHis letter prompted a chain of events that led to the destruction of Hiroshima and Nagasaki.\nAlbert Einstein, later described the writing of this letter as the great mistake of his life.\nThis is the story of his most famous equation E = mc2 and how history and Einstein changed forever.\n\n\n4 Ã‚Âº DVD - Einstein and Eddington\n\nThe English astronomer Arthur Eddington was greatly responsible for spreading the theory of Einstein's General Relativity to the West. The first papers were published in Germany in 1915, amid the conflicts of the First World War, and were it not for the support of Eddington, and the expeditions organized in 1919 to prove it, perhaps a long time would pass before the General Relativity was finally accepted.\n\nCountry of origin: United Kingdom\nDirector: NOVA PBS and BBC in association with HBO Films.\nLength: 06:29:00\nColor: NSTC\nRelease Year: 2008\nExtension: ISO\nQuality: DvD-R\nVideo Codecs: DivX\nVideo Resolution: 720x480\nRelease Year: 2008\nScreen Format: FullScreen\nFrame Rate: 29,970\nBitrate: 128 kbps\nAudio codecs: AC3\nNumber of Channels: 2.0\nOriginal Language: English\nType of Audio: English\nSubtitles: Subtitles in Portuguese-Brazil\n\nNumber of DVDs: 4\nSize: 10.82 GB\nFile Extension:. ISO\nAudio Language: English\nVideo Quality: DVD-R\nRelease Year: 2008\nResolution: 720 x 480\nScreen Format: Fullscreen (4x3)\n\n","torrent":{"xt":"urn:btih:fb1b3ba95e2cec5458df89de8c8ef60f3d4f5f5b","amp;dn":"Einstein+Pack+Collection+4+DVD+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb1b3ba95e2cec5458df89de8c8ef60f3d4f5f5b","infoHashBuffer":{"type":"Buffer","data":[251,27,59,169,94,44,236,84,88,223,137,222,140,142,246,15,61,79,95,91]},"announce":[],"urlList":[]}}