{"title":"WHEN DOCTERS KILL : WHO, WHY AND HOW - MANTESHWER","uid":5802362,"size":1494748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb6fe3bfd381c12791c55eacf45074697b4a7d3f&amp;dn=WHEN+DOCTERS+KILL+%3A+WHO%2C+WHY+AND+HOW+-+MANTESHWER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MANTESH","files":3,"time":1283302497,"description":" &lt;a href=&quot;http://img594.imageshack.us/img594/289/39780543.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img594.imageshack.us/img594/289/39780543.jpg&lt;/a&gt;\n\n\n\nWhen Doctors Kill: Who, Why, and How\n\n\nPublisher: Springer | \n\n2010 | \n\nISBN: 1441913688 | \n\nPDF | \n\n320 pages | \n\n1.42 Mb\n\n\n\n\nSome readers may be shocked by the title of this book, and some may wonder if it is necessary to raise the uncomfortable issue of doctors killing their patients. Murder is clearly antithetical to the art and science of medicine, which is geared toward easing pain and saving lives rather than harming them. Nevertheless, doctors are people too. Physicians have the same genetic library of enabling qualities and defects as the rest of us, but their vocation places them in a position where both faculties good and bad can be exercised.\n\nWhen Doctors Kill covers the expansive breadth of the maniacs of medicine, as it presents a brief historical background that explains the social, psychological and professional profile of healers. It continues with outline of infamous serial killer physicians throughout the world, some of who chose dictatorship or terrorism over healing. The book concludes with a look at current fashions and trends in medicine. Complementary medicine and alternative therapies may have brought relief to many patients, but they have also resulted in disability, suffering, and death. Through the review of a few high profile, drug-related fatalities, the celebrity-physician relationship will be explored.\n\nDr. Perper and Dr. Cina have a combined medical experience spanning 60 years. As forensic pathologists, they witness death daily and have investigated hundreds of murders. They accept that most doctors are a force for good, but their book contains accounts of horrible atrocities and features descriptions of graphic murders committed by healers. By shining a cold light on the risks patients face today given the wide array of treatment options, the authors aim to accurately relay the circumstances of when, how, and why doctors kill.....................","torrent":{"xt":"urn:btih:fb6fe3bfd381c12791c55eacf45074697b4a7d3f","amp;dn":"WHEN+DOCTERS+KILL+%3A+WHO%2C+WHY+AND+HOW+-+MANTESHWER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6fe3bfd381c12791c55eacf45074697b4a7d3f","infoHashBuffer":{"type":"Buffer","data":[251,111,227,191,211,129,193,39,145,197,94,172,244,80,116,105,123,74,125,63]},"announce":[],"urlList":[]}}