{"title":"Virtua Cop - Elite Edition [NTSC &amp; PAL] [Multi 5], Ps2","uid":5768612,"size":256156332,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:fe18d17ebac1561e0e3e18ff31808362fb3363c9&amp;dn=Virtua+Cop+-+Elite+Edition+%5BNTSC+%26+PAL%5D+%5BMulti+5%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big_dude","files":-1,"time":1282021071,"description":"Virtua Cop - Elite Edition for the Ps2                                    Rel. 2002\n\n\nFormat:        DVD5 PAL &amp; NTSC\nLang.:         English, Italian, German, Spanish, French.\nDiscs:         2\nImage:         ISO\nGenre.:        Light Gun Game\nConversion:    Rebuild from CD to DVD.\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Both Games were tested and work.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nRelease Notes: Includes 2 Rebuild PS2 games to DVD Format, Both Pal and a Ntsc \n               Patched Version. The Screen offset on the Ntsc game isn't perfect \n               but its the best it could be patched at and hardly noticeable. You \n               can play Virtua Cop with just your controller but it sucks, get \n               yourself a Ps2 LightGun and enjoy the game how its meant to be \n               played. Virtua Cop Elite Edition only came out in CD-R Pal Format  \n               for the PS2 which is why I upgraded it, hope you like it.\n \n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nRelive the Arcade days of Virtua Cop again on your Ps2.\n\nVirtua Cop: Elite Edition is a combination of Virtua Cop 1 &amp; 2.\n\nYou play a cop who has been called out to deal with a certain situation, armed with your trusty sidearm. Enemies pop out from behind most objects and a reticule lights up around them to let you know they are armed and dangerous. You have to have quick reflexes as innocent people pop up which need to be protected.\n\nThere are 6 levels in all, 3 from each game and these levels have multiple stages. With the three difficulty levels on offer, along with the modifications you can make in the options setup such as the number of continues and auto reload and taking off the enemy indicator, you can make the game as difficult or as easy as you wish. There are multiple paths on some levels so there is some incentive to replay the levels.\n\nThere is a 2 player co-operative mode which can still be played with two light guns or you can use the Dual Shock pad. Training is also available. Even though this an old Sega Saturn game, it hasn't been improved much for the PS2 so expect a smoother gameplay of the older graphics.\n\n\nFeatures:\n\n* Featuring over 15 stage through 6 different levels.\n\n* 2 Play Cooperative mode, training mode, Gallery, and a high score ranking table.\n\n* This surely regains its crown as king of the shooters.\n\n* Supports NAMCOs G-Con 2 Light Gun.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\n(A DVD-RW probably won't work use either DVD-R or DVD+R)\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:fe18d17ebac1561e0e3e18ff31808362fb3363c9","amp;dn":"Virtua+Cop+-+Elite+Edition+%5BNTSC+%26+PAL%5D+%5BMulti+5%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe18d17ebac1561e0e3e18ff31808362fb3363c9","infoHashBuffer":{"type":"Buffer","data":[254,24,209,126,186,193,86,30,14,62,24,255,49,128,131,98,251,51,99,201]},"announce":[],"urlList":[]}}