{"title":"Batman The Brave And The Bold [NTSC][Wii][Multi5][Spanish][www.c","uid":5818205,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:feafb882ccb68eb476959e9ada3ac226ac1cfb10&amp;dn=Batman+The+Brave+And+The+Bold+%5BNTSC%5D%5BWii%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":3,"time":1283905211,"description":"Resumen:\nPonte en la piel del cruzado de la capa y reparte tu propia idea de justicia en un juego cargado de acciÃƒÂ³n, que a buen seguro sacarÃƒÂ¡ tu lado mÃƒÂ¡s heroico. Basado en la exitosa serie de animaciÃƒÂ³n, Batman: El IntrÃƒÂ©pido Batman - El Videojuego te llevarÃƒÂ¡ desde las calles de Gotham a planetas desconocidos, pasando por ciudades abandonadas y laboratorios en islas remotas. Lugares donde te las verÃƒÂ¡s con algunos de los villanos mÃƒÂ¡s astutos.\nEste juego, que cuenta con la ambientaciÃƒÂ³n de la serie de animaciÃƒÂ³n, hace alarde de increÃƒÂ­bles grÃƒÂ¡ficos y animaciones pensados para sumergirte de lleno en el mundo del cÃƒÂ³mic de Batman. A medida que exploras los exuberantes y variados entornos 2D, te toparÃƒÂ¡s con acertijos dispuestos a frenar tu avance, y no mencionemos ya el continuo devenir de malos y jefes, todos ellos con una necesidad imperiosa de que les enseÃƒÂ±en modales y lecciones de civismo. Vete preparando para encontrarte con personajes de la talla de Catwoman, Gorilla Grodd y el Caballero Fantasma, mientras intentas restaurar la ley y el orden allÃƒÂ¡ donde vayas.\nPonte la famosa capa negra y adÃƒÂ©ntrate en el mundo de Batman: El IntrÃƒÂ©pido Batman y acepta la tarea de arrasar con el crimen allÃƒÂ¡ donde surja. Un trabajo solo apto para verdaderos superhÃƒÂ©roes.\n\nCaracterÃƒÂ­sticas:\nÃ‚Â· ConviÃƒÂ©rtete en Batman en la adaptaciÃƒÂ³n al videojuego de la exitosa serie de animaciÃƒÂ³n Batman: El IntrÃƒÂ©pido Batman.\nÃ‚Â· Ponte en la piel de otros superhÃƒÂ©roes como Robin, Green Lantern y Hawkman, y alÃƒÂ­ate con un segundo jugador para disfrutar del modo aventura cooperativo.\nÃ‚Â· GrÃƒÂ¡ficos y animaciones muy cuidados harÃƒÂ¡n que el mundo de los dibujos animados cobre vida mientras viajas desde Gotham City a un planeta desconocido.\nÃ‚Â· Los jugadores que posean las versiones de Wii y de Nintendo DS del juego podrÃƒÂ¡n desbloquear un nuevo personaje controlable conectando ambas consolas de forma inalÃƒÂ¡mbrica","torrent":{"xt":"urn:btih:feafb882ccb68eb476959e9ada3ac226ac1cfb10","amp;dn":"Batman+The+Brave+And+The+Bold+%5BNTSC%5D%5BWii%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feafb882ccb68eb476959e9ada3ac226ac1cfb10","infoHashBuffer":{"type":"Buffer","data":[254,175,184,130,204,182,142,180,118,149,158,154,218,58,194,38,172,28,251,16]},"announce":[],"urlList":[]}}