{"title":"Convention Elettorale PdL Comune Milano 2011 [Mp3 ITA] TNT Villa","uid":6328882,"size":49179375,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:feea5e9e3a997a6d7a7db4bea272ad18a90c3621&amp;dn=Convention+Elettorale+PdL+Comune+Milano+2011+%5BMp3+ITA%5D+TNT+Villa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1303212735,"description":"Convention Elettorale PdL Comune Milano 2011 [Mp3 ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=248526&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=248526&lt;/a&gt;\n\nIl sindaco uscente, Letizia Moratti, illustra il programma per cui chiederÃƒÂ  i voti dei cittadini della cittÃƒÂ  meneghina oltre che per completare il lavoro fatto in questi ultimi 5 anni: Nuovi criteri tariffari per la famiglia, criteri per conciliare i tempi della cittÃƒÂ  e del lavoro con quelli della famiglia, potenziamento sportelli per aiuti alla famiglia con bonus bebÃƒÂ¨ e bonus nonni per aiutare chi deve prendersi cura degli anziani e raddoppiare il numero degli anziani che restano in famiglia senza essere ospitalizzati, potenziare tutti i servizi per i disabili, recupero delle aree dismesse e valorizzazione della periferia, potenziamento dei servizi online per le prenotazione, trasparenza amministrazione. potenziamento del call center, cittÃƒÂ  piÃƒÂ¹ sicura attraverso l'azzeramento dei clandestini, costruzione 5 nuovi parchi, completamento raggi verdi, piste ciclabili e percorsi ciclo-pedonali, potenziamento bike e elettrocar sharing, valorizzazione delle cascine, completamento teleriscaldamento, completamento delle 2 nuove linee della metropolitana entro il 2015. Tutto questo senza gravare sulle tasche dei cittadini. Mantenimento delle attuali tariffe senza aumenti e non sara utilizzata la facoltÃƒÂ  di aumentare la IMU ma anzi sarÃƒÂ  abbassata per le imprese in situazione di difficoltÃƒÂ . Creazione della free tax area per attrarre investimenti/risparmio e sostegno alle imprese per l'accesso al credito. Creazione 2 nuovi musei entro 2 anni. Grazie ad EXPO si costruiranno 61 mila posti di lavoro all'anno da ora al 2020.\n\nIl Presidente del Consiglio dei Ministri approfitta del palcoscenico per continuare il suo personale attacco alla magistratura ed al Presidente della Camera dei Deputati, mentre giÃƒÂ  stava infuriando la polemica per i manifesti fatti affiggere dal candidato del PdL Roberto Lassini con la scritta &quot;Via BR dalle Procure&quot;, accusandolo di avere stipulato un patto ignobile con il cosiddetto &quot;sindacato dei giudici&quot;; Il Cavaliere avrebbe saputo direttamente da &quot;un magistrato&quot; dell'accordo tra Fini e i pm: protezione per il leader FLI in cambio di uno stop ad ogni tentativo di riforma del sistema giudiziario. Questa dichiarazione porterÃƒÂ  nelle prossime ore l'On. Di Pietro a presentare una denuncia per accertare se sia ciÃƒÂ² veritÃƒÂ  o ci sia calunnia.\n &lt;a href=&quot;\nhttp://i65.photobucket.com/albums/h218/Dilling/ConventionPDLComuneMilano2011.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i65.photobucket.com/albums/h218/Dilling/ConventionPDLComuneMilano2011.png&lt;/a&gt;","torrent":{"xt":"urn:btih:feea5e9e3a997a6d7a7db4bea272ad18a90c3621","amp;dn":"Convention+Elettorale+PdL+Comune+Milano+2011+%5BMp3+ITA%5D+TNT+Villa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feea5e9e3a997a6d7a7db4bea272ad18a90c3621","infoHashBuffer":{"type":"Buffer","data":[254,234,94,158,58,153,122,109,122,125,180,190,162,114,173,24,169,12,54,33]},"announce":[],"urlList":[]}}