{"title":"Yugapurushan 2010 Malayalam VCDRip","uid":5757829,"size":680450674,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ff2ebb99f3f9143d52264feee3627b03151863c7&amp;dn=Yugapurushan+2010+Malayalam+VCDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kuttunni","files":2,"time":1281623209,"description":"[CENTER] Starring : Thalaivasal Vijay, Mammootty, Jagathy Sreekumar, Kalabhavan Mani, Saikumar, Devan, Siddique, \nBabu Antony, Thambi Antony, Kalpana, Navya Nair\nMusic by : Mohan Sitara\nDirected by: R.Sukumaran\nProduced by: A.V.Anoop(Medimix) A.V.A Productions\nWritten by : R.Sukumaran\n[/CENTER]\n\nMovie Review in English\n\nThere is no denying that it's incredibly tough to pull a biopic off. The amount of research that it demands, the kind of accuracy that has to be retained throughout and the constant demand to stick real close to the facts often make the endeavor an exasperating one. \n\n'Yugapurushan' is well acted and seriously mounted, but maintains a half way stand between being a biopic and a historical. As a historical it remains a bit too concerned with its protagonist, and lets history move towards the periphery of the narrative. As a biopic, 'Yugapurushan' fails to leave a mark, and very rarely rises above a chronicled picturisation of the great sage's most popular sermons. \n\nThe film as it is, documents the chief happenings during the age, and it's unquestionable that the Guru is invariably linked to most of these milestones. The Vaikom Satyagraha with T K Madhavan (Devan) at its helm, the meeting of the Guru with contemporary legends as Gandhiji and Tagore, or the capsizing of the 'Redeemer' are thus finely captured in the film. \n\nThe factual precision that the film maintains throughout is impressive. There are few instances that have escaped the eyes of the filmmaker and starting off with the installation of the Sivalinga at Aruvippuram, he takes us on a journey with the spiritual master as he sets up several temples across the state for the downtrodden. His personal relations with his contemporaries and disciples are explored to a limited extent, be it with Sahodaran Ayyappan (Jishnu), Dr.Palpu (Siddiq) or Pavitran Namboothiri (Sai Kumar). The film ends with the final installation of the mirror as an idol at Kadavamkodam temple. \n\nThere are two characters that refuse to be transformed by the passage of time in the film. K C Kuttan, (Mammootty) the firebrand revolutionary who lends a staunch support to the Guru, and Kumaranasan (Saji Vakkanad) the reformer poet who initiated a social revolution through his verse, remain as young as ever, even as the Guru grows older. That they are icons of truth and that truth never grows old might be an explanation, but how would one then explain the Guru growing old, since there is no greater icon of truth than the Sage himself? \n\nThere are any number of personae, who walk into the film from across history, and every time it happens, there is a detrimental yank in the account when someone standing around forces a question to find out and let us know who has just arrived. Hence, when a sprightly young man (Babu Antony) challenges the upper caste goons to even as much lay a finger on his hapless associates, someone among the crowd makes his way forward and asks him who he is. Ayyankali is the answer. \n\nThe fictional elements in the film that the director brings in to hold a mirror to the highly corroded social landscape are what fail him terribly. The dramatics go overboard both with Paramu (Jagathy Sreekumar), the drunkard who makes life a hell for his family or Koran (Kalabhavan Mani) who marries Savitri Antarjanam (Navya Nair) and who sets off a radical social reform movement. There are also undeniable flashes of superstardom in K C Kuttan, when he embarks on a rampage against social inequity and proclaims that brawn is as necessary as brains in this struggle. \n\nThe remarkable similarity of Thalaivasal Vijay to the Guru might seem astonishing, and the actor leaves us breathless with a performance that brims over with such fine nuances and compassion, and that is sure to win him several laurels. The unmistakable piousness in his eyes and the dejection and grief that finally creep into them as he laments the futility of his efforts, ensure that the film entirely belongs to him. \n\nThe period sets and the costumes have a tableau like accuracy to them that makes it more picture perfect and perhaps a tad less natural. The song that sounded more like an emotional flare-up and the few action sequences that appear like unneeded diversions, might have been added on as an afterthought. \n\nIt's only in the final moments of the film that we get to the see the Guru as a person; till then he eludes us in a mysterious sort of way, and we get to see him more through the eyes of several others. The portrait of the Guru is unrevealed till the very end, and as much as the biography remains well intentioned, it leaves us wanting for much more.\n","torrent":{"xt":"urn:btih:ff2ebb99f3f9143d52264feee3627b03151863c7","amp;dn":"Yugapurushan+2010+Malayalam+VCDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff2ebb99f3f9143d52264feee3627b03151863c7","infoHashBuffer":{"type":"Buffer","data":[255,46,187,153,243,249,20,61,82,38,79,238,227,98,123,3,21,24,99,199]},"announce":[],"urlList":[]}}